{"_id":"55fb1515-130a-4c74-9eb3-90a2b6412739","name":"Sample","safeName":"sample","description":"This is a sample description","body":"","visible":false,"locationRefId":"287678ac-8d7b-48ea-b0d8-7e8f80957b0a","created":{"$date":"2016-03-30T00:23:00.000Z"},"__v":0}
{"_id":"94eb24fb-ee12-499e-9711-09520062193e","name":"Kakagi Lake","safeName":"kakagi-lake","description":"The 32-unit Kakagi Lake property is host to the Penn Gold Occurrence where chip sampling has returned 12.75 g/t gold over 3.0 meters.  Drilling by Inco in a parallel zone (dubebd the Rainbow Zone) has intersected values up to 3.5 g/t gold over 4.7 meters.  Three other gold zones are on the property.","body":"\u003ch3\u003eLocation and Access\u003c/h3\u003e\u003cp\u003eThe 32-unit Kakagi Lake property is located on a large peninsula on the north side of Kakagi Lake (locally called Crow Lake) 15 km north of Nestor Falls, Ontario. Nestor Falls is on the Kenora - Fort Frances Highway 71, approximately 120 km southeast of Kenora and 95 km northwest of Fort Frances, Ontario. Access is by motor boat from any of the commercial tourist camps on Kakagi Lake.\u0026nbsp; Alternatively, a float plane air base is located at Nestor Falls.\u0026nbsp; The Cameron Lake road, which trends eastward from Highway 71, 30 km north of Nestor Falls, leads to the Cameron Lake gold mine (20 km east of the highway).\u003c/p\u003e\u003ch3\u003eGeology\u003c/h3\u003e\u003cp\u003eThe Kakagi Lake property lies within the western portion of the Wabigoon Subprovince of the Superior Province characterized by broad expanses of supracrustal rocks with synvolcanic, polyphase batholiths and minor gneissic units (Blackburn et al. 1991).\u0026nbsp; The area north of Kakagi Lake is transected by the Cameron Lake fault, a major regional northwest trending fault. A steeply dipping, east-west trending fault-shear zone is evident at the eastern end of Kakagi Lake. A major syncline occurs in the Emm Bay - Peninsula Bay area, while a major anticline occurs through the middle of the penninsula covering the Kakagi Lake property.\u0026nbsp;\u003c/p\u003e\u003cp\u003eThe Kakagi Lake itself property covers an irregular gabbroic intrusion occurring within the mafic metavolcanics.\u0026nbsp; Most of the property is metamorphosed mafic and ultra mafic intrusive rocks. These range from gabbro to peridotite. Five small areas of felsic to intermediate meta volcanics and intercalated metasediments of dacite tuff, pyroclastic breccia and tuff breccia are mapped. Several felsite dikes were observed.\u0026nbsp; OGS Map 2447 indicates that the intrusive is layered and much more complex than previously interpreted, with numerous 'schist zones', shearing and carbonate alteration mapped.\u003c/p\u003e\u003ch3\u003ePrevious Work\u003c/h3\u003e\u003cp\u003eThe Kakagi-Rowan Lakes greenstone belt was the scene of significant gold exploration in the early 1900's. The first discoveries in the Kakagi-Rowan lakes area were gold occurrences at the western end of Sullivan Bay on Rowan Lake (Reliance, Monte Cristo, and Victor showings). These prospects were explored by adit, shallow shafts, trenching and diamond drilling by Lakeport Gold Mines Ltd. and the Victor Company. In addition, gold-bearing quartz veins (Martin-Kenty Prospect/Otonabee Mine) were discovered southwest of Flint Lake.\u0026nbsp;\u003c/p\u003e\u003cp\u003eGold exploration activity increased in the area during the 1930's and 1940's as a result of an increase in the price of gold.\u0026nbsp; In May of 1945 Roy Martin and Leo Turcotte made a gold discovery in a carbonate zone on the peninsula in Kakagi Lake. When sampling the zone, a fair sized piece of free gold was noted. \u0026nbsp;\u003c/p\u003e\u003cp\u003eIn 1974 Roy Martin and Jack Martin with Angus MacDonnell rediscovered the Martin-Turcotte Gold Showing and renamed it the 'A' Zone (later referred to as the 'Penn Gold Occurrence').\u0026nbsp; Reconnaissance led to the discovery of three more gold showings they called the B, C and D Zones.\u0026nbsp; Sampling by this syndicate group assayed as high as 0.41 oz. gold across 10 feet in the 'A' Zone and 10 feet of 0.14 oz. gold in the 'D' Zone.\u0026nbsp; The four gold zones are on the north limb of a major anticline.\u0026nbsp; The syndicate optioned the property to Welcome North Mines, who expanded upon the four zones located by the Syndicate, and uncovered a fifth zone they named the 'E' zone.\u003c/p\u003e\u003cp\u003eIn 1985, Canadian Nickel (Inco) took an option on the property from Welcome North Mines (Penn Property).\u0026nbsp; Surface work by Inco included geophysical surveys, trenching, geological mapping and diamond drilling.\u0026nbsp;\u003c/p\u003e\u003ch3\u003eProperty Mineralization\u003c/h3\u003e\u003cp\u003eThe gold zones on the property are in altered carbonated gabbro intruded by quartz stringers and veins from 1/4\" to 2 feet wide. In places the gabbro is slightly to intensely sheared. The quartz is mineralized with cube iron pyrite, magnetite and some chalcopyrite. Tourmaline was noted in some of the quartz. The contact of quartz with the altered gabbro is in places heavily mineralized for several inches into the gabbro.\u003c/p\u003e\u003ch4\u003e'A' Zone\u003c/h4\u003e\u003cp\u003eThe 'A' zone represents the original discovery made by Martin and Turcotte in 1945.\u0026nbsp; It is a slightly sheared, carbonated, and altered gabbro with quartz stringers 1/4\" to 8\" wide and mineralized with pyrite and magnetite. The strike is east-west with a dip of 80\u0026deg; north.\u0026nbsp; On the eastern section of the zone, 60 feet of trenching has been blasted. Six chip samples each 10 feet long were taken across the trench. The best sample assayed 0.41 oz. gold across 10 feet.\u0026nbsp; Two trenches to the west of this trench assayed up to 0.02 oz/t gold.\u0026nbsp; Prospecting to the north, and adjoining this zone, indicated a 40 foot wide area 250 feet long with 'many good to very good pannings'. \u0026nbsp;A cedar swamp and low ground adjoins this area to the north.\u0026nbsp; The zone may be as much as 50-100 feet wide and has been traced along strike for 1,600 feet and is open to the west.\u0026nbsp; Approximately 2,000 feet west of this point, a zone of prominent shearing has been noted by Kaye (1981). It is possible that the anomaly could extend to this point.\u003c/p\u003e\u003ch4\u003e'B' Zone\u003c/h4\u003e\u003cp\u003eThe 'B' zone is an outcrop 30 feet wide and 75 feet long 1,320 feet west and 200 feet south of the 'A' zone.\u0026nbsp; It is a carbonated, altered gabbro with quartz stringers and lenses 1/2\" to 6\" wide.\u0026nbsp; The strike of the zone is east-west. Some fair pannings have been noted from this zone. A 20 foot blasted rock trench assayed 0.02 oz/t gold.\u003c/p\u003e\u003ch4\u003e'C' Zone\u003c/h4\u003e\u003cp\u003eThe 'C' zone is 700 feet south and 50 feet west of the 'B' Zone. It is a carbonated, altered gabbro with 1/2\" to 4\" wide quartz stringers mineralized with pyrite.\u0026nbsp; The strike is east-west with a dip of 80\u0026deg; north. The zone is 40 feet wide.\u0026nbsp; The centre of the zone is intensely sheared and pans fair tailings of gold. The south 15 feet of the zone is silicious with quartz stringers.\u0026nbsp; This was blasted and assayed trace gold across 15 ft.\u003c/p\u003e\u003ch4\u003e'D' Zone\u003c/h4\u003e\u003cp\u003eThe 'D' zone is 130 feet southwest of the 'C' zone.\u0026nbsp; Rusty dirt along a 100 foot north-south area panned a little gold. A 110 foot trench was blasted along the zone.\u0026nbsp; The zone is a carbonated, altered gabbro with quartz stringers from 1/2\" to 1 foot wide.\u0026nbsp; The strike of the zone varies from 60\u0026deg;- 75\u0026deg;with a dip of 80\u0026deg;N . At the north end of the trench it is slightly sheared for 20 feet then a further 65 feet which is intensely sheared. The last 30 feet is hard and silicious.\u0026nbsp; The trench was sampled in 10 foot sections. \u0026nbsp;The first 90 feet assayed trace to 0.01 oz/t gold, with the next 10 foot section assaying 0.14 oz/t gold and the final 10 foot section assaying 0.02 oz/t gold.\u003c/p\u003e\u003ch4\u003e'E' Zone\u003c/h4\u003e\u003cp\u003eThe 'E' zone is sixty meters southwest of the 'D' Zone is a 60 meter wide carbonated gabbro zone containing 15-20% quartz stringers up to 0.61 meters wide striking with and across the zone. The zone contains up to 2% pyrite and considerable green mica (fuchsite). The zone shows remarkable similiarities to the Kerr Addison Mine.\u0026nbsp; The zone consists of 9 trenches over a strike length of about 150 feet within a very large and impressive zone of intense quartz-carbonate-fuchsite alteration. This area is obviously an extension of 'C' and 'D' zones and can be traced to the west to the lake shore. Quartz veining is more intense here with veins as much as 3 feet wide occurring at various orientations. Two major sets appear to be present; an easterly striking set which dips steeply north or south, and a northerly striking set which dips shallowly (15\u0026deg;-30\u0026deg;) to the east. All these veins are typical gash veins - usually pinching out over short (50-100 feet) distances. Five random chip samples were taken from trenches in this zone by Welcome North Mines, with the best sample returning 0.053 oz Au/ton.\u003c/p\u003e\u003cp\u003eThe drilling by Inco between 1985-87 returned numerous gold intercepts.\u0026nbsp; It appears that their best intersections came from a zone they dubbed the 'Rainbow Zone', which seems to align with the 'C' zone identified by Welcome North Mines.\u0026nbsp; Some of the better drill intercepts reported were:\u003c/p\u003e\u003cul\u003e\u003cli\u003e2.25 meters of 3.1 g/t Au\u003c/li\u003e\u003cli\u003e4.72 meters of 3.5 g/t Au (DDH-70465)\u003c/li\u003e\u003cli\u003e0.38 meters of 96.0 g/t Au (DDH-70449)\u003c/li\u003e\u003cli\u003e1.46 meters of 5.4 g/t Au\u003c/li\u003e\u003cli\u003e0.49 meters of 31.0 g/t Au (DDH-70471)\u003c/li\u003e\u003c/ul\u003e\u003cp\u003eThe Ministry website for the \u003ca href=\"http://www.geologyontario.mndmf.gov.on.ca/gosportal/gos?command=mndmsearchdetails:mdi\u0026amp;uuid=MDI52F04NW00008\"\u003ePenn Gold Occurrence\u003c/a\u003e (UTM Zone 15, 435917E, 5455127N, NAD 83) lists Inco's best assay as 0.18 oz/t (5.6 g/t) gold over 10 meters from DDH-70465 located approximately 300 meters east of the occurrence.\u0026nbsp; The hole intersected altered gabbro and minor quartz veins from 144 to 184 meters that returned up to 24.9 g/t gold. (Canadian Nickel Assessment Files 52F04NW).\u003c/p\u003e\u003ch3\u003eSummary\u003c/h3\u003e\u003cp\u003eThe property is located in a structurally favourable area on the hinge of a fold and hosts highly silicified, carbonatized gabbros and sericite schists, which are similar to the Dogpaw Prospect between Cameron Lake and Beggs Lake.\u0026nbsp; Five gold-bearing zones have been located within the property.\u0026nbsp; One of these zones, dubbed the 'Rainbow Zone' (Welcome North Mines 'C' zone) has been drilled along strike for 300 meters and is open at depth.\u0026nbsp; The property hosts relatively unexplored prospects with good potential for development of a large tonnage of low grade gold mineralization.\u0026nbsp; The \"A\" zone in particular appears to be 50-100 feet wide and may strike for as much as 3,600 feet and has seen very limited drilling.\u003c/p\u003e\u003cp\u003eThe Cameron Lake gold deposit, owned by Coventry Resources is just 12 km northeast of the property and contains an estimated 12.2 million tonnes grading 2.11 g/t gold (1.4 million ounces).\u0026nbsp; Coventry is currently active in the area and is exploring additional area deposits as well as upgrading resources at the Cameron Lake Deposit.\u003c/p\u003e\u003cp\u003eIn addition to the property's gold zone, the gabbro should be evaluated for its PGE potential.\u0026nbsp; It is not believed that the PGE potential has ever been considered, and that future sampling should be assayed for the PGE suite of elements.\u003c/p\u003e","visible":true,"locationRefId":"2b1c6a76-c675-46be-bdc3-a8c16a17f001","created":{"$date":"2013-04-06T00:00:00.000Z"},"__v":0}
{"_id":"322c97fe-919e-4239-b94a-27c55d3cbbbc","name":"Perch Lake","safeName":"perch-lake","description":"The Perch Lake property straddles a 6.5 kilometre section of the Terrace Bay batholith contact.  The vast majority of gold occurrences, and past producers in the Schreiber-Terrace Bay-Jackfish Lake area are scattered along this contact.","body":"\u003cdiv class=\"WordSection1\"\u003e\n\u003ch3\u003eIntroduction\u003c/h3\u003e\n\u003cp\u003eThe Perch Lake property consists of 60 unpatented claim units and is located in the western portion of the Hemlo-Schreiber greenstone belt a distance of 210 kilometres east of Thunder Bay.\u0026nbsp; The property straddles a 6.5 kilometre section of the Terrace Bay batholith contact stretching from the Aguasabon River in the west to Bews Lake in the east.\u0026nbsp; The vast majority of gold occurrences, and past producers in the Schreiber-Terrace Bay-Jackfish Lake area are scattered along this contact.\u0026nbsp; The underground workings of the Empress gold mine are just 5 kilometres from the eastern boundary and the Jedder gold occurrence just 3 kilometres from the western boundary.\u003c/p\u003e\n\u003ch3\u003eLocation\u003c/h3\u003e\n\u003cp\u003eThe property has excellent access.\u0026nbsp; An all-weather gravel logging road cuts through the central part of the property just north of the Terrace Bay Airport.\u0026nbsp; The Trans-Canada highway cuts across the western section of the property.\u003c/p\u003e\n\u003ch3\u003eGeology\u003c/h3\u003e\n\u003cp\u003eThe property is located within the Wawa sub-province of the Superior structural province near the western end of the Hemlo-Schreiber greenstone belt.\u0026nbsp; The dominant rock type consists of mafic volcanics and iron formation which have been intruded by quartz-feldspar porphyry dikes related to the batholith.\u0026nbsp; The property covers the contact of the batholith between the Empress Mine and the Jeddar veins at Hays Lake.\u0026nbsp; Alteration zones, and quartz/quartz-carbonate veins commonly occur near the contact zone between the mafic volcanics and the granite batholith.\u0026nbsp; In addition are numerous mapped exhalative horizons (Bartley, Harcourt, 1938) which may represent distal portions of volcanogenic base-metal deposits.\u0026nbsp; Properties such as the Harkness-Hays, Gold Range, Hays Lake and Empress, which have undergone minor development and production are all associated with the contact zone of the Terrace Bay batholith.\u003c/p\u003e\n\u003cp\u003eThe two most important exploration criteria are: (1) evidence of hydrothermal fracturing and alteration, and (2) rocks that are attributable to felsic magmatism.\u0026nbsp; Adoption of these criteria have led to success at Hemlo, both in characterizing mineralization and in finding additional auriferous zones.\u0026nbsp; It is believed that similar success can be realized in the Schreiber area (Schneiders, MNDM, Thunder Bay).\u003c/p\u003e\n\u003ch3\u003ePrevious Exploration\u003c/h3\u003e\n\u003cp\u003eSporadic exploration has been reported in the area since the late 1890's, but is not well documented.\u0026nbsp; More recently, an electro-magnetic airborne survey was flown in 1971, and some spotty exploration conducted during the Hemlo rush in 1982.\u003c/p\u003e\n\u003cp\u003eThe Empress gold mine is a mere 4 kilometers to the east along strike of our claim block.\u0026nbsp; The Empress, was discovered in 1895 and produced gold until 1900.\u0026nbsp; Native gold is found with pyrite and small amounts of other sulphides in two parallel zones of quartz veins about 150 feet apart.\u0026nbsp; The granite contact is a few hundred feet to the south.\u003c/p\u003e\n\u003c/div\u003e\n\u003ch3\u003eSummary\u003c/h3\u003e\n\u003cp\u003eThere is a one kilometre wide alteration zone associated with the volcanic-batholith contact. There are over 30 gold occurrences associated with the western 10 km portion (Aguasabon River to Worthington Bay).\u0026nbsp; There are over 20 gold showings along the eastern 20 km section of the contact (Bews Lake to Jackfish Bay).\u0026nbsp; Ironically, there have been no documented occurrences along this portion.\u0026nbsp; The lack of success may be, in part, attributed to overburden cover in the western half of the property.\u0026nbsp; With so many gold occurrences both east and west of the property, it stands to reason that the 6.5 kilometer section of this same contact on the property should host several more, yet un-discovered occurrences.\u003c/p\u003e","visible":true,"locationRefId":"c5348daf-ee53-44ae-bfc6-2b3584d33ce5","created":{"$date":"2014-03-23T00:00:00.000Z"},"__v":0}
{"_id":"759faec1-fe6b-4aa6-a28a-c8a9429cf15f","name":"Galoche Lake","safeName":"galoche-lake","description":"The Property contains the eastern portion of a mafic-ultramafic intrusion with potential to host a disseminated Cu-Ni-PGE deposit, as well as being immediately along strike of a high-grade gold zone consisting of sheared granitoid rock grading up to 16.95 g/t Au.","body":"\u003ch3\u003eAccess\u003c/h3\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003eAccess to the property is via the Twist Lake Road, a reasonably well-kept, former logging road that originates from the town of Manitouwadge.\u0026nbsp; Alternatively, one can drive to the south end of Dead Otter Lake, and then boat to the east end of the northern arm of Dotted Lake.\u003c/p\u003e\n\u003ch3 class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003eGeology\u003c/h3\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003eFoliated mafic volcanic rocks trend east-northeast across the northern end of the property.\u0026nbsp; In the north-central part of the claim block, a 300 meter wide gabbro sill intrudes the mafic volcanics.\u0026nbsp; Immediately to the south of the gabbro unit is a serpentized peridotite.\u0026nbsp; The southernmost part of the claim block consists of foliated biotite-quartz monzonite or granodiorite.\u003c/p\u003e\n\u003ch3 class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003ePrevious Work in the Area\u003c/h3\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e1957 - Robert Fairservice discovered a zinc showing near the north arm (west shore) of Dotted Lake.\u0026nbsp; The showing lies within a sheared, garnetiferous amphibolite and possibly metamorphosed iron formation.\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e1965 - Irish Copper Mines flew an airborne survey of the area surrounding the north part of Dotted Lake.\u0026nbsp; The results of the survey identified a large section of high magnetic activity.\u0026nbsp; They interpreted this to be mafic and ultramfic intrusives and suggested that the area may be the northern limb of a folded structure similar to the one at Manitouwadge.\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e1970 - Irish Copper Mines performed a ground Mag/EM survey over the lake area to further delineate the mafic/ultramafic rocks mapped on the north shore of Dotted Lake.\u0026nbsp; A number of conductive zones identified from both the 1965 and 1970 surveys were never followed up.\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e1983 - Clear Mines flew an airborne survey and performed geological mapping, geochem (577 soil samples) and prospecting on the north end of Dotted Lake.\u0026nbsp; They identified a number of significant soil anomalies.\u0026nbsp; Of particular interest was a 3-line Ni-Co-As anomaly on the east part of their property that indicated potential for magmatic disseminated sulphide mineralization in the gabbro.\u0026nbsp; They recommended follow up work including trenching.\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e1984 - Clear Mines performed a ground mag/VLF survey.\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e1991 - Noranda Exploration performed mag, VLF-EM (EM-16 unit), HLEM (MaxMin) surveys and three diamond drill holes.\u0026nbsp; The surveys identified a number of mag anomalies and VLF conductors.\u0026nbsp; The HLEM survey defined two important conductors (H1 and H2).\u0026nbsp; H1 is aligned with the eastern strike extension of the Fairservice Zinc Occurrence, while H2 was presumed to map lenses of sulphides associated within the gabbro.\u0026nbsp; Noranda drilled three holes, 1.8 km apart, along the zinc horizon.\u0026nbsp; The HLEM conductor (H2) in the gabbro was not drilled.\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e2005-2010 \u0026ndash; Rouge Resources conducted Mag/VLF/EM, geochem and trenching on the northwest side of Dotted Lake.\u0026nbsp; The 2010 trenching program uncovered a high-grade gold zone consisting of sheared granitoid rock with 5-10% pyrite, strong sericite and a trace of arsenopyrite.\u0026nbsp; The zone assayed up to 16.95 g/t Au in grab samples and 9.02 g/t Au over 0.4 meters in a channel sample.\u003c/p\u003e\n\u003ch3 class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003eSummary\u003c/h3\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003eThe relatively recent discovery by Rouge Resources of high-grade gold in granitoid rock close to the mafic-ultramafic intrusion has brought new interest into the area.\u0026nbsp; Noranda\u0026rsquo;s work in 1991 identified a significant HLEM conductor (H2) that appears to lie along strike of Rouge\u0026rsquo;s new find.\u0026nbsp; There exists high potential for similar mineralization along strike within the Galoche Lake Property.\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003eFurther, Nickel One has found remnant ultramafic rocks containing Cu-Ni-PGE in the Bulldozer Lake Intrusion immediately east of the property in two discrete showings (Tyko and Tyko North).\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003eTyko Showing\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003eTK-06-01 - 4.1 meters 1.09% Ni, 0.77% Cu, 0.42 g/t Pt, 0.42 g/t Pd\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003eTyko North Showing\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003eTK-06-3 - 4.1 meters 1.07% Ni, 0.51% Cu, 0.24 g/t Pt, 0.12 g/t Pd\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003eTK-06-5 - 6.2 meters 1.05% Ni, 0.47% Cu, 0.20 g/t Pt, 0.12 g/t Pd\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003eThe Galoche Lake Property shows similarities to the Nickel One Project in that it contains the extension of a mafic-ultramafic intrusion with potential to host a disseminated Cu-Ni-PGE deposit.\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003eFinally, the zinc-bearing magnetite iron formation that hosts the Fairservice Occurrence to the west, strikes across the full length of the property.\u0026nbsp; Due to the area\u0026rsquo;s lack of detailed ground work, the Galoche Lake Property is an extremely attractive grass roots project.\u003c/p\u003e","visible":true,"locationRefId":"287678ac-8d7b-48ea-b0d8-7e8f80957b0a","created":{"$date":"2015-06-14T14:55:00.000Z"},"__v":0}
{"_id":"ef508222-4427-4d1e-84ed-92522e37b2f1","name":"Minnow Lake","safeName":"minnow-lake","description":"The Minnow Lake claims contain iron formation, felsic fragmental rocks and carbonate alteration within mafic volcanics that are associated with EM conductors.","body":"\u003ch3\u003eIntroduction\u003c/h3\u003e\n\u003cp\u003eThe Minnow Lake property consists of 28 unpatented claim units about 200 kilometres east of Thunder Bay.\u0026nbsp; The property has excellent access, with an all-weather gravel logging road, just north of the Trans-Canada highway, cutting across the claims.\u003c/p\u003e\n\u003ch3\u003eGeology\u003c/h3\u003e\n\u003cp\u003eThe property is located within the Wawa sub-province of the Superior structural province near the western end of the Hemlo-Schreiber greenstone belt.\u0026nbsp; The dominant rock type consists of mafic volcanics and iron formation which have been intruded by quartz-feldspar porphyry dikes related to the batholith.\u0026nbsp; The property covers two exhalative horizons (Map 47J, Bartley, Harcourt, 1938).\u0026nbsp; Properties such as the Harkness-Hays, Gold Range, Hays Lake and Empress, which have undergone minor development and production are all associated with exhalative horizons near the contact zone of the Terrace Bay batholith.\u003c/p\u003e\n\u003ch3\u003eArea Exploration\u003c/h3\u003e\n\u003cp\u003eSporadic exploration has been reported in the area since the late 1890's, but is not well documented.\u0026nbsp; More recently, an electro-magnetic airborne survey was flown in 1971, and some spotty exploration conducted during the Hemlo rush in 1982.\u0026nbsp; The Empress gold mine is five kilometers to the east along strike of the Minnow Lake property.\u0026nbsp; The Empress, was discovered in 1895 and produced gold until 1900.\u0026nbsp; Native gold is found with pyrite and small amounts of other sulphides in two parallel zones of quartz veins about 150 feet apart.\u0026nbsp; The granite contact is a short distance to the south.\u003c/p\u003e\n\u003ch3\u003eTargets\u003c/h3\u003e\n\u003cp\u003eThere are two EM conductors that traverse across the Minnow Lake claims.\u0026nbsp; The southern conductor is associated with a magnetic low and lies very close to the batholith contact.\u0026nbsp; The mag low could represent a zone of weakness along this section of the batholith, and consequently, be an area favourable to mineralization along a fault structure.\u0026nbsp; The northern conductor is associated with a magnetic high.\u0026nbsp; Iron formation adjacent to a felsic fragmental unit containing carbonate alteration have been noted in this area along a prominent shear zone.\u0026nbsp; Both conductors represent high priority targets.\u003c/p\u003e","visible":true,"locationRefId":"c5348daf-ee53-44ae-bfc6-2b3584d33ce5","created":{"$date":"2014-05-04T00:00:00.000Z"},"__v":0}
{"_id":"17c99f85-56da-4c85-9c53-bf55902ee3af","name":"Hays Lake","safeName":"hays-lake","description":"The Hays Lake property is host to eight gold showings ranging from 2.0 g/t to 5.5 g/t and lies just 500 meters from the Derraugh-Jeddar main vein where small-scale mining has taken place.","body":"\u003ch3\u003eLocation and Access\u003c/h3\u003e\n\u003cp\u003eThe Hays Lake property consists of 5 claims (74 units) in Priske Township in the Thunder Bay Mining Division.\u0026nbsp; The property is just a short 5 km drive east from the town of Schreiber along the Hays Lake road off the Trans-Canada highway.\u0026nbsp;\u003c/p\u003e\n\u003ch3\u003eGeology\u003c/h3\u003e\n\u003cp\u003eThe property is underlain primarily by mafic volcanics immediately north of the Terrace Bay syenite batholith.\u0026nbsp; The volcanics have been intruded by diorite, iron formation and quartz-feldspar porphyry dikes.\u0026nbsp; The eastern-most part of the property straddles the Aguasabon River and is till-covered.\u003c/p\u003e\n\u003ch3\u003eLocal Mineralization and Showings\u003c/h3\u003e\n\u003cp\u003eA number of gold-bearing veins in the immediate area of the property have been found associated with the contact of quartz-feldspar porphyries and iron formations.\u0026nbsp; Some of the more notable occurrences that lie in close proximity to the Hays Lake property are as follows:\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"http://www.geologyontario.mndmf.gov.on.ca/gosportal/gos?command=mndmsearchdetails:mdi\u0026amp;uuid=MDI42D14SE00039\"\u003eDerraugh-Jeddar (Acker) Occurrence\u003c/a\u003e \u0026ndash; consists of a quartz vein hosted by pyritic, basaltic flows which are intruded by a pink, fine grained to aphanitic quartz feldspar dike. The vein strikes 60 degrees and dips 85 degrees north. The average width of the vein is about 50 cm and it has been exposed over a length of approximately 150 m. The vein occupies a shear zone and consists of white, glassy quartz which in places is highly brecciated and carries pyrite, chalcopyrite, galena, gold and silver.\u0026nbsp; Jedder Gold Mines (1937) surface sampling reportedly indicated a 152.4 m section averaging 0.23 oz/ton Au over an average width of 0.46 m.\u0026nbsp; In 1972, Walter Acker constructed a small-scale gold mill on site and bulk sampled (500 lbs/hr).\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"http://www.geologyontario.mndmf.gov.on.ca/gosportal/gos?command=mndmsearchdetails:mdi\u0026amp;uuid=MDI42D14SE00072\"\u003eJoa-Walton Occurrence\u003c/a\u003e - consists of three separate veins with a combined strike length of 120 metres.\u0026nbsp; Grab samples of altered volcanics and quartz porphyry have returned 0.14 oz/ton Au and 0.20 oz/t Au respectively.\u0026nbsp; Grab samples from the veins commonly assay in excess of 1.0 oz/t Au, and have assayed as high as 6.80 oz/t Au.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"http://www.geologyontario.mndmf.gov.on.ca/gosportal/gos?command=mndmsearchdetails:mdi\u0026amp;uuid=MDI42D14SE00040\"\u003eSingleton-Gray Occurrence\u003c/a\u003e - may represent an extension of the same vein system as the Joa-Walton Occurrence.\u0026nbsp; Samples from the southern zone have yielded values up to 0.558 oz/t Au and 1.00 oz/t Ag with samples from the northern zone assaying up to 1.323 oz/t Au.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"http://www.geologyontario.mndmf.gov.on.ca/gosportal/gos?command=mndmsearchdetails:mdi\u0026amp;uuid=MDI42D14SE00041\"\u003eOtisse Mine\u003c/a\u003e - was first explored in 1896 when five veins were discovered.\u0026nbsp; The main showing consists of a 9 meter wide band of iron formation striking 35\u0026deg; with a vertical dip.\u0026nbsp; The iron formation is well mineralized with disseminated pyrite, chalcopyrite and pyrrhotite, as well as some graphite and galena. Two shafts were sunk of the main vein where visible gold was noted with considerable pyrite in blue grey quartz.\u0026nbsp; Good grade values across 2.4 meter and 3.05 meter widths were reported from the iron formation by past owners. The main vein was sampled by J.E. Crookston (1938) and returned values of 2.44 oz/ton Au over 30 cm and 2.16 oz/ton Au over 46 cm.\u003c/p\u003e\n\u003ch3\u003eProperty Mineralization and Potential\u003c/h3\u003e\n\u003cp\u003eIn 2002, George Daniels (local prospector) spent four days prospecting within the current property.\u0026nbsp; He located eight gold showings ranging from 2.0 g/t to 5.5 g/t in his limited reconnaissance.\u0026nbsp; The Hays Lake property is just 500 meters from the Derraugh-Jeddar main vein where small-scale mining has taken place.\u0026nbsp; Further, there are two iron formations noted within the property boundary.\u0026nbsp; One of these iron formations is mapped as lying adjacent to a felsic fragmental unit.\u0026nbsp; These iron formations are well-documented to contain high-grade gold in this area.\u0026nbsp; In light of this, there exists excellent potential for a significant discovery within the Hays Lake property.\u003c/p\u003e","visible":true,"locationRefId":"c5348daf-ee53-44ae-bfc6-2b3584d33ce5","created":{"$date":"2012-03-25T00:00:00.000Z"},"__v":0}
{"_id":"3e21d10d-50cc-4831-84f1-f9da025ab0aa","name":"Cobble Lake","safeName":"cobble-lake","description":"The 20-unit Cobble Lake property surrounds a single patent that contains a Co-Ta showing which has assayed up to 1.85 percent Cb2O5 and 0.17 percent Ta2O2.  The pegmatite body that hosts the showing strikes across the property for a distance of 2.5 km. ","body":"\u003ch3\u003eLocation and Access\u003c/h3\u003e\n\u003cp\u003eThe property is located 70 km east of the city of Kenora and 70 km west of the town of Dryden in northwestern Ontario. The Cobble Lake property consists of two claims containing 20 units in Bridges Township.\u0026nbsp; Access to the property is via a logging road north from the Trans Canada Highway. The Trans Canada Pipeline, the Canadian National Railway and the Canadian Pacific Railway all lie parallel to the Trans Canada Highway.\u003c/p\u003e\n\u003ch3\u003eGeology\u003c/h3\u003e\n\u003cp\u003eThe rocks of the Kenora area are Archean in age and are found within the Wabigoon Subprovince of the Superior Province. The area is bordered to the north by the Winnipeg River Subprovince, and to the south by the Dryberry Batholith. It consists of the Vermillion Bay greenstone belt along with numerous granitoid intrusions.\u0026nbsp; The geology of the Kenora area consists of volcanic and sedimentary rocks intercalated with each other and then intruded by felsic intrusions. Volcanic rocks, consisting of flows and pyroclastics, form an east?trending belt through the Kenora property, ranging in widths of 0.8 km to 2.8 km. The sedimentary portion to the south of the volcanic belt is also east?trending and consists of sandstones, siltstones and argillites. The sedimentary rocks are intruded by gabbro sills and pegmatite dykes. Rocks are regionally metamorphosed to lower amphibolite to upper greenschist facies.\u003c/p\u003e\n\u003cp\u003eThe peninsula that extends northeastward from the south shore of Cobble Lake is underlain by peridotite and pyroxenite intruded by pink, coarse-grained pegmatite dikes.\u0026nbsp; The muscovite-bearing pegmatite trends easterly through the centre of the claim, dips sub-vertically, and has a maximum width of 150 feet (46 m). Microcline, perthitic microcline, and quartz are the major mineral constituents, and biotite, muscovite and tourmaline occur in lesser amounts.\u003c/p\u003e\n\u003ch3\u003ePrevious Work\u003c/h3\u003e\n\u003cp\u003eIn the early 1950's, H. A. Harrison of Eagle River staked one patented claim (K16777) on the peninsula and explored the property for its mica potential. \u0026nbsp;An adit was driven from the south side of the peninsula in a northward direction for a distance of 18 feet (5.5 m) (circa 1952).\u003c/p\u003e\n\u003cp\u003eDuring 1953 and 1954, six diamond drill holes, totaling 206 feet (62.8 meters), were put down on the property. Some mica was shipped to General Electric in Toronto but the quantity or value of the shipment is not known.\u003c/p\u003e\n\u003cp\u003eIn 1955 Harrison and D. F. Parrott of Red Lake re-examined the property for tantalum and columbium.\u0026nbsp;\u003c/p\u003e\n\u003ch3\u003eMineralization\u003c/h3\u003e\n\u003cp\u003eMinor blue-green garnet and rare tantalite-columbite have been identified by Parrott.\u0026nbsp; Black tourmaline locally forms up to 10% of the pegmatite mass and can be readily observed in the dike, between 100 and 300 feet (30-90 meters) west of the adit. Individual crystals range up to 10 inches (25 cm) in length and 2.5 inches (5.3 cm) in diameter. \u0026nbsp;Biotite books, up to 5 inches (13 cm) in diameter, and 2 inches (5 cm) thick, form about 5% of the pegmatite mass.\u0026nbsp; Muscovite is segregated in small lenses in the pegmatite.\u0026nbsp; The largest muscovite zone occurs near the entrance of the adit, strikes easterly, and dips vertically.\u0026nbsp; This (muscovite) zone has a maximum thickness of 2 feet (0.6 meters) and can be traced on the surface for a distance of 30 feet (9 meters). The east end of the zone is under water.\u003c/p\u003e\n\u003cp\u003eA 50-foot (15 meter) horizontal diamond-drill hole, located about 200 feet (60 meters) west of the adit, intersected a muscovite-bearing zone about 20 feet (6 meters) wide. The muscovite has a light greenish brown colour and forms books up to 18 inches (46 cm) in diameter, and up to 5 inches (13 cm) thick. Most of the larger books contain structural imperfections known as 'A' reeves and wedge structure.\u003c/p\u003e\n\u003cp\u003eIn 1955, Parrott collected a sample of pegmatite near the entrance to the adit. The sample contained 1.85 percent Cb\u003csub\u003e2\u003c/sub\u003eO\u003csub\u003e5\u003c/sub\u003e and 0.17 percent Ta\u003csub\u003e2\u003c/sub\u003eO\u003csub\u003e2\u003c/sub\u003e (Assessment Files, Regional Geologist's Office, Kenora). Duplicate check samples sent to the Department of Mines Laboratory and Warnock Hersey, assayed 0.42 percent and 0.10 percent Cb\u003csub\u003e2\u003c/sub\u003eO\u003csub\u003e5\u003c/sub\u003e and 0.01 percent and 0.04 percent Cb, respectively (assessment files).\u003c/p\u003e\n\u003ch3\u003eSummary\u003c/h3\u003e\n\u003cp\u003eA large muscovite-bearing pegmatite trends through the centre of the property.\u0026nbsp; Blue-green garnet, tourmaline and tantalite-columbite have been identified in the pegmatite.\u0026nbsp; Sampling of a 0.6 meter muscovite-rich section of the pegmatite near the adit has assayed up to 1.85 percent Cb\u003csub\u003e2\u003c/sub\u003eO\u003csub\u003e5\u003c/sub\u003e and 0.17 percent Ta\u003csub\u003e2\u003c/sub\u003eO\u003csub\u003e2.\u003c/sub\u003e\u0026nbsp; Drilling 60 meters west of the adit has intersected the muscovite-bearing zone over a thickness of 6 meters.\u0026nbsp; Drill logs have not been located, but it is presumed that the core would have been only assayed for its mica content.\u0026nbsp; The pegmatite body strikes for a distance of 2.5 km across the property.\u0026nbsp; In lieu of the documented tantalum mineralization, and the vintage of limited exploration, the Cobble Lake property would appear to have high potential for an economic tantalum discovery.\u003c/p\u003e","visible":true,"locationRefId":"b8e6b3d9-585d-4240-99bc-e054c01b9002","created":{"$date":"2013-04-07T00:00:00.000Z"},"__v":0}
{"_id":"809da3c2-f026-4238-91c5-c4df80b6c5fc","name":"Mavis Lake","safeName":"mavis-lake","description":"The 17-unit Mavis Lake property lies within the extension (boundary zone) of the Cat Lake - Winnipeg River Pegmatite Field, one of most important domains of rare metal (tantalum) mineralization in the Canadian Shield and host to the world-class Tanco tantalum mine.  Significant rare element mineralizing systems with appreciable values of tantalum, cesium, beryllium, rubidium and tin have been previously identified by the Ontario Geological Survey on the property.","body":"\u003ch3\u003eLocation and Access\u003c/h3\u003e\n\u003cp\u003eThe Mavis Lake Tantalum Property is located in the Kenora Mining Division about 10 km northeast of the town of Dryden, Ontario in Brownridge Township.\u0026nbsp; The claim group can be reached by taking the Thunder Lake Road north from Highway 17 about 7 km east of Dryden. The Ghost Lake Road, a gravel road, branches to the north off of the Thunder Lake Road. The Ghost Lake Road can be followed for about a kilometer to a four way intersection which lies just inside the southern boundary of the claim group.\u0026nbsp; The Mine Road which branches to the right off of the four way intersection provides access to the southeastern portions of the claim group before continuing on to the adjoining patented mining claims of Mr. Fairservice.\u0026nbsp; The northern road from the four way intersection is the Ghost Lake Road which provides access to the northeastern extremities of the property. The West Ghost Lake Road departs the intersection to the west and provides ready access to the central portions of the property. An ATV road in the southwestern portion of the claim group connects to the West Ghost Lake Road several hundred metres to the west of the intersection. Large tracts of timber have been harvested in the central portions of the property. A number of rough logging roads branch off of the West Ghost Lake Road and are suitable for ATV travel.\u003c/p\u003e\n\u003ch3\u003eGeology\u003c/h3\u003e\n\u003cp\u003eThe property lies in the Sioux Lookout Domain which is characterized by an alternating series of southward facing metavolcanic and metasedimentary rocks. The property is dominantly composed of pillowed and massive mafic metavolcanics of the Brownridge Volcanics. Brownridge metasediments may underlie the southern extremity of the property but did not outcrop. The Brownridge assemblage is intruded by granites related to the fertile peraluminous Ghost Lake batholith. A pegmatite field related to the Ghost Lake batholith traverses the claim group and ranges from beryl-type (True North Gems) to the west of the property to albite-type (Fairservice) lying to the east of the property.\u003c/p\u003e\n\u003ch3\u003ePrevious Work\u003c/h3\u003e\n\u003cp\u003eThe geology of the region was mapped by the Ontario Department of Mines: W. Moorhouse in the Eagle Lake area in 1941 and by J. Satterly in the Wabigoon area in 1943. Further government work was carried out by F. Breaks et al (1976, 1978, 1980, and 1984) and more recently by G. Beakhouse in 2001 and 2002. More recent focused studies of the rare metal potential of the region was carried out by Breaks et al in 2001 and 2003. Airborne magnetic and electromagnetic surveys were conducted in the Dryden area (1997) and in the Stormy Lake areas (2001).\u003c/p\u003e\n\u003cp\u003eMineral exploration in the region has principally focused on rare metals and tungsten.\u0026nbsp; From 1955 to 1964, lithium was the main target while in the 1960's tungsten and tantalum were featured. More recent exploration has focused on emeralds and tantalum mineralization.\u0026nbsp; Lun-Echo Gold Mines Limited carried out trenching and a 40 hole, 1968m. diamond drilling program following the discovery of spodumene pegmatites near Mavis Lake in 1956. The drilling defined lithium mineralization over a strike length of 670m. This exploration took place on the patented claims (Fairservice Property) which adjoin the Mavis Lake Property to the east.\u003c/p\u003e\n\u003cp\u003eIn 1964 a spodumene-pollucite-bearing complex pegmatite was discovered near Tot Lake which lies about 20km.to the northeast of Ghost Lake Property. J. Donner investigated the mineralization by geological mapping and magnetic surveys followed by a 4 hole, 223m. diamond drilling program in 1973.\u003c/p\u003e\n\u003cp\u003eA. Petrunka discovered tungsten mineralization near Sharpe Lake in the late 1960's and initial evaluation was undertaken by Noranda Mines Limited. In 1982 Sanmine Exploration Inc. carried out extensive trenching and diamond drilling programs on the Petrunka claims. A series of pits and trenches within the southern portions of the Mavis Lake Property may mark the westernmost extension of these investigations.\u003c/p\u003e\n\u003cp\u003eSelco Mining Corporation Limited carried out geological mapping, lithium geochemical surveys and diamond drilling over the Mavis Lake (Fairservice) spodumene pegmatites in 1979.\u0026nbsp; Tantalum Mining Corporation of Canada Limited undertook a limited diamond drilling program on the Tot Lake pegmatites.\u0026nbsp; Tantalum Mining Corporation of Canada Limited optioned the Fairservice Property in 1982 and conducted a magnetic survey before dropping their option.\u003c/p\u003e\n\u003cp\u003eIn 2003 Emerald Fields Resource Corporation carried out prospecting, trenching, geological mapping and a 4 hole diamond drilling program on the Fairservice claims.\u0026nbsp; In 2003 True North Gems Inc. carried out prospecting, stripping and sampling programs in 2003 over the Taylor Beryl (Emerald) Occurrence on a property attached to the western edge of the Mavis Lake Property.\u003c/p\u003e\n\u003cp\u003eBetween 2001 and 2003, Houston Lake Mining performed line cutting, mag/vlf and geological mapping and sampling on our current holdings.\u0026nbsp; Their mapping identified numerous tourmaline-bearing pegmatites throughout the volcanic pile. The pegmatites located by Houston Lake occurred as small pods or lenses (several cm in width) which crosscut the foliation as well large bodies tens of metres across concordant to the foliation.\u003c/p\u003e\n\u003ch3\u003eMineralization\u003c/h3\u003e\n\u003cp\u003eSignificant rare element mineralizing systems with appreciable values of tantalum, cesium, beryllium, rubidium and tin have been previously identified by the Ontario Geological Survey (\"OGS\") on the property. Reported values of the OGS include \u003cstrong\u003e186 g/t (0.019%) tantalum oxide\u003c/strong\u003e and 115 g/t (0.012%) tin (E. Berger, 1990) and \u003cstrong\u003e179 g/t (0.018%) tantalum oxide\u003c/strong\u003e (F. Breaks, 1991).\u0026nbsp; The high concentration and potential of the Mavis Lake property is emphasized by an elevated tantalum to niobium ratio of approximately 3:1. Pronounced and broad lithium (holmquistite) and boron (tourmaline) anomalies are traceable for over 650 metres on the property and elsewhere have proven to be important pathfinders to rare metal (tantalum) mineralization. Breaks confirms that some gem quality emeralds occur within the Boundary Zone.\u003c/p\u003e\n\u003cp\u003eThe Mavis Lake property also encompasses the Petrunka (Sanmine) Tungsten Occurrence. The tungsten mineralization coincides with a mafic volcanic sequence. Tungsten is used to strengthen metal alloys and is trading at USD $40/kg\u003c/p\u003e\n\u003ch3\u003eSummar\u003c/h3\u003e\n\u003cp\u003eThe property lies within the extension (boundary zone) of the Cat Lake - Winnipeg River Pegmatite Field, one of most important domains of rare metal (tantalum) mineralization in the Canadian Shield and host to the world-class Tanco tantalum mine.\u0026nbsp; Significant rare element mineralizing systems with appreciable values of tantalum, cesium, beryllium, rubidium and tin have been previously identified by the Ontario Geological Survey (\"OGS\") on the property.\u0026nbsp; In addition, the property has significant potential for tungsten and gem quality emeralds.\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eHouston Lake produced values up to 105ppm Li, 48.8ppm Cs. and 1170ppm Rb from limited sampling.\u0026nbsp; These values are indicative of rare metal enrichment.\u0026nbsp; They noted that \" Key zones at Locality A and B remain as yet un-sampled and are worthy of follow up.\" (Grayme Anthony, Timberwolf Explorations, 2004\u003c/p\u003e\n\u003cp\u003eThe property covers 2 km of the important Brownridge sediment/volcanic contact trend. This contact appears to be a key control on rare metal mineralization in the region.\u0026nbsp; Both the highly evolved Spodumene-Beryl-Tantalite Zone (Fairservice Property) located just to the east of the Mavis Lake Property and the less evolved Beryl-Columbite Zone (Taylor Emerald Occurrence, Petrunka Tungsten Occurrence) to the west of the property occur along this important contact\u003c/p\u003e\n\u003cp\u003eGeological mapping has successfully identified a second rare metals zone that extends the Holmquistite Zone of Breaks and Janes (1991) for over 1.6 km across the Mavis Lake Property. Tourmaline mineralization is ubiquitous along this zone and is indicative of rare metal mineralization. Tourmaline contains boron, an important complexing agent for the transport and deposition of rare metals. Holmquistite is also a positive indicator of lithium and rare metal mineralization. Two localities, A and B, have been previously identified by Houston Lake for follow up sampling based on geological mapping rather than sampling results.\u0026nbsp; Locality B, in particular, contains a large potassic pegmatite\u003c/p\u003e\n\u003ch3\u003eRecommendation\u003c/h3\u003e\n\u003cp\u003eStripping of localities A and B are recommended as well as Enzyme leach soil geochemistry for areas of little outcrop along both rare metal trends, with special attention on the Brownridge sediment/volcanic contact.\u003c/p\u003e","visible":true,"locationRefId":"b8e6b3d9-585d-4240-99bc-e054c01b9002","created":{"$date":"2013-04-05T00:00:00.000Z"},"__v":0}
{"_id":"0afe6732-2117-42a9-b5b0-d60128ef0403","name":"Medicine Lake","safeName":"medicine-lake","description":"The 15-unit Medicine Lake property covers a large (460 meter wide x 600 meter long) pegmatite intrusion.  Beryl mineralization over a width of 12 meters across a strike length of 127 metres has assayed up to 13.6% beryllium oxide. Crystals of tantalite have been found in three pits along a 100 meter strike length.","body":"\u003ch3\u003eLocation and Access\u003c/h3\u003e\n\u003cp\u003eThe property is located 65 km east of the city of Kenora and 80 km west of the town of Dryden in northwestern Ontario. The Medicine Lake property consists of a single claim containing 15 units in Tustin Township.\u0026nbsp; Access to the property is via the Gordon Lake road 4 km north of the Trans Canada Highway. The Trans Canada Pipeline, the Canadian National Railway and the Canadian Pacific Railway all lie parallel to the Trans Canada Highway.\u003c/p\u003e\n\u003ch3\u003eGeology\u003c/h3\u003e\n\u003cp\u003eThe rocks of the Kenora area are Archean in age and are found within the Wabigoon Subprovince of the Superior Province. The area is bordered to the north by the Winnipeg River Subprovince, and to the south by the Dryberry Batholith. It consists of the Vermillion Bay greenstone belt along with numerous granitoid intrusions.\u0026nbsp; The geology of the Kenora area consists of volcanic and sedimentary rocks intercalated with each other and then intruded by felsic intrusions. Volcanic rocks, consisting of flows and pyroclastics, form an east?trending belt through the Kenora property, ranging in widths of 0.8 km to 2.8 km. The sedimentary portion to the south of the volcanic belt is also east?trending and consists of sandstones, siltstones and argillites. The sedimentary rocks are intruded by gabbro sills and pegmatite dykes. Rocks are regionally metamorphosed to lower amphibolite to upper greenschist facies.\u003c/p\u003e\n\u003ch3\u003ePrevious Work\u003c/h3\u003e\n\u003cp\u003eUranium was first discovered in the Kenora area in 1949 near the shore of Willard Lake. This was followed by the discovery of the high?grade Richard Lake deposit by Campbell and McFarland in the early 1950\u0026rsquo;s.\u0026nbsp; The Richard Lake deposit has been estimated at 590,000 tonnes of 0.10% U3O8 (Palmer, 2007).\u003c/p\u003e\n\u003cp\u003eIn 1949, beryl in pegmatite was discovered at the east end of Medicine Lake. The occurrence was initially found and staked by E. Sobiski. \u0026nbsp;Trenching and stripping were carried out in 1949 to determine the extent of beryl mineralization. Part of the pegmatite exposed by this work is presently covered by the Gordon Lake Development Road.\u003c/p\u003e\n\u003cp\u003eIn 1958, Conquest Exploration Limited blasted five trenches and drilled two diamond-drill holes, totaling 509 feet (155 meters), on a zone of sulphide mineralization located about 1,400 feet (430 m) northeast of the east end of Medicine Lake.\u003c/p\u003e\n\u003cp\u003eBetween 1966 and 1970, Falconbridge Nickel Mines performed geological mapping, ground geophysics, and diamond drilling in the area to investigate the ultramafic intrusions for copper and nickel mineralization. \u0026nbsp;Two inclined diamond-drill holes, totaling 1,234 feet (376 meters) were drilled from the surface of Medicine Lake during the winter of 1970.\u0026nbsp; Drill logs and assays have not been located.\u003c/p\u003e\n\u003cp\u003eDuring 2008 Delta Uranium Canada completed a sampling program totaling 2,590 samples on its large 'Kenora Project' using a scintillometer (RS?125 Super Spec).\u0026nbsp; They sampled the Medicine Lake Beryl Occurrence and got up to 632 counts per second U\u003csub\u003e3\u003c/sub\u003eO\u003csub\u003e8\u003c/sub\u003e.\u003c/p\u003e\n\u003ch3\u003eBeryl-Tantalum Mineralization\u003c/h3\u003e\n\u003cp\u003eThe pegmatite intrusion on the property underlies the area between Medicine Lake and Lift Lake.\u0026nbsp; It has an approximate width of 1,500 feet (460 m) and a length of 2,000 feet (600 m), and is oriented in a northeasterly direction. The pegmatite is white to grey in colour, with local areas that are pink. It is medium to very coarse grained, and is composed of feldspar and quartz with minor amounts of biotite and muscovite, and rare black tourmaline, red garnet, yellow to clear beryl and black tantalite.\u0026nbsp; The accessory minerals generally have well-developed crystal shapes. Beryl crystals at the main showing occur over an area 120 feet (37 meters) long and 40 feet (12 meters) wide. E. Sobiski reported that he also found small crystals of beryl about 300 feet (90 meters) southeast of the main showing.\u003c/p\u003e\n\u003cp\u003eIn 1950, E. O. Chisholm examined and described the \u003ca href=\"http://www.geologyontario.mndmf.gov.on.ca/gosportal/gos?command=mndmsearchdetails:mdi\u0026amp;uuid=MDI52F13SW00043\"\u003eMedicine Lake Beryl Tantalum Occurrence\u003c/a\u003e as follows:\u0026nbsp; \"Beryl crystals up to 2 inches [5 cm] in diameter and several inches [cm] long occur in a coarse grained pegmatite to the west of the cabin . . . A total of 20 (beryl crystals) were observed in an area 25 feet long [7.6 meters] and 5 feet [1.5 meter] wide. The average diameter of the crystals was from half an inch to an inch [1.3 cm-2.5 cm].\u0026nbsp; The beryl crystals appeared to be confined to a coarser phase of the pegmatite in this locality.\u0026nbsp; Large crystals of white and grey perthitic feldspar up to a foot [0.3 meter] across accompany the beryl mineralization. Thin sheets of biotite mica several inches in length often occur along the crystal faces of the feldspar. Small patches and crystals of black tourmaline up to an inch [2.5 cm] in diameter were noticed.\u0026nbsp; A piece of one of the larger beryl crystals was sent to Beryllium Corporation for assay by the claim owner. It was reported to contain 13.6 percent beryllium oxide. A sample of the massive grey perthite was reported to contain 1 percent beryllium oxide (Statistical Files, ODM).\"\u003c/p\u003e\n\u003cp\u003eCrystals of tantalite were found by Chisholm in a pit located 75 feet (22.8 meters) northeast of the cabin (main beryl showing). The Gordon Lake development road lies immediately north of this pit. Chisholm also reported the presence of tantalite crystals in a 25-foot (7.6 meter) long trench located about 100 feet (30 m) north of the above-mentioned pit.\u0026nbsp; Scattered crystals of tantalite, up to one inch (2.5 cm) in diameter, were observed by Chisholm in an outcrop of white, medium-grained pegmatite along the north side of the Gordon Lake development road, about 225 feet (70 meters) northwest of the above-mentioned pit.\u003c/p\u003e\n\u003ch3\u003eNickel Mineralization\u003c/h3\u003e\n\u003cp\u003eThe sulphide zone located by Conquest Exploration, strikes easterly, dips vertically, and has been traced for a length of 600 feet (180 meters). At the west end of the mineralized zone, massive and disseminated pyrrhotite and minor pyrite, in metasediments, are exposed over a width of 30 feet (9 meters). A grab sample of massive sulphides collected by the OGS was found to contain 0.07 percent nickel. Mineralization at the east end of the zone consists of disseminated pyrrhotite in mafic schists. The mineralized zone has a maximum thickness of 40 feet (12 meters) and is in sharp contact with garnetiferous metasediments.\u0026nbsp; Some pyrite is present in the metasediments. Pyrrhotite forms 2-5% of the mafic schists and a grab sample collected by Chisholm from trench 1, was found to contain about 0.02 percent nickel.\u003c/p\u003e\n\u003ch3\u003eSummary\u003c/h3\u003e\n\u003cp\u003eThe pegmatite intrusion on the property is quite large (460 meters wide by 600 meters long) and has been shown to contain black tourmaline, red garnet, yellow to clear beryl and black tantalite.\u0026nbsp; Sampling has shown beryl mineralization over a width of 12 meters across a strike length of 127 metres.\u0026nbsp; Beryl crystals sent out for assay have been shown to contain up to 13.6% beryllium oxide.\u0026nbsp; Crystals of tantalite were found by Chisholm in three pits along a 100 meter strike length, although no assays were provided.\u0026nbsp; In lieu of the documented tantalum mineralization, and the vintage of limited exploration, the Medicine Lake property would appear to have high potential for an economic tantalum discovery.\u003c/p\u003e","visible":true,"locationRefId":"b8e6b3d9-585d-4240-99bc-e054c01b9002","created":{"$date":"2013-04-07T00:00:00.000Z"},"__v":0}
{"_id":"23192cd2-42e9-42c6-a4ce-f6db82f2c23d","name":"Victoria Lake","safeName":"victoria-lake","description":"Four strong hydrothermal alteration cells have been identified on the Victoria Lake property which represent a long lived hydrothermal system.  Further, a nickel-copper-PGE deposit lies immediately adjacent to the property and dips onto our claims.  Grab samples taken from the deposit have assayed as high as 5.7% Nickel, 1.3% copper, 0.09% cobalt, 0.44 g/t palladium and 0.11 g/t platinum.","body":"\u003ch3 class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003eAccess\u003c/h3\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003eThe property is located on the western end of the Schreiber Volcanic belt, part of the Abitibi Wawa Greenstone belt of the Superior Structural Province. The Victoria Lake property is located approximately 6 km north of the town of Schreiber. Access is gained off the Winston Lake mine road just south of Sammy's Lake. An old drill road provides access to the property.\u0026nbsp; The old drill road is driveable by 4x4 for the first 2 km and then by all-terrain vehicle for the remainder.\u003c/p\u003e\n\u003ch2\u003eVMS Potential\u003c/h2\u003e\n\u003ch3 class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003ePrevious Exploration\u003c/h3\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003eCirca 1930: Trenching was conducted on the iron formations and gossans in the area.\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e1983: Noranda Exploration conducts reconnaissance investigations. Geological mapping and geophysical surveys including mag, Max Min Horizontal Loop and PEM surveys were conducted. Areas of hydrothermal alteration are recognized.\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e1984: Noranda Exploration drilled 4 holes totalling 699 m, as well as conducting downhole pulse surveys. 1985: Noranda Exploration conducts 878 m of diamond drilling on the property as well as downhole PEM survey.\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e1987: Geological mapping and 1558 m of diamond drilling are conducted. Downhole pulse survey is conducted. Minor base metal values (\u0026lt;1100 ppm Zn) are intersected.\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e1990: Minnova Inc. options the property from Noranda Exploration and Cumberland resources Ltd. who are in joint venture. Detailed geological mapping is conducted and several favourable alteration zones and synvolcanic structures are defined.\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e1991-1992:Minnova Inc. conducts diamond drilling and downhole geophysical surveys.\u003c/p\u003e\n\u003ch3 class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003eGeology\u003c/h3\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003eThe general geology of the Victoria Lake VMS claims are described by Glenn (1991) as follows: Generalized geology of the southern limb of the belt is summarised by a thick sequence of metavolcanic and metasedimentary units possibly synclinal folded about an east plunging east west axis. The metavolcanics dominate forming three mafic to felsic cycles. A typical cycle is characterised by a thick sequence of pillowed to massive basalts grading upward into andesite and finally massive felsic flows. Metasedimentary units consist of greywacke, chert carbonate, argillite, arkose, and graphitic shale with interlayered pyrite and pyrrhotite. Well preserved primary sedimentary textures indicate that the volcanic sedimentary sequence was deposited subaqueously. All units have been metamorphosed to amphibolite grade of regional metamorphism. The metamorphic grade increases to upper amphibolite to the north.\u003c/p\u003e\n\u003ch3 class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003eMineralization and Alteration\u003c/h3\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003eSeveral gossans and disseminated interpillow sulphides occur within the Corvette Lake mafic flows. Base metal values up to 4200 ppm Zn were encountered (Glenn, 1991).Low to anomalous base metal values (\u0026lt;1100 ppm Zn and 210 ppm Cu) were intersected in oxide facies iron formation in the Victoria Lake Horizon (VL 7). An iron formation 300 m north of Victoria Lake assayed 7615 ppm Zn and 658 ppm Cu (Glenn 1991). A grab sample of felsic tuff (92 BVL-01) collected from the Anglo Lake gossan assayed 1740 ppm Zn, 397 ppm Cu and 0.002 oz/ton Au.\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003eFour strong hydrothermal alteration cells or zones have been identified on the Victoria Lake property. The most intense alteration occurs between the Titanium fault and Hill fault. Andalusite is developed and believed to represent a long lived hydrothermal system (Glenn, 1991). Cordierite porphyroblasts also occur in a siliceous biotitic matrix.\u003c/p\u003e\n\u003ch2\u003eNi-Cu-PGE Potential\u003c/h2\u003e\n\u003ch3 class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003ePrevious Exploration\u003c/h3\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e1930-36: Surface sampling and diamond drilling of 3 holes were probably undertaken by Cominco.\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e1937: Cook Lake Gold Mines Ltd. performed a ground mag survey.\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e1950: Falconbridge Nickel Mines held the property under option from D. Campbell of Schreiber. They conducted a ground mag survey and geological mapping. A detailed investigation of the mineralization was carried out and formed the basis of a bachelor's thesis by D.T. Anderson (1951).\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e1956: Property optioned to New Athona Mines Ltd. and Mogul Mining Corp., who drilled 4 holes totalling 516 m.\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e1965: Property came open and was restaked by Zenmac Metal Mines Ltd., who mapped the property and drilled 5 holes totalling 61 m along a strike length of 48.8 m on the main mineralized zone.\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e1969: Zenmac carried out a detailed ground mag survey, locating 4 anomalous zones. 8 holes totalling 642 m were drilled. \u0026nbsp;Zenmac Metal Mines Ltd. describes the deposit and their drill program results:\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e\u0026ldquo;The deposit known before this (1969) program was estimated to contain 185,000 tons grading 0.49% nickel and 0.26% copper to the 300 foot horizon in a zone 300 feet long, 22 feet thick and dipping 40 degrees. Three holes have intersected the deposit at greater depth to at least 600 feet and indicate an additional 190,000 tons grading 0.40% nickel and 0.12% copper. The grade of the central core of the deposit was calculated to be about 1.0% nickel and 0.3% copper over 5 to 15 feet.\u0026rdquo;\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e1970: Nicohal Mines Ltd. drilled 9 holes totalling 1231.7 m, encountering Ni-Cu mineralization.\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e2004: NovaWest Resources completed 11 diamond drill holes (1,502 metres). Eight of the 11 diamond drill holes intersected disseminated to semi-massive (10-15 per cent) sulphide mineralization (pyrrhotite-pyrite-chalcopyrite). The sulphide mineralization occurs as blebs or clots associated to a magnetic pyroxenite unit that is believed to have intruded the granitic rocks. Company geologists believed the sulphide clots or blebs noted within the pyroxenite dike material are from settling or coalescing, which could create significant accumulation.\u003c/p\u003e\n\u003ch3 class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003eGeology\u003c/h3\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003eThe Nicopor Deposit lies immediately north of, and an adjacent to, the Victoria Lake claims.\u0026nbsp; The deposit is classed as a 'mafic-ultramafic intrusion-hosted ' deposit. The prospect occurs at the northern contact of the Schreiber greenstone belt with the Crosman Lake granitic batholith. The greenstone belt assemblage consists of an east trending, homoclinal succession of mafic to felsic metavolcanic rocks intruded by sill like gabbro bodies. In the vicinity of the Nicopor prospect the massive amphibolite host had been largely interpreted by various exploration geologists as a metamorphosed and altered mafic to intermediate volcanic rock. Recent mapping, based to a large extent on comparison with other mafic rocks nearby, suggests that this amphibolitic unit is gabbroic rather than volcanic. This interpretation also accounts to some degree for the source of the nickel and copper rich sulphide mineralization as discussed below. Base metal sulphides occur as massive to vein like and net textured aggregates in a narrow, linear zone that follows the contact between a dark green, massive amphibolite (melagabbro) on the south and medium grained, equigranular, pink granite on the north. A quartz bearing, mafic rock typically occurs between the melagabbro and the granite and has been mapped as leucogabbro, possibly representing a hybrid phase between the two main host rocks. This mineralized zone has developed a conspicuous, extensive gossan that obscures host rock and sulphide relationships. White iron hydroxides and rare malachite have developed as stains on deeply weathered sulphides. Several shallow pits have been sunk on this northeast striking zone over a distance of approximately 75 m. The sulphide zone on surface ranges up to approximately 2 m in width and rapidly grades outwards into disseminated mineralization in both the gabbro and granite. The sulphide zone is crosscut by barren aplite, syenite and feldspar porphyry dykes.\u003c/p\u003e\n\u003ch3 class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003eMineralization and Alteration\u003c/h3\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003eThe sulphide zone on surface consists mainly of semi massive, net like veinlets of pyrrhotite, with minor chalcopyrite and isolated porphyroblasts of pyrite. Pentlandite, the nickel bearing sulphide phase, is visible in cut and polished slabs and accounts for up to 15% of the sulphides in polished section. Sulphide veins and massive sulphides are apparently hosted mainly by the granite which has been brecciated by the introduced sulphides and occurs as xenoliths within them. Sulphides within the gabbro and in the granite away from the main mineralized zone tend to be fine grained, disseminated to blebby grains. Fine grained magnetite grains are disseminated throughout the gabbro and also occur as a minor component within massive sulphides. The occurrence of native copper is noteworthy in that is occurs as small, disseminated grains within granite, apparently as a hypogene, rather than a supergene mineral. Additional petrographic descriptions of the sulphides had previously been provided by Anderson (1951): Polished, thin section study reveals that the sulphides are pervasively annealed and occur usually as composite veinlets and blebs that are interstitial to silicate mineral grains in the host rocks. The granite displays an ubiquitous micrographic texture developed between quartz and alkali feldspar. In the micrographic granite, grain boundaries between sulphides and silicates are sharp and straight, whereas in the gabbro, intimately intergrown sulphides and acicular amphiboles suggest that they crystallized at the same time. Sulphides also occur along cleavage traces in these amphiboles. Pyrrhotite, the predominant sulphide, comprises aggregates that host granular veinlets and small, oriented flames and incipient veinlets of pentlandite along pyrrhotite grain boundaries. Chalcopyrite typically occurs as blebs and anhedral grains at the margins of the sulphide aggregates and locally crosscuts pentlandite.\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003eResident Geologist Staff visited the occurrence July 1, 1992. 7 grab samples returned copper values ranging from 80 to 10540 ppm Cu, 105 to 45250 ppm Ni, and \u0026lt;10 to 456 ppb Palladium. The best copper value came from an amphibole rich granite, with fine grained disseminated py, po, cp and rare native copper grains (Main trench). The best Nickel and Palladium value came from massive po, with minor cp blebs, subhedral pyrite porphyroblasts; relict patches of host granite (Main Trench dump).\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e\u003cspan lang=\"EN-GB\" style=\"mso-bidi-font-size: 12.0pt; line-height: 107%; mso-ascii-font-family: Calibri; mso-hansi-font-family: Calibri; mso-bidi-font-family: Calibri; mso-ansi-language: EN-GB;\"\u003eGrab samples taken from the property in 1997 by Brian Fowler, assayed as high as 5.7% Nickel, 1.3% copper, 0.09% cobalt, 0.44 g/t palladium and 0.11 g/t platinum. The results of Fowler's sampling is as follows:\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e\u003cspan style=\"mso-bidi-font-size: 12.0pt; line-height: 107%; mso-ascii-font-family: Calibri; mso-hansi-font-family: Calibri; mso-bidi-font-family: Calibri;\"\u003e97-09- 36 ppb Au, 158 ppb Pd, 60 ppb Pt, 0.78% Cu, 2.92% Ni\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e\u003cspan style=\"mso-bidi-font-size: 12.0pt; line-height: 107%; mso-ascii-font-family: Calibri; mso-hansi-font-family: Calibri; mso-bidi-font-family: Calibri;\"\u003e97-10 - 24 ppb Au, 442 ppb Pd, 30 ppb Pt, 0.09% Cu, 5.70% Ni\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e\u003cspan style=\"mso-bidi-font-size: 12.0pt; line-height: 107%; mso-ascii-font-family: Calibri; mso-hansi-font-family: Calibri; mso-bidi-font-family: Calibri;\"\u003e97-11 - 56 ppb Au, 194 ppb Pd, 50 ppb Pt, 1.26% Cu, 1.44% Ni\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e\u003cspan style=\"mso-bidi-font-size: 12.0pt; line-height: 107%; mso-ascii-font-family: Calibri; mso-hansi-font-family: Calibri; mso-bidi-font-family: Calibri;\"\u003e97-12 - 64 ppb Au, 124 ppb Pd, 110 ppb Pt, 1.01% Cu, 0.60% Ni\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e\u003cspan style=\"mso-bidi-font-size: 12.0pt; line-height: 107%; mso-ascii-font-family: Calibri; mso-hansi-font-family: Calibri; mso-bidi-font-family: Calibri;\"\u003e97-13 - 36 ppb Au, 186 ppb Pd, 40 ppb Pt, 0.66% Cu, 1.55% Ni\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e\u003cspan style=\"mso-bidi-font-size: 12.0pt; line-height: 107%; mso-ascii-font-family: Calibri; mso-hansi-font-family: Calibri; mso-bidi-font-family: Calibri;\"\u003e97-14 - 32 ppb Au, 242 ppb Pd, 50 ppb Pt, 0.11% Cu, 0.66% Ni\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e\u003cspan style=\"mso-bidi-font-size: 12.0pt; line-height: 107%; mso-ascii-font-family: Calibri; mso-hansi-font-family: Calibri; mso-bidi-font-family: Calibri;\"\u003e97-15 - 24 ppb Au, 236 ppb Pd, 70 ppb Pt, 0.09% Cu, 3.27% Ni\u003c/span\u003e\u003c/p\u003e\n\u003ch3 class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003eSummary\u003c/h3\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003eThe mineralized zone encompassing the Nicopor showing is open at depth and along strike.\u0026nbsp; The deepest drilling of the deposit by Nicohal Mines determined that the altered gabbro and mineralization increases in width at depth.\u0026nbsp; In fact their best drill holes are collared on our property and returned the following intercepts:\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003eHole 14 (L13E @6+50S)\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003eAltered Gabbro from 475-562.5 feet = 87.5 feet\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e16.5 feet 0.32% Ni and 0.33% Cu (546-562.5 feet)\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003eHole 15 (L12E @ 7+50S)\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003eAltered Gabbro from 470-622.5 feet = 152.5 feet\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e35.0 feet 0.44% Ni and 0.12% Cu (558-593 feet)\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003eHole 16 (L13E @ 7+50S)\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003eAltered Gabbro from 417-586 feet = 169 feet\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003eNo assays\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003eHole 17 (L12E @ 5+00S)\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003eAltered Gabbro from 302-486 feet = 184 feet\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e40 feet 0.33% Ni and 0.11% Cu (419.5-459.5 feet)\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003ePerhaps even more important is an outcrop known as the 'East Showing', located about 1.3 kilometers east of the main Nicopor showing, which reportedly hosts nickel and copper values as well.\u0026nbsp; This showing appears to lie within a much larger unit of gabbro which lies to the south of the Nicopor host gabbro (refer to Geology Map 47j).\u0026nbsp; Sporadic traverses in the area while staking located several gabbro outcrops.\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003eWith respect to the property\u0026rsquo;s VMS potential, there is proven wide-spread VMS-style alteration on the property.\u0026nbsp; Very limited drilling has taken place over this large area.\u0026nbsp; In fact the highest zinc values returned from bedrock trenching north of Victoria Lake has never been drilled.\u0026nbsp; Nor has a strong EM conductor immediately along strike to the east.\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003eThe Victoria Lake property holds great promise for a significant find of both zinc-copper mineralization as well as nickel-copper-PGE mineralization.\u003c/p\u003e","visible":true,"locationRefId":"c5348daf-ee53-44ae-bfc6-2b3584d33ce5","created":{"$date":"2014-12-31T21:09:00.000Z"},"__v":0}
{"_id":"b9fc2d05-2adc-42f8-ae52-430b1f5e21d8","name":"Little Bear Lake","safeName":"little-bear-lake","description":"Recent exploration has uncovered three separate bedrock sources of gold, with a fourth area containing high-grade gold and silver in soil. The first area located bonanza style grades of gold up to 53.7 g/t gold and 19.25 g/t silver. A second area 200 meters to the north assayed 3.8 g/t gold. A third area to the southeast returned 18.2 g/t gold and 1.03 g/t silver in soils.","body":"\u003ch3\u003e\u003cspan lang=\"EN-GB\"\u003eIntroduction\u003c/span\u003e\u003c/h3\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-GB\" style=\"font-size: 11pt; font-family: Calibri, sans-serif;\"\u003eThe Little Bear property consists of 48 claim units and \u003c/span\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11pt; font-family: Calibri, sans-serif;\"\u003elies 4 km north of the town of Schreiber, and 15 kilometers southeast of the past producing Winston Lake Zinc Mine. \u003c/span\u003e\u003cspan style=\"font-size: 11pt; font-family: Calibri, sans-serif;\"\u003eAccess is via gravel road from the town of Schreiber which turns into a \u003c/span\u003e\u003cspan lang=\"EN-GB\" style=\"font-size: 11pt; font-family: Calibri, sans-serif;\"\u003ewinter road (ATV trail) that goes\u003c/span\u003e \u003cspan style=\"font-size: 11pt; font-family: Calibri, sans-serif;\"\u003eto Big Duck Lake.\u0026nbsp; An old road branches off the Big Duck Lake trail just north of Cook Lake and heads east to Big Bear Lake and the property.\u003c/span\u003e\u003c/p\u003e\n\u003ch3\u003e\u003cspan lang=\"EN-GB\"\u003eRegional Geology\u003c/span\u003e\u003c/h3\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan style=\"font-size: 11pt; font-family: Calibri, sans-serif;\"\u003eThe property lies in the east-west trending Big Duck-Schreiber greenstone belt of the Archean Abitibi-Wawa Subprovince.\u0026nbsp; In the Schreiber area the belt is composed of generally east-west trending, north-facing, mafic metavolcanics with minor metasediments and mafic intrusive rocks.\u0026nbsp; \u003c/span\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11pt; font-family: Calibri, sans-serif;\"\u003eThe most important structural feature of the Big Duck-Schreiber Region is the east/west trending anticline which neatly divides the area between its north limb and its south limb. The core of the anticline is occupied by a large granitic body. The anticline is cut at a high angle by F-2 synclines and anticlines.\u0026nbsp; The rock types in the southern portion of the Big Duck-Schreiber area show a lower greenschist facies metamorphic grade.\u003c/span\u003e\u003c/p\u003e\n\u003ch3\u003e\u003cspan lang=\"EN-US\"\u003eProperty Geology\u003c/span\u003e\u003c/h3\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11pt; font-family: Calibri, sans-serif;\"\u003eThe property consists of basaltic flows that are separated by different types of sedimentary rock.\u0026nbsp; These sediments take the form of the typical banded oxide iron formation common in the Schreiber area. The strike of the iron formations are northwest to southeast and consist of alternating 1-2 cm wide bands of magnetite and chert. The widths vary from one to four meters. These formations can be traced across the entire width of the property.\u003c/span\u003e\u003c/p\u003e\n\u003ch3\u003eNearby Occurrences\u003c/h3\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cstrong\u003e\u003cspan style=\"font-size: 11pt; font-family: Calibri, sans-serif;\"\u003eTwomey Iron Formation\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan style=\"font-size: 11pt; font-family: Calibri, sans-serif;\"\u003eIn 1992 a Thunder Bay prospector, Tim Twomey, sampled a 4 meter wide iron formation (location #1 on map) which returned a high of 4.85 g/t gold.\u0026nbsp; The area is underlain by mafic metavolcanic rocks, mainly pillowed and massive flows. Oxide and sulphide facies iron formation is intercalated within the metavolcanic rocks. Minor metasedimentary rocks are also present. Gabbro is also present. Schnieders et al. (1993) describes the Twomey B.I.F as: Oxide facies formation consisting of laminated magnetite and chert bands (locally jasper) is observed in several locations throughout the property. The iron formation at location #1 is hosted by fine grained, pelitic, metasedimentary rocks or mudstone, as well as greywacke and minor conglomerate. The iron formation is 3 to 4 m in width and strikes 290 degrees to 320 degrees and dips 55 degrees NE. Mafic intrusive rocks, mainly gabbro, intrude the metasedimentary rocks. Gold mineralization is associated with secondary sulphides in crosscutting fractures within the iron formation, as well as sulphide replacements of the chert and magnetite layers. Semi massive pyrite is present over widths of up to 5 cm in association with the cross fractures and replaced layers. Pyrite preferentially replaces the chert layers in a 'brickwork' type fashion. The cross fractures strike 100 degrees and are commonly associated with areas of jaspilitic iron formation.\u0026nbsp; Grab sample 92 BTT 1 collected by Resident Geologist staff consisted of pyrite rich (less than or equal to 20%) iron formation and assayed 0.156 ounces Au per ton.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cstrong\u003e\u003cspan style=\"font-size: 11pt; font-family: Calibri, sans-serif;\"\u003eTwomey Power Line Occurrence\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003eIn addition, sampling by Twomey from a quartz vein along the power line (location #3 on map) assayed 10.48 g/t gold. \u0026nbsp;The quartz vein is associated with felsic intrusive dikes within mafic metavolcanic rocks. \u0026nbsp;The vein strikes 106 degrees and dips 70 degrees SW and has been traced for over 200 m along the power line. The vein averages 20 to 25 cm in width and displays a crack-seal texture. The quartz vein occurs in contact with a pink hornblende syenite dike, which is commonly on the footwall contact of the vein. \u0026nbsp;Several syenite dikes were observed in the area, up to l m in width. The quartz vein and syenite dikes are hosted by sheared and deformed pillowed mafic metavolcanic rocks. \u0026nbsp;Extensional, sigmoidal, quartz-filled gash veins are present within the metavolcanic host rocks. In one section, the main mineralized quartz vein displays a 20x flexure in strike. On the eastern end of the showing, approximately 300 m east of main mineralized quartz vein, several narrow, mineralized, quartz-filled gash veins are exposed within syenite dikes. \u0026nbsp;The quartz vein contains pyrite, minor chalcopyrite, tourmaline, hematite and chlorite. Samples collected and analyzed are displayed in Table 7.5 (see map).\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cspan lang=\"EN-GB\" style=\"font-size: 11pt; font-family: Calibri, sans-serif;\"\u003eSchreiber-Pyramid Occurrence\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-GB\" style=\"font-size: 11pt; font-family: Calibri, sans-serif;\"\u003eImmediately south of the Little Bear property boundary is the Schreiber-Pyramid Occurrence.\u0026nbsp; Previous \u003c/span\u003e\u003cspan style=\"font-size: 11pt; font-family: Calibri, sans-serif;\"\u003ework dates back to early 1930\u0026rsquo;s when auriferous quartz veins on the property were trenched and bulk sampled by Kenecho Gold Mines.\u0026nbsp; Records indicate that 150 tons of ore was mined at an average grade of 17.6 g/t gold from the #1 vein in 1937.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan style=\"font-size: 11pt; font-family: Calibri, sans-serif;\"\u003eIn 1969 Zenmac Metal Mines Ltd. drilled five holes, totalling 243 meters, on a base metal showing (#2 vein) north of the Schreiber Pyramid adit (#1 vein).\u0026nbsp; Drill holes intersected minor quartz veining and pyritic shear zones, with the best intersection returning 4.6% Cu and 19.2% Zn over 0.55 meters at a vertical depth of 15.24 meters from massive sulphides (chalcopyrite-sphalerite-pyrrhotite) in a chloritic shear at a contact between volcanic and sedimentary rocks.\u0026nbsp; In 1984 Falconbridge Copper acquired the \u003c/span\u003e\u003cspan lang=\"EN-GB\" style=\"font-size: 11pt; font-family: Calibri, sans-serif;\"\u003eSchreiber-Pyramid\u003c/span\u003e\u003cspan style=\"font-size: 11pt; font-family: Calibri, sans-serif;\"\u003e property to re-evaluate its base metal potential in light of the nearby Winston Lake discovery.\u0026nbsp; Grab samples of the #2 vein by Falconbridge assayed as high as 31% zinc and a one foot channel sample yielded 13.77% zinc.\u0026nbsp; Further, a grab sample from the #1 vein directly above the Schreiber Pyramid adit, assayed 45.2 g/t Au.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan style=\"font-size: 11pt; font-family: Calibri, sans-serif;\"\u003eIn 1987, the Ministry of Northern Development of Mines visited the property and sampled both the #1 and #2 veins.\u0026nbsp; Two samples from the #1 vein assayed 13.06 g/t and 26.75 g/t.\u0026nbsp; A sample from the #2 vein assayed 17.5% copper, 7.1% zinc and 139 g/t silver.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cstrong\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11pt; font-family: Calibri, sans-serif;\"\u003eLittle Bear Occurrence\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11pt; font-family: Calibri, sans-serif;\"\u003eThe Little Bear Occurrence lies a short distance north of the property.\u0026nbsp; \u003c/span\u003e\u003cspan lang=\"EN-GB\" style=\"font-size: 11pt; font-family: Calibri, sans-serif;\"\u003eThe occurrence was discovered in 1935 by E. McKenzie while surface prospecting.\u0026nbsp; A 2.4 meter by 1.5 meter shaft was sunk to a depth of 5.5 meters along with trenching and pitting.\u0026nbsp;\u0026nbsp; A one ton bulk sample taken from the occurrence in 1936 was reported to have an average grade of 1,419 g/ton gold.\u0026nbsp; The claims lapsed and were re-staked by J.E. Halonen in 1946.\u0026nbsp; Spectacular samples of quartz containing visible gold and possible tellurides have been taken from the property.\u0026nbsp; The single leased claim is still held by the Halonen family.\u003c/span\u003e\u003c/p\u003e\n\u003ch3\u003eProperty Occurrences\u003c/h3\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cstrong\u003e\u003cspan style=\"font-size: 11pt; font-family: Calibri, sans-serif;\"\u003eNEW High-Grade Gold Occurrence\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003eA work program in 2010 targeted an intense magnetic response located on the north side of a hill just south of a small pond in the southern part of the Little Bear property.\u0026nbsp; Smoky banded chert was stripped over an area 1 metre wide by 6 metres long.\u0026nbsp; The chert is highly magnetic and contains crystals of specular hematite and heavily mineralized calcite.\u0026nbsp; Assays from the zone\u0026nbsp;averaged 1.5 g/t gold over the 6 meter width. The northern 2 meters of the zone carries 3.3 g/t gold.\u0026nbsp;\u0026nbsp;To the south, the stripping was lost in a heavily pitted rusty rock.\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003eIn 2011, Bard Ventures conducted additional MAG/VLF surveys, followed by prospecting and sampling.\u0026nbsp; The program identified three separate areas of high potential.\u0026nbsp; \u003cstrong\u003eThe first area located bonanza style grades of gold up to 53.7 g/t gold and 19.25 g/t silver.\u003c/strong\u003e\u0026nbsp; A second area 200 meters to the north assayed 3.8 g/t gold.\u0026nbsp; A third area to the southeast returned 18.2 g/t gold and 1.03 g/t silver in soils.\u0026nbsp; The high soils, bonanza gold values and the 2010 showing all appear to line up along a single zone that is 1.6 kilometers long.\u0026nbsp; Bard reluctantly returned the property to us as a result of poor market conditions (low share price and no cash).\u003c/p\u003e\n\u003ch3\u003eConclusion\u003c/h3\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan style=\"font-size: 11pt; font-family: Calibri, sans-serif;\"\u003eRecent exploration has uncovered three separate bedrock sources of gold, with a fourth area containing high-grade gold and silver in soil.\u0026nbsp; The property has seen no trenching or drilling, and numerous untested EM conductors exist throughout the claim block.\u0026nbsp; There appears to be at least two favourable trends that contain highly anomalous gold mineralization, one which has been measured over a distance of 1.6 km.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan style=\"font-size: 11pt; font-family: Calibri, sans-serif;\"\u003eTwomey\u0026rsquo;s two discoveries indicate gold is found both within iron formation and quartz veining,\u0026nbsp; Resident Geologist staff observed several additional iron formation exposures, some previously stripped by Corporation Falconbridge Copper and others requiring further sampling and exploration for both gold and base metals. This suggests a number of parallel iron formations with potential strike lengths up to 3 km in this immediate area.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-GB\" style=\"font-size: 11pt; font-family: Calibri, sans-serif;\"\u003eBased on the impressive showings within the property as well as \u003c/span\u003e\u003cspan style=\"font-size: 11pt; font-family: Calibri, sans-serif;\"\u003epotentially important high-grade base metal values (17.5% Cu - 31% Zn - 139 g/t Ag) immediately adjacent our property, the Little Bear claims have high potential to host a lode gold and/or VMS style deposit.\u003c/span\u003e\u003c/p\u003e","visible":true,"locationRefId":"c5348daf-ee53-44ae-bfc6-2b3584d33ce5","created":{"$date":"2014-12-31T19:16:00.000Z"},"__v":0}
{"_id":"b538816a-c323-448d-9358-fc7dcbed675d","name":"Lunny Lake","safeName":"lunny-lake","description":"Drilling by Hemlo Gold in 1996 encountered 1 meter of 37.4 g/t Au just 100 meters from the property boundary.  A second drill hole, 200 meters further east, encountered 3 meters of 3.9 g/t Au, including 1 meter of 10.6 g/t Au.","body":"\u003ch3 class=\"MsoNormal\"\u003e\u003cspan style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif;\"\u003eLocation and Access\u003c/span\u003e\u003c/h3\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif;\"\u003eThe Lunny Lake property consists of 34 units and is located about 18 kilometers northeast of Hemlo, Ontario in Thunder Bay Mining Division.\u0026nbsp; The claims are accessible by traveling north on Highway 614 from the Trans-Canada highway a distance of 14 kilometers.\u0026nbsp; From that point, a road runs north-easterly toward Dead Otter Lake and cuts the western part of the property.\u0026nbsp; A subsidiary road (Twist Lake Road) trends through the eastern portion of the claims.\u0026nbsp; The property is characterized by rolling hills with low topographic relief and timbered with spruce and balsam.\u003c/span\u003e\u003c/p\u003e\n\u003ch3 class=\"MsoNormal\"\u003e\u003cspan style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif;\"\u003eGeology\u003c/span\u003e\u003c/h3\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif;\"\u003eThe Lunny Lake Property is located within the Archean Schreiber-Hemlo Greenstone Belt that is part of the Abitibi-Wawa Subprovince. The property is situated on the northern portion of the synform and dominated by east-west striking sequences of metavolcanic and metasedimentary rocks bounded to the south by the Musher Lake Pluton.\u0026nbsp; Mafic metavolcanic rock form the lowermost stratigraphic unit and consist of pillowed flows which grade into fine to medium and medium to coarse grained amphibolites.\u0026nbsp; Tops determination taken from pillows indicates a south younging direction. Interflow sediments, tuff and iron formation are found intermixed within the mafic flow.\u0026nbsp; A calcsilicate unit intermixed with felsic to intermediate flows and pyroclastic rocks overlies the mafic volcanic.\u0026nbsp; This sequence grades in turn into thick succession of metasediments consisting essentially of conglomerates and greywacke.\u0026nbsp; Locally the emplacement of the Dotted Lake Pluton has produced a large easterly plunging anticline.\u0026nbsp; The property is located on the southern limb of this structure.\u003c/span\u003e\u003c/p\u003e\n\u003ch3 class=\"MsoNormal\"\u003e\u003cspan style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif;\"\u003eProperty Showings\u003c/span\u003e\u003c/h3\u003e\n\u003ch4 class=\"MsoNormal\"\u003e\u003cspan style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; color: #0070c0;\"\u003eMcIntyre Showing #4\u003c/span\u003e\u003c/h4\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif;\"\u003eThe host rock is an intermediate to felsic volcanic.\u0026nbsp; Drilling by McIntyre Porcupine in 1962 intersected 0.9 meters of 3.9% Cu over the showing.\u0026nbsp; Further drilling by the Falconbridge/Caravelle Mines joint venture in 1967 at the #4 showing returned the following intercepts:\u003c/span\u003e\u003c/p\u003e\n\u003cul style=\"margin-top: 0cm;\" type=\"disc\"\u003e\n\u003cli class=\"MsoNormal\"\u003e\u003cspan style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif;\"\u003eHole A2 \u0026ndash; 2.5 meters of 8.2 g/t Au, 1.1% Cu, 0.8% Zn and 13.7 g/t Ag.\u003c/span\u003e\u003c/li\u003e\n\u003cli class=\"MsoNormal\"\u003e\u003cspan style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif;\"\u003eHole W1 \u0026ndash; 2.1 meters of 3.2 g/t Au, 2.9% Cu, 2.1% Zn and 52.8 g/t Ag.\u003c/span\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif;\"\u003eThe mineralized sections contain appreciable amounts of garnets, minor chlorite alteration and 10-15% sulphides.\u0026nbsp; Minor malachite staining and chalcopyrite is present.\u0026nbsp; Previous operators incorrectly mapped the rocks as dipping north and consequently, drilling was from the north to south.\u0026nbsp; Close examination of the rocks in the vicinity of the showing clearly demonstrate a steep south dip.\u0026nbsp; The showing dips under a creek bed, so it is not known what the true width of mineralization is.\u0026nbsp; Sampling from 2006 and 2007 was as follows:\u003c/span\u003e\u003c/p\u003e\n\u003cul style=\"margin-top: 0cm;\" type=\"disc\"\u003e\n\u003cli class=\"MsoNormal\"\u003e\u003cspan style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif;\"\u003eSample 2006-7 - 0.16 g/t Au, 6.6 g/t Ag, 0.42% Cu\u003c/span\u003e\u003c/li\u003e\n\u003cli class=\"MsoNormal\"\u003e\u003cspan style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif;\"\u003eSample 2006-8 - 0.10 g/t Au, 7.0 g/t Ag, 0.48% Cu\u003c/span\u003e\u003c/li\u003e\n\u003cli class=\"MsoNormal\"\u003e\u003cspan style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif;\"\u003eSample 2006-9 - 0.15 g/t Au, 35.0 g/t Ag, 0.13% Pb, 2.16% Cu, 0.29% Zn\u003c/span\u003e\u003c/li\u003e\n\u003cli class=\"MsoNormal\"\u003e\u003cspan style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif;\"\u003eSample 2006-10 - 0.13 g/t Au, 22.8 g/t Ag, 1.31% Cu, 0.20% Zn\u003c/span\u003e\u003c/li\u003e\n\u003cli class=\"MsoNormal\"\u003e\u003cspan style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif;\"\u003eSample 2006-11 - 0.19 g/t Au, 11.2 g/t Ag, 0.65% Cu\u003c/span\u003e\u003c/li\u003e\n\u003cli class=\"MsoNormal\"\u003e\u003cspan style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif;\"\u003eSample 2007-8 - 2.10 g/t Ag, 0.12% Cu\u003c/span\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch4 class=\"MsoNormal\"\u003e\u003cspan style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; color: #0070c0;\"\u003eMcIntyre Showing #5\u003c/span\u003e\u003c/h4\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif;\"\u003eThis showing represents a parallel zone of mineralization which is stratigraphically below the mineralized horizon at the #4 showing.\u0026nbsp; Prospecting by C. Von Klein in 1963, approx. 50 meters north and 75 meters west of the #4 showing returned values up to 5.4% Cu.\u0026nbsp; The host rock of the showing is a fine-grained mafic volcanic with banded sulphides up to 20% pyrite and 5% chalcopyrite.\u0026nbsp; It is a prominent gossan in the field.\u0026nbsp; Recent assays from this showing have returned 0.14% copper (2005-6) and 0.38% copper (2005-7) respectively.\u003c/span\u003e\u003c/p\u003e\n\u003ch4 class=\"MsoNormal\"\u003e\u003cspan style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; color: #0070c0;\"\u003eMcIntyre Showing #2\u003c/span\u003e\u003c/h4\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif;\"\u003eThe host rock is a gabbro and is a prominent gossan.\u0026nbsp; In the vicinity of the showing the gabbro appears to be quite narrow and is sandwiched between the Lunny Lake Porphyry to the north and a sedimentary unit to the south.\u0026nbsp; The Musher Lake Pluton lies about 100 meters south of the showing.\u0026nbsp; Sampling from 2007 was as follows:\u003c/span\u003e\u003c/p\u003e\n\u003cul style=\"margin-top: 0cm;\" type=\"disc\"\u003e\n\u003cli class=\"MsoNormal\"\u003e\u003cspan style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif;\"\u003eSample 2007-5 - 8.5 g/t Ag, 0.08% Co, 0.11% Cr, 0.53% Cu, 0.45% Ni, 0.06 g/t Pt, 0.07 g/t Pd\u003c/span\u003e\u003c/li\u003e\n\u003cli class=\"MsoNormal\"\u003e\u003cspan style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif;\"\u003eSample 2007-6 (re-assay) - 144.0 g/t Ag, 0.10% Cr, 0.76% Cu, 0.19% Ni, 0.54% Pb, 0.81% Zn, 0.04 g/t Pt, 0.05 g/t Pd\u003c/span\u003e\u003c/li\u003e\n\u003cli class=\"MsoNormal\"\u003e\u003cspan style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif;\"\u003eSample 2007-16 - 65.9 g/t Ag, 0.12% Cr, 0.43% Cu, 0.69% Ni, 0.11 g/t Pt, 0.13 g/t Pd\u003c/span\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif;\"\u003eA gold soil anomaly lies immediately southwest of the showing.\u0026nbsp; In addition, there is a highly altered sericite schist \u0026ndash; referred to as the Lunny Lake Porphyry - adjacent the gabbro.\u0026nbsp; A strong EM conductor overlies this mineralization.\u003c/span\u003e\u003c/p\u003e\n\u003ch4 class=\"MsoNormal\"\u003e\u003cspan style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif;\"\u003e \u003cspan style=\"color: #0070c0;\"\u003eMcIntyre Zone C\u003c/span\u003e\u003c/span\u003e\u003c/h4\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif;\"\u003eThis zone is a VLF Conductor striking 100\u0026deg;.\u0026nbsp; The rocks here are sheared mafic volcanics that contain appreciable amounts of sericite and lesser carbonate and minor quartz veining.\u0026nbsp; Amounts of 2-3% py and po are present with minor cpy.\u0026nbsp; Sections of the zone are strongly magnetic.\u0026nbsp; Assays from this area include:\u003c/span\u003e\u003c/p\u003e\n\u003cul style=\"margin-top: 0cm;\" type=\"disc\"\u003e\n\u003cli class=\"MsoNormal\"\u003e\u003cspan style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif;\"\u003eSample 2005-1 - 09 g/t gold and 1.5 g/t silver\u003c/span\u003e\u003c/li\u003e\n\u003cli class=\"MsoNormal\"\u003e\u003cspan style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif;\"\u003eSample 2005-2 - 0.10 g/t gold\u003c/span\u003e\u003c/li\u003e\n\u003cli class=\"MsoNormal\"\u003e\u003cspan style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif;\"\u003eSample 2005-3 - 0.13% zinc\u003c/span\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch4 class=\"MsoNormal\"\u003e\u003cspan style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; color: #0070c0;\"\u003eNoranda Trench 197E\u003c/span\u003e\u003c/h4\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif;\"\u003eThis trench located about 300 meters east of the #2 showing.\u0026nbsp; The trench has stripped a section of the Lunny Lake Porphyry and mixed sediments.\u0026nbsp; If the gabbro extends east from the #2 showing into this area, then it is presumed to be immediately south of the trenching.\u0026nbsp; A grab sample of the mineralized sediments from this trench, containing 2-3% pyrite, returned 0.21% Zn (sample 2006-5).\u003c/span\u003e\u003c/p\u003e\n\u003ch4 class=\"MsoNormal\"\u003e\u003cspan style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; color: #0070c0;\"\u003eRoad Zone\u003c/span\u003e\u003c/h4\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif;\"\u003eGold was found in the roadbed of the access road into the area.\u0026nbsp; Several rusty, localized pieces of float make up this section of the roadbed.\u0026nbsp; A large boulder immediately west of the road is similar in composition.\u0026nbsp; The rocks appear to be a sedimentary iron formation containing up to 30% pyrite +/- magnetite and moderate carbonate and chlorite alteration.\u0026nbsp; While the bedrock source was not found, it is apparent that the float has been transported from an area very close by.\u0026nbsp; Further, there is also a very strong EM conductor immediately south of the sample, which is the likely source of the sample.\u0026nbsp; Overburden in the area does not allow for good outcrop exposure and trenching is highly recommended at this locale to find this promising rock unit.\u0026nbsp; A sample from the roadbed sample assayed 2.40 g/t Au and 5.4 g/t Ag (sample 2007-2).\u003cbr /\u003e \u003c!--[endif]--\u003e\u003c/span\u003e\u003c/p\u003e\n\u003ch4 class=\"MsoNormal\"\u003e\u003cspan style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; color: #0070c0;\"\u003eLunny Lake Porphyry\u003c/span\u003e\u003c/h4\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif;\"\u003eThe porphyry grades into a \u0026lsquo;feldspathic unit\u0026rsquo; in the south-eastern part of the property.\u0026nbsp; Drilling by Hemlo Gold in 1996 encountered 1 meter of 37.4 g/t Au just 100 meters from the property boundary.\u0026nbsp; A second drill hole, 200 meters further east, encountered 3 meters of 3.9 g/t Au, including 1 meter of 10.6 g/t Au.\u0026nbsp; The porphyry is 100-150 meters wide and strikes across the entire property a distance of four kilometres.\u003c/span\u003e\u003c/p\u003e\n\u003ch3\u003e\u003cspan style=\"font-size: 11pt; font-family: Calibri, sans-serif;\"\u003eSummary\u003c/span\u003e\u003c/h3\u003e\n\u003cp\u003e\u003cspan style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-fareast-font-family: 'Times New Roman'; mso-bidi-font-family: 'Times New Roman'; mso-ansi-language: EN-CA; mso-fareast-language: EN-US; mso-bidi-language: AR-SA;\"\u003eOf great interest is a quartz-eye porphyry known as the Lunny Lake Porphyry which contains appreciable amounts of sulphides.\u0026nbsp; The hanging wall of the Lunny Lake Porphyry seems to offer good potential for ore-grade mineralization, and further sampling along this horizon is warranted.\u0026nbsp; In addition, the McIntyre Showing #2 wasn\u0026rsquo;t re-located until 2007 and based upon sampling to date, has very good potential to host ore-grade mineralization.\u0026nbsp; Sampling has returned assays of 179.0 g/t silver, 0.12% chromium, 0.76% copper, 0.69% nickel, 0.08% cobalt, 0.11 g/t platinum, 0.13 g/t palladium 0.54% lead and 0.81% zinc.\u0026nbsp; Little is known about the zone's orientation or width/strike potential and consequently it is a very high priority target.\u0026nbsp; Due to the strong similarity to the porphyritic rocks at Hemlo and\u0026nbsp;\u003c/span\u003e\u003c/p\u003e","visible":true,"locationRefId":"287678ac-8d7b-48ea-b0d8-7e8f80957b0a","created":{"$date":"2014-12-31T19:43:00.000Z"},"__v":0}
{"_id":"7fc64cbd-4547-48c5-b874-ed20c93d9174","name":"Black River","safeName":"black-river","description":"The property hosts a high-grade Zn-Pb-Ag occurrence.  A grab sample collected by a prospector from the occurrence in 1991 returned assay values of 10.7% Zn, 8.9% Pb and 77.8 g/t Ag.  The occurrence has only seen 6 shallow holes (Cominco, 1965) and assay results were not reported.","body":"\u003ch3\u003e\u003cspan lang=\"EN-GB\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-bidi-font-family: Calibri; mso-ansi-language: EN-GB;\"\u003eLocation and Access\u003c/span\u003e\u003c/h3\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-GB\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-bidi-font-family: Calibri; mso-ansi-language: EN-GB;\"\u003eThe Black River property consists of 45 claim units located in the Wabikoba Lake area of the Thunder Bay Mining District.\u0026nbsp; The claims are located approximately 10 km northwest of the Hemlo gold deposit and can be accessed from two directions.\u0026nbsp; The western portion of the property can be reached by travelling 24 km down the Swede Lake forest access road, which turns off Highway 614 approximately 26 km south of the town of Manitouwadge.\u0026nbsp; The eastern portion of the property can be reached by \u003c/span\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif;\"\u003etraveling north on Highway 614 from the Trans-Canada highway a distance of 14 kilometers.\u0026nbsp; From that point, the Amwri Lake road runs westerly roughly 5 kilometers to the property.\u0026nbsp; The Amrwi Lake road, however, has not been kept up and is limited to ATV or 4X4 vehicle traffic.\u0026nbsp; An alternate route would be to travel a further 6 kilometers north to the Pinegrove Lake road, which is in much better shape.\u0026nbsp; Heading south a distance of 8 kilometers will bring you to the property.\u003c/span\u003e\u003c/p\u003e\n\u003ch3 class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-GB\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-bidi-font-family: Calibri; mso-ansi-language: EN-GB;\"\u003eGeology\u003c/span\u003e\u003c/h3\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-bidi-font-family: Calibri;\"\u003eThe property is located within the Archean Schreiber-Hemlo Greenstone Belt that is part of the Abitibi-Wawa-Shebandowan Subprovince of the Superior Province.\u0026nbsp; More specifically, it is situated on the western end of the north limb of the Hemlo synform and is dominated by south-west/north-east striking sequences of metavolcanic and metasedimentary rocks bounded to the north by the Gowan Lake Pluton. The supracrustal rocks consist principally of tholeiitic basaltic flows and subordinate turfs, intercalated with epiclastic arkosic wacke and siltstone. Feldspar porphyry dykes and sills intrude both volcanics and sediments.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-bidi-font-family: Calibri; layout-grid-mode: both;\"\u003eReconnaissance geological mapping was conducted in 1964 and 1965 (Milne, 1968) at 1:31680. The only other work recorded is in 1984 (Kemp, 1984) at 1:5000 and in 1988 (Hamilton, 1989) at 1:5000. From compiling assessment work data, the property can be shown to be underlain by a package of volcanic and sedimentary rocks.\u0026nbsp; From the monzonite contact southward, a thin, less than 150 meter section, of foliated mafic volcanics is in sharp contact with mudstones which are in contact with a thin felsic pyroclastic unit which grades into laminated sediments and conglomerates. The Kusins Occurrence (discussed in detail below) occurs at the contact of the mudstones and the felsic tuffs.\u0026nbsp; The property is truncated in the south by the Bullring Lake Fault.\u003c/span\u003e\u003c/p\u003e\n\u003ch3 class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-GB\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-bidi-font-family: Calibri; mso-ansi-language: EN-GB;\"\u003ePrevious Exploration\u003c/span\u003e\u003c/h3\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11pt; font-family: Calibri, sans-serif; background-image: initial; background-attachment: initial; background-size: initial; background-origin: initial; background-clip: initial; background-position: initial; background-repeat: initial;\"\u003e1964: Prospecting, stripping and trenching; prospectors W. Kusins and G. Ihnatko. This work exposed Zn-, Pb- and Ag-bearing sulphide mineralization.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11pt; font-family: Calibri, sans-serif; background-image: initial; background-attachment: initial; background-size: initial; background-origin: initial; background-clip: initial; background-position: initial; background-repeat: initial;\"\u003e1965: Line cutting, ground geophysical and soil geochemical surveys, diamond drilling (6 shallow holes); Cominco. Geological mapping; ODM (V.G. Milne).\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11pt; font-family: Calibri, sans-serif; background-image: initial; background-attachment: initial; background-size: initial; background-origin: initial; background-clip: initial; background-position: initial; background-repeat: initial;\"\u003e1966: trenching; prospectors W. Kusins\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11pt; font-family: Calibri, sans-serif; background-image: initial; background-attachment: initial; background-size: initial; background-origin: initial; background-clip: initial; background-position: initial; background-repeat: initial;\"\u003e1978-1979: Lake sediment and water geochemical sampling; GSC and MNR. Samples collected from the vicinity of the occurrence contained slightly anomalous amounts of Cu, Zn and Pb.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11pt; font-family: Calibri, sans-serif; background-image: initial; background-attachment: initial; background-size: initial; background-origin: initial; background-clip: initial; background-position: initial; background-repeat: initial;\"\u003e1983: Line cutting, ground geophysical (MAG) and soil geochemical surveys; Noranda Exploration Co., Ltd. Airborne geophysical survey (HLEM, VLF-EM, MAG); Aerodat Ltd.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11pt; font-family: Calibri, sans-serif; background-image: initial; background-attachment: initial; background-size: initial; background-origin: initial; background-clip: initial; background-position: initial; background-repeat: initial;\"\u003e1984: Geological mapping and litho-geochemical sampling; Noranda Exploration Co., Ltd.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11pt; font-family: Calibri, sans-serif; background-image: initial; background-attachment: initial; background-size: initial; background-origin: initial; background-clip: initial; background-position: initial; background-repeat: initial;\"\u003e1988: Geological mapping and soil geochemical sampling; Dolphin Explorations Ltd.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11pt; font-family: Calibri, sans-serif; background-image: initial; background-attachment: initial; background-size: initial; background-origin: initial; background-clip: initial; background-position: initial; background-repeat: initial;\"\u003e1989: Dighem airborne geophysical survey; Noranda Exploration Co., Ltd. and Noranda Minerals Inc. (Geco Division).\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11pt; font-family: Calibri, sans-serif; background-image: initial; background-attachment: initial; background-size: initial; background-origin: initial; background-clip: initial; background-position: initial; background-repeat: initial;\"\u003e1991: Reconnaissance till sampling; GSC (I.M. Kettles). Litho-geochemical sampling; OGS (D. B. McKay).\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11pt; font-family: Calibri, sans-serif; background-image: initial; background-attachment: initial; background-size: initial; background-origin: initial; background-clip: initial; background-position: initial; background-repeat: initial;\"\u003e1991-1992: Line cutting, stripping, trenching, litho-geochemical sampling, geological mapping and ground geophysical surveys (MAG, VLF-EM, Beep Mat); D. Saunders and P. Simoneau.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11pt; font-family: Calibri, sans-serif; background-image: initial; background-attachment: initial; background-size: initial; background-origin: initial; background-clip: initial; background-position: initial; background-repeat: initial;\"\u003e1994-1996: Line cutting, MAG survey, prospecting; B. Fowler\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11pt; font-family: Calibri, sans-serif; background-image: initial; background-attachment: initial; background-size: initial; background-origin: initial; background-clip: initial; background-position: initial; background-repeat: initial;\"\u003e2003-2005: Line cutting, MAG/VLF survey, prospecting; B. Fowler\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11pt; font-family: Calibri, sans-serif; background-image: initial; background-attachment: initial; background-size: initial; background-origin: initial; background-clip: initial; background-position: initial; background-repeat: initial;\"\u003e2010: Line cutting, MAG/VLF survey, prospecting; B. Fowler\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11pt; font-family: Calibri, sans-serif; background-image: initial; background-attachment: initial; background-size: initial; background-origin: initial; background-clip: initial; background-position: initial; background-repeat: initial;\"\u003e2012: Soil sampling; \u003ca href=\"http://www.entouragemetals.com/wp-content/uploads/2013/01/Gowan_Lake_Soils_Geochem_Dec10_2012_2.gif\"\u003eEntourage Metals\u003c/a\u003e\u003c/span\u003e\u003c/p\u003e\n\u003ch3 class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11pt; font-family: Calibri, sans-serif; background-image: initial; background-attachment: initial; background-size: initial; background-origin: initial; background-clip: initial; background-position: initial; background-repeat: initial;\"\u003eProperty Mineralization (Kusins Occurrence)\u003c/span\u003e\u003c/h3\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11pt; font-family: Calibri, sans-serif; background-image: initial; background-attachment: initial; background-size: initial; background-origin: initial; background-clip: initial; background-position: initial; background-repeat: initial;\"\u003eThe Kusins occurrence is located within the Wawa Subprovince along the north limb of the Schreiber-Hemlo greenstone belt approximately 10 km north of the Hemlo mining camp. The supracrustral rocks in the vicinity of the occurrence are moderately to strongly foliated (235\u0026deg; strike and 60\u0026deg; NW dip) and have experienced upper amphibolite facies-grade regional metamorphism (Milne 1968, Simoneau 1992). The occurrence is underlain primarily by a northeast-trending sequence of foliated, amphibolitic, mafic metavolcanic schists and gneisses; siliceous, argillaceous metasedimentary rocks; and sericitic, felsic metavolcanic tuffs (Milne 1966, 1968; Kemp 1984; Hamilton 1989; Simoneau 1992). The occurrence is located on the northwest side of a low ridge at the contact between the argillaceous metasedimentary rocks and the felsic metavolcanic tuffs (Simoneau 1992). The Gowan Lake and Cedar Lake plutons are located approximately 225 m northwest and 3 km southeast of the occurrence, respectively (Milne 1966; Milne 1968, Map 2144). In the vicinity of the occurrence, the supracrustal rocks proximal to the contact with the Gowan Lake Pluton have been brecciated (Simoneau 1992). The Bullring Lake Fault, a major west-northwest trending dextral fault, is located approximately 305 m south of the occurrence (Milne 1968; Simoneau 1992). Several Proterozoic diabase dikes have intruded the supracrustral rocks in the vicinity of the occurrence. Six pits, varying in size up to approximately 7 m long by 2 m wide by 2.5 m deep have been blasted into the occurrence. These pits are largely rubble-filled and overgrown by vegetation. Pits 1 to 3 are located primarily within theargillaceous metasediments while pits 4 to 6 are primarily within the felsic metavolcanic tuffs. Sulphides are exposed in all of the pits.\u0026nbsp; The argillaceous metasediments are generally fine-grained, dark to light gray, thinly laminated, siliceous phyllites and schists. The felsic metavolcanic tuffs are generally fine- to medium-grained, light tan to buff, thinly laminated, quartz-phyric, quartzofeldspathic sericite schists. The main mineralized zone is hosted within the argillaceous metasediments.\u0026nbsp; The sulphides consist primarily of fine- to coarse-grained, generally euhedral pyrite with minor amounts of fine- to medium-grained, dark brown, anhedral sphalerite, coarse-grained, euhedral galena and rare, medium-grained, anhedral chalcopyrite. The sulphides, exposed in pits 1 to 3, define a mineralized zone approximately 3 m wide and 15 m long which parallels the foliation of the surrounding rocks.\u0026nbsp; Disseminated pyrite occurs throughout this zone. Two thin (30 cm wide), foliation-parallel seams, composed primarily of semi-massive to massive pyrite, occur within the central portion of this mineralized zone. Some of the sulphides display evidence of having undergone recrystallization and remobilization. The coarse-grained pyrite in the central portion of the mineralized zone often displays an annealed texture. Narrow (1 to 2 mm wide) veinlets of fine-grained sphalerite containing minor galena crosscut the semi-massive sulphide zone exposed in pit 2. Thin seams (3 mm wide) of massive pyrite crosscut wider, pyrite-rich sulphide seams exposed in pit 3. These crosscutting pyrite seams parallel a major joint direction (295\u0026deg;) in the surrounding host rocks (Milne 1968). Galena and sphalerite were only observed in pits 2 and 3. The galena was often associated with narrow, crosscutting, calcite-rich, quartz-carbonate veins within the central portion of the mineralized zone. Grab samples collected from the occurrence in 1991 by D.B. McKay for the OGS returned assay values which varied from nil to 0.024 ounce Au/ton, nil to 0.20 ounce Ag/ton, 0.003 to 0.022% Cu, 0.002 to 3.822% Zn and \u0026lt;0.001 to 1.512% Pb. A grab sample collected by prospector P. Simoneau in 1991 returned assay values of 10.7% Zn, 8.9% Pb and 2.5 ounce Ag/ton. A 0.80 m long chip sample collected by the same prospector is reported to have contained 0.84% Zn, 0.13% Pb and 1.8 ounce Ag/ton.\u003c/span\u003e\u003c/p\u003e\n\u003ch3 class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-GB\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-bidi-font-family: Calibri; mso-ansi-language: EN-GB;\"\u003ePast Drilling\u003c/span\u003e\u003c/h3\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-GB\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-bidi-font-family: Calibri; mso-ansi-language: EN-GB;\"\u003eMining Corp of Canada (1964)\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-GB\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-bidi-font-family: Calibri; mso-ansi-language: EN-GB;\"\u003eMC-1 (107 m)\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-GB\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-bidi-font-family: Calibri; mso-ansi-language: EN-GB;\"\u003eMC-2 (151 m)\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-GB\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-bidi-font-family: Calibri; mso-ansi-language: EN-GB;\"\u003eMC-4 (47 m)\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-GB\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-bidi-font-family: Calibri; mso-ansi-language: EN-GB;\"\u003eCominco (1965) \u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-GB\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-bidi-font-family: Calibri; mso-ansi-language: EN-GB;\"\u003eSix shallow holes; no assessment record.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-GB\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-bidi-font-family: Calibri; mso-ansi-language: EN-GB;\"\u003eNewmont (1982)\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-GB\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-bidi-font-family: Calibri; mso-ansi-language: EN-GB;\"\u003eSL-2 (360 m)\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-GB\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-bidi-font-family: Calibri; mso-ansi-language: EN-GB;\"\u003eNoranda/Pryme Energy (1983)\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-GB\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-bidi-font-family: Calibri; mso-ansi-language: EN-GB;\"\u003ePN-4 (212 m) - intersected 0.9 m @ 1.1% Cu, 0.9% Zn (194.1-195.0)\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-GB\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-bidi-font-family: Calibri; mso-ansi-language: EN-GB;\"\u003eBattle Mountain (1996)\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-GB\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-bidi-font-family: Calibri; mso-ansi-language: EN-GB;\"\u003eP96-1 (206 m)\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-GB\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-bidi-font-family: Calibri; mso-ansi-language: EN-GB;\"\u003eP96-2 (220 m)\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-GB\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-bidi-font-family: Calibri; mso-ansi-language: EN-GB;\"\u003eP96-3 (205 m)\u003c/span\u003e\u003c/p\u003e\n\u003ch3 class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-GB\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-bidi-font-family: Calibri; mso-ansi-language: EN-GB;\"\u003eConclusions\u003c/span\u003e\u003c/h3\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-GB\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-bidi-font-family: Calibri; mso-ansi-language: EN-GB;\"\u003eThe property hosts a high-grade Zn-Pb-Ag occurrence discovered by W. Kusins in 1963.\u0026nbsp; A grab sample from the occurrence collected by prospector P. Simoneau in 1991 returned assay values of 10.7% Zn, 8.9% Pb and 77.8 g/t Ag.\u0026nbsp; The showing has only seen 6 shallow holes in 1965 by Cominco and assay results were not reported.\u0026nbsp; The mineralized unit from the showing east to the Black River (a distance of 1,200 meters) has never been drilled and represents a significant target for VMS-style mineralization.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-GB\" style=\"font-size: 11pt; font-family: Calibri, sans-serif;\"\u003eA second very important target on the property lies in the north-east part of the property covering an intense mag anomaly.\u0026nbsp; The anomaly appears to have been drilled by Mining Corp of Canada in 1964 with three short holes.\u0026nbsp; Again, there is no record of their assessment or drill assays.\u0026nbsp; Sampling by B. Fowler in 2003 uncovered highly silicified and carbonated intermediate-felsic volcanic rock containing abundant pyrite within the high mag anomaly.\u0026nbsp; A short distance to the northeast, this unit carries high gold in soil (Entourage, 2012). \u0026nbsp;It is suspected that the adjacent Black-Pic Batholith provided a felsic magma heat source for a potential gold zone along this trend.\u0026nbsp; Adding further reinforcement to the potential of this unit, is the discovery of gold-bearing float by prospector Mick Stares in 1994 some 3 kilometres southwest of the property. The sample of float, described as mafic volcanic containing 20% pyrite, assayed 16.2 g/t gold.\u0026nbsp; The mafic unit is stratigraphically above the zinc-bearing horizon; adjacent to \u003c/span\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11pt; font-family: Calibri, sans-serif;\"\u003ethe Gowan Lake (monzonite) Pluton; and along strike of the high mag anomaly to the northeast\u003c/span\u003e\u003cspan lang=\"EN-GB\" style=\"font-size: 11pt; font-family: Calibri, sans-serif;\"\u003e.\u0026nbsp; The source for this float has not been found.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-GB\" style=\"font-size: 11pt; font-family: Calibri, sans-serif;\"\u003eAs a result, two prominent targets exist within the four kilometre long Black River Property.\u003c/span\u003e\u003c/p\u003e","visible":true,"locationRefId":"287678ac-8d7b-48ea-b0d8-7e8f80957b0a","created":{"$date":"2015-01-11T18:24:00.000Z"},"__v":0}
{"_id":"c973365d-2a38-4d5e-835b-d95a7b8b1b6f","name":"Valley Lake","safeName":"valley-lake","description":"The Valley Lake property covers a 2 kilometer strike length of a mafic volcanic unit, which is presumed to be the host of high grade gold float assaying 16.2 grams/tonne gold found just 450 meters southwest of the property.","body":"\u003ch3 class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e\u003cspan lang=\"EN-GB\" style=\"mso-bidi-font-size: 12.0pt; line-height: 107%; mso-ascii-font-family: Calibri; mso-hansi-font-family: Calibri; mso-bidi-font-family: Calibri; mso-ansi-language: EN-GB;\"\u003eLocation and Access\u003c/span\u003e\u003c/h3\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e\u003cspan lang=\"EN-GB\" style=\"mso-bidi-font-size: 12.0pt; line-height: 107%; mso-ascii-font-family: Calibri; mso-hansi-font-family: Calibri; mso-bidi-font-family: Calibri; mso-ansi-language: EN-GB;\"\u003eThe Valley Lake property consists of 10 claim units located in the Wabikoba Lake area of the Thunder Bay Mining District.\u0026nbsp; The claims are located approximately 10 km northwest of the Hemlo gold deposit and can be accessed by travelling 24 km down the Swede Lake forest access road, which turns off Highway 614 approximately 26 km south of the town of Manitouwadge.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003ch3 class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e\u003cspan lang=\"EN-GB\" style=\"mso-bidi-font-size: 12.0pt; line-height: 107%; mso-ascii-font-family: Calibri; mso-hansi-font-family: Calibri; mso-bidi-font-family: Calibri; mso-ansi-language: EN-GB;\"\u003eRegional Geology\u003c/span\u003e\u003c/h3\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e\u003cspan style=\"mso-bidi-font-size: 12.0pt; line-height: 107%; mso-ascii-font-family: Calibri; mso-hansi-font-family: Calibri; mso-bidi-font-family: Calibri;\"\u003eThe property is located within the Archean Schreiber-Hemlo Greenstone Belt that is part of the Abitibi-Wawa-Shebandowan Subprovince of the Superior Province.\u0026nbsp; More specifically, it is situated on the western end of the north limb of the Hemlo synform and is dominated by south-west/north-east striking sequences of metavolcanic and metasedimentary rocks bounded to the north by the Gowan Lake Pluton. The supracrustal rocks consist principally of tholeiitic basaltic flows and subordinate turfs, intercalated with epiclastic arkosic wacke and siltstone. Feldspar porphyry dykes and sills intrude both volcanics and sediments.\u003c/span\u003e\u003c/p\u003e\n\u003ch3 class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e\u003cspan lang=\"EN-GB\" style=\"mso-bidi-font-size: 12.0pt; line-height: 107%; mso-ascii-font-family: Calibri; mso-hansi-font-family: Calibri; mso-bidi-font-family: Calibri; mso-ansi-language: EN-GB;\"\u003eProperty Geology\u003c/span\u003e\u003c/h3\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt; mso-layout-grid-align: none; text-autospace: none;\"\u003e\u003cspan style=\"mso-bidi-font-size: 12.0pt; line-height: 107%; mso-ascii-font-family: Calibri; mso-hansi-font-family: Calibri; mso-bidi-font-family: Calibri;\"\u003eThe property is underlain by monzonite and a package of volcanic and sedimentary rocks.\u0026nbsp; From the monzonite contact southward, a 150 meter wide section, of foliated mafic volcanics is in sharp contact with mudstones which are in contact with a thin felsic pyroclastic unit which grades into laminated sediments and conglomerates. The adjacent Kusins Occurrence occurs at the contact of the mudstones and the felsic tuffs.\u0026nbsp; The property is crosscut by diabase dykes.\u003c/span\u003e\u003c/p\u003e\n\u003ch3 class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e\u003cspan lang=\"EN-GB\" style=\"mso-bidi-font-size: 12.0pt; line-height: 107%; mso-ascii-font-family: Calibri; mso-hansi-font-family: Calibri; mso-bidi-font-family: Calibri; mso-ansi-language: EN-GB;\"\u003ePrevious Exploration\u003c/span\u003e\u003c/h3\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e\u003cspan lang=\"EN-GB\" style=\"mso-bidi-font-size: 12.0pt; line-height: 107%; mso-ascii-font-family: Calibri; mso-hansi-font-family: Calibri; mso-bidi-font-family: Calibri; mso-ansi-language: EN-GB;\"\u003eThe property covers the western portion of a \u003c/span\u003e\u003cspan style=\"mso-bidi-font-size: 12.0pt; line-height: 107%; mso-ascii-font-family: Calibri; mso-hansi-font-family: Calibri; mso-bidi-font-family: Calibri;\"\u003epyritic, silicified sericite horizon\u003c/span\u003e\u003cspan lang=\"EN-GB\" style=\"mso-bidi-font-size: 12.0pt; line-height: 107%; mso-ascii-font-family: Calibri; mso-hansi-font-family: Calibri; mso-bidi-font-family: Calibri; mso-ansi-language: EN-GB;\"\u003e that hosts the high-grade Kusins occurrence (10.7% zinc, 8.9% lead and 77.8 grams/ton silver) which W.T. Kusins discovered in 1962.\u0026nbsp; Kusins put down four small pits on the occurrence in 1964 before he optioned his claims to Cominco in 1965 who drilled 6 shallow holes on the occurrence in 1965.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e\u003cspan lang=\"EN-GB\" style=\"mso-bidi-font-size: 12.0pt; line-height: 107%; mso-ascii-font-family: Calibri; mso-hansi-font-family: Calibri; mso-bidi-font-family: Calibri; mso-ansi-language: EN-GB;\"\u003eIn 1994, Mick Stares, a prospector from Thunder Bay, found a piece of float that assayed 16.2 g/t gold in a mafic volcanic unit containing 20% pyrite.\u0026nbsp; Stares float was taken just 450 meters west of the Valley Lake property.\u0026nbsp; The source for the float wasn\u0026rsquo;t found.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e\u003cspan lang=\"EN-GB\" style=\"mso-bidi-font-size: 12.0pt; line-height: 107%; mso-ascii-font-family: Calibri; mso-hansi-font-family: Calibri; mso-bidi-font-family: Calibri; mso-ansi-language: EN-GB;\"\u003eIn 1995, Battle Mountain Canada drilled three holes in the immediate area.\u0026nbsp; Two of these holes (V95-1 and V95-2) were collared south-west of the property and one hole (V95-3) was collared south of the property.\u0026nbsp; All three holes tested I.P. chargeability anomalies.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e\u003cspan lang=\"EN-GB\" style=\"mso-bidi-font-size: 12.0pt; line-height: 107%; mso-ascii-font-family: Calibri; mso-hansi-font-family: Calibri; mso-bidi-font-family: Calibri; mso-ansi-language: EN-GB;\"\u003eIn 1996, Battle Mountain Canada drilled two more holes in the area.\u0026nbsp; The diamond drilling tested the horizon that hosts the Kusins occurrence as well as two separate I.P. chargeability anomalies situated on either side of this horizon.\u0026nbsp; One of these holes (OR96-1) was collared east of the property, while OR96-2 drilled a section of sediments in the extreme east part of the property.\u0026nbsp; The sediments in hole OR96-1 displayed moderate to strong pervasive and fracture-controlled silicification and feldspathization as well as local disseminations of molybdenum.\u0026nbsp; In addition the unit displayed up to 3% quartz-eyes, weak pervasive sericite alteration and are associated with a zone of intense fracturing and brecciation.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e\u003cspan lang=\"EN-GB\" style=\"mso-bidi-font-size: 12.0pt; line-height: 107%; mso-ascii-font-family: Calibri; mso-hansi-font-family: Calibri; mso-bidi-font-family: Calibri; mso-ansi-language: EN-GB;\"\u003eDrill hole OR96-2 was drilled 550m west-south-west of OR96-1 and was designed as a stratigraphic hole to test the \"felsic\" horizon as well as an IP chargeability anomaly located along strike of the northern-most IP conductor tested in OR96-1.\u0026nbsp; The hole collared in fine grained, well laminated, biotite-rich sediments (argillite, siltstone).\u0026nbsp; Altered sediments with 5% disseminated pyrrhotite +/- Pyrite (similar to those intersected in OR96-1) were cored.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e\u003cspan lang=\"EN-GB\" style=\"mso-bidi-font-size: 12.0pt; line-height: 107%; mso-ascii-font-family: Calibri; mso-hansi-font-family: Calibri; mso-bidi-font-family: Calibri; mso-ansi-language: EN-GB;\"\u003eBoth holes were drilled south of the mafic volcanic unit of interest.\u003c/span\u003e\u003c/p\u003e\n\u003ch3 class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e\u003cspan lang=\"EN-GB\" style=\"mso-bidi-font-size: 12.0pt; line-height: 107%; mso-ascii-font-family: Calibri; mso-hansi-font-family: Calibri; mso-bidi-font-family: Calibri; mso-ansi-language: EN-GB;\"\u003eConclusions\u003c/span\u003e\u003c/h3\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt; mso-layout-grid-align: none; text-autospace: none;\"\u003e\u003cspan lang=\"EN-GB\" style=\"mso-bidi-font-size: 12.0pt; line-height: 107%; mso-ascii-font-family: Calibri; mso-hansi-font-family: Calibri; mso-bidi-font-family: Calibri; mso-ansi-language: EN-GB;\"\u003eThe gold float (16.2 g/t) found by M. Stares on the property suggests that the mafic volcanics which overlie the zinc-bearing, felsic horizon and underlie the Gowan Lake Pluton, may be enriched in gold.\u0026nbsp; Prospecting \u003c/span\u003e\u003cspan style=\"mso-bidi-font-size: 12.0pt; line-height: 107%; mso-ascii-font-family: Calibri; mso-hansi-font-family: Calibri; mso-bidi-font-family: Calibri;\"\u003eby Simoneau in 1993 in an area 150 meters north of the Zn, Pb, Ag Occurrence showed a brecciated intrusive texture at the contact with foliated mafic rocks and the Gowan Lake (monzonite) Pluton. \u003c/span\u003eVolcaniclastic metasediments along the margin of the Gowan Lake Pluton to the west also show signs of hydrothermal alteration, both visually and geochemically, and bear similarities to the metasediments which host the Hemlo deposit.\u0026nbsp; \u003cspan style=\"mso-bidi-font-size: 12.0pt; line-height: 107%; mso-ascii-font-family: Calibri; mso-hansi-font-family: Calibri; mso-bidi-font-family: Calibri;\"\u003eThis may be a widespread feature and could be significant.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt; mso-layout-grid-align: none; text-autospace: none;\"\u003eTwo electromagnetic conductors exist northeast (up ice) of the high-grade gold float (OGS Map M60036/37).\u0026nbsp; The first EM conductor lies 600 meters northeast of the float sample and appears to have an East-West strike length of 500 meters.\u0026nbsp; The second EM conductor lies 250 meters north of the first and shows a similar East-West strike of 400 meters.\u0026nbsp; These two conductors lie very close to the monzonite/volcanic contact.\u0026nbsp; The contact between the monzonite and underlying mafic volcanic unit has never been mapped in detail.\u0026nbsp; The area surrounding the two conductors should be mapped and sampled in detail in an effort to locate the source of the gold float.\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e\u003cspan lang=\"EN-GB\" style=\"mso-bidi-font-size: 12.0pt; line-height: 107%; mso-ascii-font-family: Calibri; mso-hansi-font-family: Calibri; mso-bidi-font-family: Calibri; mso-ansi-language: EN-GB;\"\u003eThe Valley Lake property covers 2 kilometers of \u003c/span\u003efavourable geology along the Gowan Lake Pluton and Mafic Volcanic contact.\u0026nbsp; The property has the potential to host a potentially economic gold deposit.\u003c/p\u003e","visible":true,"locationRefId":"287678ac-8d7b-48ea-b0d8-7e8f80957b0a","created":{"$date":"2015-03-27T21:29:00.000Z"},"__v":0}
{"_id":"d46c1617-a8c7-46f7-a368-1ba83ab4a503","name":"Santoy Mountain","safeName":"santoy-mountain","description":"A quartz stockwork in strongly altered granite-monzonite porphyry contains up to 46.9 g/t Au, 422 g/t Ag and 5.4% Cu beside the Santoy Lake property.  Additionally, a float sample assaying an astounding 66% zinc has been located in the vicinity of Little Santoy Lake.","body":"\u003ch3\u003eIntroduction\u003c/h3\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003eThe Santoy Mountain property consists of two claims (15 units) in Syine Township of the Thunder Bay Mining Division.\u0026nbsp; The property is situated approximately 20 km east of Terrace Bay, Ontario and lies east of Jackfish Bay, Lake Superior.\u0026nbsp; The claims may be accessed by the Trans-Canada highway, which cuts through the western part of the property.\u0026nbsp; A well-kept gravel road that leads to Santoy Lake provides access to the eastern part of the property.\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e\u003cspan lang=\"EN-GB\"\u003eThe property straddles a section of the easternmost Terrace Bay batholith/mafic volcanic contact.\u0026nbsp; This contact has numerous gold zones associated with it, the most notable being the Empress Gold Mine, a former producer, discovered in 1895.\u0026nbsp; Other past producing mines exist on the western end of the batholith/volcanic contact near the town of Schreiber.\u0026nbsp; Gold showings lie within both the felsic stock and the adjacent volcanic rocks.\u003c/span\u003e\u003c/p\u003e\n\u003ch3 class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003ePrevious Work\u003c/h3\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003eGold was first discovered in the Jackfish Lake area in 1875 when Mr. D. McKellar found visible gold in a quartz vein at Victoria Cape. Subsequent activity in the area resulted in the discovery of the Empress Mine north of Jackfish Lake in 1895 and the Ursa Major Mine 3 km north of the Empress.\u0026nbsp; There is also mention of a gold occurrence south of Jackfish Station (old Jackfish town site) just south of the granite/volcanic contact (Schreiber-Duck Lake Area, ODM volume 30, part 4, 1921).\u0026nbsp; In the late 1950's, 1960's, and 1970's various companies reportedly carried out exploration for base metals.\u0026nbsp;\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003eIn 1983 the area became staked again due to the discovery of the Hemlo deposit.\u0026nbsp; Highmark Resources and MacMillan Energy formed a joint venture to explore ground that makes up the current property.\u0026nbsp; The joint venture performed geochemical, geological and geophysical surveys.\u0026nbsp; Some astonishingly high soil anomalies coincident with VLF and IP conductors were uncovered, but remarkably, they were never drilled.\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003eIn 1993, Brian Fowler acquired the property and performed prospecting and sampling.\u0026nbsp; He took three samples, one of which returned 62.2 g/t silver (assay report dated Aug. 25\u003csup\u003eth\u003c/sup\u003e, 1993, sample #93-43) from an area about 100 meters west of the Santoy Mountain Occurrence.\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003eIn 1995, Rudy Wahl prospected the same area as Fowler, and collected several samples, the best of which assayed anomalous zinc and nickel (4,360 ppm Zn, 484 ppm Ni).\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt; tab-stops: 36.0pt 72.0pt 108.0pt 144.0pt 180.0pt 216.0pt 252.0pt 288.0pt 324.0pt 360.0pt 396.0pt 432.0pt;\"\u003eIn 2009, Fowler returned to the area to cut a single 975m grid line striking approximately 334\u0026deg; from the access road alongside Little Santoy Lake north to the Santoy Mountain Occurrence.\u0026nbsp; A magnetic and VLF EM survey was performed by Larder Geophysics using a GSM-19 v7 Overhauser magnetometer.\u003c/p\u003e\n\u003ch3 class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003eGeology\u003c/h3\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003eThe property is located within the Schreiber-Hemlo greenstone belt and represents a portion of the Abitibi-Wawa subprovince of the Superior province. This subprovince is an east-west trending metavolcanic - metasedimentary supracrustal sequence which has been intruded by granitic/syenitic plutons and gabbroic dikes and sills.\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003eThe geology of the property consists mainly of mafic volcanic rock which is most commonly massive to pillowed (tops south) with minor foliated, lineated equivalents. To the north, this greenstone belt is bounded by massive hornblende-(biotite) granodiorite and granite, quartz monzonite.\u0026nbsp; Highmark reported that Irregular lenses of intermediate to felsic volcanics are present in three separate zones. These are associated with mineralization.\u0026nbsp; Two areas are also underlain by bedded chert, argillite and greywacke. These rocks also contain sulfide mineralization.\u0026nbsp; Other rocks in the area include minor lapilli tuff, schist, breccia and various compositions of dykes.\u0026nbsp; The rocks generally strike N70\u0026deg;E.\u003c/p\u003e\n\u003ch3 class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003eMineralization\u003c/h3\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt; tab-stops: 36.0pt 72.0pt 108.0pt 144.0pt 180.0pt 216.0pt 252.0pt 288.0pt 324.0pt 360.0pt 396.0pt 432.0pt;\"\u003eThe intermediate to felsic volcanics present in the northern part of the property are associated with narrow chert horizons containing massive pyrite mineralization.\u0026nbsp; A showing termed the \u0026ldquo;Santoy Mountain Occurrence\u0026rdquo; reportedly contains small amounts of copper and nickel and lies south of one of these cherty units.\u0026nbsp; A rock grab sample collected by Brian Fowler in 1993, one hundred metres west of the occurrence returned 62.2 g/t silver.\u0026nbsp; In 2009, Fowler collected an additional 11 samples across a 300-meter section of rocks straddling the Santoy Mountain Occurrence.\u0026nbsp; Between 600W and 650W of the grid, Fowler found sheared, rusty mafic volcanic rocks containing appreciable amounts (up to 30%) of pyrite and pyhrrotite.\u0026nbsp; He noted a sedimentary iron formation at the 690W grid coordinate, and more pyritiferous mafic volcanics at 800W and 900W.\u0026nbsp; One sample of mafic volcanic containing 20-30% pyrite and appreciable chlorite alteration returned 1040 ppm chromium.\u0026nbsp; Minor base metals were reported (271ppm Cu and 259ppm Zn).\u003c/p\u003e\n\u003ch3 class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003eConclusions\u003c/h3\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt; tab-stops: 36.0pt 72.0pt 108.0pt 144.0pt 180.0pt 216.0pt 252.0pt 288.0pt 324.0pt 360.0pt 396.0pt 432.0pt;\"\u003eThe Santoy Mountain occurrence, as well as the chert rich horizons in the vicinity of the occurrence require detailed mapping and sampling in light of the high nickel (323ppm) and zinc (823ppm) values from lake sediment in the small pond north of Little Santoy Lake.\u0026nbsp; The OGS sampling represents the highest nickel and third highest zinc assay in the survey area, from a total of 1,176 samples taken (Schreiber-Terrace Bay High Density Regional Lake Sediment and Water Survey, OFR 5964).\u0026nbsp;\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt; tab-stops: 36.0pt 72.0pt 108.0pt 144.0pt 180.0pt 216.0pt 252.0pt 288.0pt 324.0pt 360.0pt 396.0pt 432.0pt;\"\u003eHighmark\u0026rsquo;s 1983 soil survey (2,200 soil samples) uncovered three highly anomalous areas (Anomaly A, B and C) north of the pond that the OGS found high nickel and zinc values in.\u0026nbsp; Anomaly A lies within the northern portion of the Santoy Lake property, while anomalies B and C are immediately north of the property on adjacent ground owned by Renner and Richards.\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt; tab-stops: 36.0pt 72.0pt 108.0pt 144.0pt 180.0pt 216.0pt 252.0pt 288.0pt 324.0pt 360.0pt 396.0pt 432.0pt;\"\u003e\u003cstrong\u003eAnomaly A\u003c/strong\u003e - a 100 meter long by 125 meter wide anomaly from L11300E to L11400E between 10350N and 10475N.\u0026nbsp; The anomaly contains up to 920 ppm zinc, 479 ppm copper and 9,000 ppm lead in soil.\u0026nbsp; A moly showing reportedly occurs at the east end of the anomaly.\u0026nbsp; Highmark indicates a pit in this vicinity, so it is believed that the moly values came from this pit.\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt; tab-stops: 36.0pt 72.0pt 108.0pt 144.0pt 180.0pt 216.0pt 252.0pt 288.0pt 324.0pt 360.0pt 396.0pt 432.0pt;\"\u003e\u003cstrong\u003eAnomaly B\u003c/strong\u003e - a single line anomaly at L11200E at 10725N, containing a remarkably highly cobalt value of 5,000 ppm.\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt; tab-stops: 36.0pt 72.0pt 108.0pt 144.0pt 180.0pt 216.0pt 252.0pt 288.0pt 324.0pt 360.0pt 396.0pt 432.0pt;\"\u003e\u003cstrong\u003eAnomaly C\u003c/strong\u003e - a 100 meter long anomaly from L11300E to L11400E at 10625N contains up to 4.2 g/t silver in the soil.\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt; tab-stops: 36.0pt 72.0pt 108.0pt 144.0pt 180.0pt 216.0pt 252.0pt 288.0pt 324.0pt 360.0pt 396.0pt 432.0pt;\"\u003eTwo hundred meters to the west of the spectacular lead soil value (9,015 ppm) lies an outcrop of massive pyrite and chert.\u0026nbsp; The section of rocks between the mineralized chert outcrop and the high lead-in-soil ranks as a high priority target.\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003eAdding further fuel to the fire, are recent discoveries of high-grade gold, silver and base metals adjacent the property.\u0026nbsp; Prospecting by Wayne Richards immediately north of the Santoy Mountain property has uncovered a quartz stockwork in strongly altered granite-monzonite porphyry.\u0026nbsp; The quartz veins contain tourmaline, chlorite, hematite, olivine and carbonate alteration.\u0026nbsp; Assays range up to 46.9 g/t Au, 422 g/t Ag and 5.4% Cu.\u0026nbsp; Additionally, prospecting by Rudy Wahl, in the vicinity of Little Santoy Lake, uncovered a float sample that assayed an astounding 66% zinc.\u0026nbsp; The source for the float is suspected to be near the cherty iron formations in the northern portion of the Santoy Mountain property.\u0026nbsp;\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003eAs a result of these recent findings, the Santoy Mountain property has high potential for both gold and VMS discoveries.\u003c/p\u003e","visible":true,"locationRefId":"c5348daf-ee53-44ae-bfc6-2b3584d33ce5","created":{"$date":"2015-03-22T17:28:00.000Z"},"__v":0}
{"_id":"0525a31e-4402-4f84-9818-1423bbf971c3","name":"Dotted Lake","safeName":"dotted-lake","description":"Owned by Rouge Resources, this large property covers 9 kilometers of highly favourable geology that encompasses a significant high grade gold discovery.  The host rock is sheared granitoid rock with 5-10% pyrite, strong sericite and arsenopyrite.","body":"\u003ch3\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-ascii-theme-font: minor-latin; mso-hansi-theme-font: minor-latin; mso-bidi-font-family: Calibri; mso-bidi-theme-font: minor-latin;\"\u003eLocation\u003c/span\u003e\u003c/h3\u003e\n\u003cp class=\"Default\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-ascii-theme-font: minor-latin; mso-hansi-theme-font: minor-latin; mso-bidi-font-family: Calibri; mso-bidi-theme-font: minor-latin;\"\u003eRouge Resources Dotted Lake property lies just north of the world class 21 million ounce Hemlo gold deposit currently being mined by Barrick Gold Corp.\u0026nbsp; The property is located 45 km south of Manitouwadge and 20 km north of the Hemlo Gold Mines.\u0026nbsp; Drivable logging roads are within 1km of the property.\u003c/span\u003e\u003c/p\u003e\n\u003ch3\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-ascii-theme-font: minor-latin; mso-hansi-theme-font: minor-latin; mso-bidi-font-family: Calibri; mso-bidi-theme-font: minor-latin;\"\u003eGeology\u003c/span\u003e\u003c/h3\u003e\n\u003cp class=\"Default\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-ascii-theme-font: minor-latin; mso-hansi-theme-font: minor-latin; mso-bidi-font-family: Calibri; mso-bidi-theme-font: minor-latin;\"\u003eThe Dotted Lake property is chiefly underlain by mafic massive and pillowed volcanics and related subvolcanic phases. The mafic rocks are intruded by granitic and diabase intrusives. The diabases are north-south and northwest-southeast trending, with both orientations of dyke forming steep cliffs. \u0026nbsp;The eastern portion of the claims contain a mafic and ultramafic intrusive complex of peridotite and serpentinized peridotite intruded along the southern flank of the mafic volcanics.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"Default\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-ascii-theme-font: minor-latin; mso-hansi-theme-font: minor-latin; mso-bidi-font-family: Calibri; mso-bidi-theme-font: minor-latin;\"\u003eGranitic gneisses mark the north margin of the volcanic belt and extend north to the Manitouwadge area some 30 kilometers to the north.\u0026nbsp; The general metamorphic grade throughout the map area is upper greenschist to lower amphibolite, which is typical of the volcanics of the Heron Bay-Hemlo belt.\u003c/span\u003e\u003c/p\u003e\n\u003ch3\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-ascii-theme-font: minor-latin; mso-hansi-theme-font: minor-latin; mso-bidi-font-family: Calibri; mso-bidi-theme-font: minor-latin;\"\u003eMineralization\u003c/span\u003e\u003c/h3\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-ascii-theme-font: minor-latin; mso-hansi-theme-font: minor-latin; mso-bidi-font-family: Calibri; mso-bidi-theme-font: minor-latin; layout-grid-mode: both;\"\u003eThe Dotted Lake property covers a 9 kilometer strike length of highly-favourable rocks that host the \u003c/span\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-ascii-theme-font: minor-latin; mso-hansi-theme-font: minor-latin; mso-bidi-font-family: Calibri; mso-bidi-theme-font: minor-latin;\"\u003eFairservice zinc occurrence\u003c/span\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-ascii-theme-font: minor-latin; mso-hansi-theme-font: minor-latin; mso-bidi-font-family: Calibri; mso-bidi-theme-font: minor-latin; layout-grid-mode: both;\"\u003e.\u0026nbsp; \u003c/span\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-ascii-theme-font: minor-latin; mso-hansi-theme-font: minor-latin; mso-bidi-font-family: Calibri; mso-bidi-theme-font: minor-latin;\"\u003eGrab samples taken from the occurrence by previous operators have assayed up to 12% zinc and 2.18 g/t gold.\u0026nbsp; \u003c/span\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-ascii-theme-font: minor-latin; mso-hansi-theme-font: minor-latin; mso-bidi-font-family: Calibri; mso-bidi-theme-font: minor-latin; layout-grid-mode: both;\"\u003eThe occurrence \u003c/span\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-ascii-theme-font: minor-latin; mso-hansi-theme-font: minor-latin; mso-bidi-font-family: Calibri; mso-bidi-theme-font: minor-latin;\"\u003econsists of disseminated to semi-massive sphalerite, pyrite and magnetite in a zone up to 50 centimeters wide by 10 meters long within foliated hornblende amphibolite and banded garnet, biotite, chlorite and muscovite gneiss.\u0026nbsp; Such rocks may represent metamorphism of a small, distal volcanogenic, massive sulfide deposit similar to the past producing Geco Mine in Manitouwadge.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-ascii-theme-font: minor-latin; mso-hansi-theme-font: minor-latin; mso-bidi-font-family: Calibri; mso-bidi-theme-font: minor-latin;\"\u003eIn 2008, Rouge conducted a modest soil sampling program on the property and noted a\u003c/span\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-ascii-theme-font: minor-latin; mso-fareast-font-family: Calibri; mso-fareast-theme-font: minor-latin; mso-hansi-theme-font: minor-latin; mso-bidi-font-family: Calibri; mso-bidi-theme-font: minor-latin; layout-grid-mode: both;\"\u003enomalous zinc with coincident significant gold (up to .48 g/t Au) anomalies approximately 800 meters south of \u003c/span\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-ascii-theme-font: minor-latin; mso-hansi-theme-font: minor-latin; mso-bidi-font-family: Calibri; mso-bidi-theme-font: minor-latin; layout-grid-mode: both;\"\u003ethe \u003c/span\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-ascii-theme-font: minor-latin; mso-hansi-theme-font: minor-latin; mso-bidi-font-family: Calibri; mso-bidi-theme-font: minor-latin;\"\u003eFairservice zinc occurrence\u003c/span\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-ascii-theme-font: minor-latin; mso-fareast-font-family: Calibri; mso-fareast-theme-font: minor-latin; mso-hansi-theme-font: minor-latin; mso-bidi-font-family: Calibri; mso-bidi-theme-font: minor-latin; layout-grid-mode: both;\"\u003e.\u0026nbsp; Further work was recommended to expand on the anomaly.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-ascii-theme-font: minor-latin; mso-hansi-theme-font: minor-latin; mso-bidi-font-family: Calibri; mso-bidi-theme-font: minor-latin; layout-grid-mode: both;\"\u003eIn 2009, local prospectors \u003c/span\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-ascii-theme-font: minor-latin; mso-hansi-theme-font: minor-latin; mso-bidi-font-family: Calibri; mso-bidi-theme-font: minor-latin;\"\u003ereturned a value of 2.33 g/t gold in strongly sheared mafic volcanics with intense biotite alteration containing 3-5% pyrite on the Rouge Resources Lampson Lake Option.\u0026nbsp; The sample lies at the contact between mafic volcanics and sediments.\u0026nbsp; The footwall sediments are metamorphosed to sericite schist and contain narrow bands of biotite and 1% pyrite.\u0026nbsp; The gold sample lies along a shear which is a splay off a major NE trending fault that may play a major role in the mineralization at the Fairservice zinc occurrence.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-ascii-theme-font: minor-latin; mso-hansi-theme-font: minor-latin; mso-bidi-font-family: Calibri; mso-bidi-theme-font: minor-latin;\"\u003eIn 2009, Rouge conducted additional soil sampling in the area of the 2008 sampling and expanded upon the gold signature in the soils.\u0026nbsp; Some of the better results were:\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoListParagraphCxSpFirst\" style=\"text-indent: -18.0pt; mso-pagination: widow-orphan; mso-list: l1 level1 lfo1;\"\u003e\u003c!-- [if !supportLists]--\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: Symbol; mso-fareast-font-family: Symbol; mso-bidi-font-family: Symbol;\"\u003e\u0026middot;\u003cspan style=\"font-stretch: normal; font-size: 7pt; font-family: 'Times New Roman';\"\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; \u003c/span\u003e\u003c/span\u003e\u003c!--[endif]--\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-ascii-theme-font: minor-latin; mso-hansi-theme-font: minor-latin; mso-bidi-font-family: Calibri; mso-bidi-theme-font: minor-latin;\"\u003e09-1-01 - 484 ppb Au (590797E, 5416951N)\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoListParagraphCxSpMiddle\" style=\"text-indent: -18.0pt; mso-pagination: widow-orphan; mso-list: l1 level1 lfo1;\"\u003e\u003c!-- [if !supportLists]--\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: Symbol; mso-fareast-font-family: Symbol; mso-bidi-font-family: Symbol;\"\u003e\u0026middot;\u003cspan style=\"font-stretch: normal; font-size: 7pt; font-family: 'Times New Roman';\"\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; \u003c/span\u003e\u003c/span\u003e\u003c!--[endif]--\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-ascii-theme-font: minor-latin; mso-hansi-theme-font: minor-latin; mso-bidi-font-family: Calibri; mso-bidi-theme-font: minor-latin;\"\u003e09-1-03 - 144 ppb Au (590721E, 5417018N)\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoListParagraphCxSpMiddle\" style=\"text-indent: -18.0pt; mso-pagination: widow-orphan; mso-list: l1 level1 lfo1;\"\u003e\u003c!-- [if !supportLists]--\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: Symbol; mso-fareast-font-family: Symbol; mso-bidi-font-family: Symbol;\"\u003e\u0026middot;\u003cspan style=\"font-stretch: normal; font-size: 7pt; font-family: 'Times New Roman';\"\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; \u003c/span\u003e\u003c/span\u003e\u003c!--[endif]--\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-ascii-theme-font: minor-latin; mso-hansi-theme-font: minor-latin; mso-bidi-font-family: Calibri; mso-bidi-theme-font: minor-latin;\"\u003e09-3-29 - 234 ppb Au (590650E, 5416410N)\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoListParagraphCxSpLast\" style=\"text-indent: -18.0pt; mso-pagination: widow-orphan; mso-list: l1 level1 lfo1;\"\u003e\u003c!-- [if !supportLists]--\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: Symbol; mso-fareast-font-family: Symbol; mso-bidi-font-family: Symbol;\"\u003e\u0026middot;\u003cspan style=\"font-stretch: normal; font-size: 7pt; font-family: 'Times New Roman';\"\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; \u003c/span\u003e\u003c/span\u003e\u003c!--[endif]--\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-ascii-theme-font: minor-latin; mso-hansi-theme-font: minor-latin; mso-bidi-font-family: Calibri; mso-bidi-theme-font: minor-latin;\"\u003e09-4-41 - 1,200 ppm Zn (590579E, 5416197N)\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-ascii-theme-font: minor-latin; mso-hansi-theme-font: minor-latin; mso-bidi-font-family: Calibri; mso-bidi-theme-font: minor-latin;\"\u003eIn 2010, Rouge conducted a small trenching program in the vicinity of the high gold in soils.\u0026nbsp; High grade gold was discovered in bedrock exposed by the trenching.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoListParagraphCxSpFirst\" style=\"text-indent: -18.0pt; mso-pagination: widow-orphan; mso-list: l0 level1 lfo2;\"\u003e\u003c!-- [if !supportLists]--\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: Symbol; mso-fareast-font-family: Symbol; mso-bidi-font-family: Symbol;\"\u003e\u0026middot;\u003cspan style=\"font-stretch: normal; font-size: 7pt; font-family: 'Times New Roman';\"\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; \u003c/span\u003e\u003c/span\u003e\u003c!--[endif]--\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-ascii-theme-font: minor-latin; mso-hansi-theme-font: minor-latin; mso-bidi-font-family: Calibri; mso-bidi-theme-font: minor-latin;\"\u003eI920008 - 16.95 g/t Au (grab) in Trench 10-4\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoListParagraphCxSpMiddle\" style=\"text-indent: -18.0pt; mso-pagination: widow-orphan; mso-list: l0 level1 lfo2;\"\u003e\u003c!-- [if !supportLists]--\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: Symbol; mso-fareast-font-family: Symbol; mso-bidi-font-family: Symbol;\"\u003e\u0026middot;\u003cspan style=\"font-stretch: normal; font-size: 7pt; font-family: 'Times New Roman';\"\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; \u003c/span\u003e\u003c/span\u003e\u003c!--[endif]--\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-ascii-theme-font: minor-latin; mso-hansi-theme-font: minor-latin; mso-bidi-font-family: Calibri; mso-bidi-theme-font: minor-latin;\"\u003eI920009 - 686 ppb Au (grab) in Trench 10-4\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoListParagraphCxSpMiddle\" style=\"text-indent: -18.0pt; mso-pagination: widow-orphan; mso-list: l0 level1 lfo2;\"\u003e\u003c!-- [if !supportLists]--\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: Symbol; mso-fareast-font-family: Symbol; mso-bidi-font-family: Symbol;\"\u003e\u0026middot;\u003cspan style=\"font-stretch: normal; font-size: 7pt; font-family: 'Times New Roman';\"\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; \u003c/span\u003e\u003c/span\u003e\u003c!--[endif]--\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-ascii-theme-font: minor-latin; mso-hansi-theme-font: minor-latin; mso-bidi-font-family: Calibri; mso-bidi-theme-font: minor-latin;\"\u003eH073926 - 9.02 g/t Au over 0.4 m (channel) in Trench 10-4\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoListParagraphCxSpLast\" style=\"text-indent: -18.0pt; mso-pagination: widow-orphan; mso-list: l0 level1 lfo2;\"\u003e\u003c!-- [if !supportLists]--\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: Symbol; mso-fareast-font-family: Symbol; mso-bidi-font-family: Symbol;\"\u003e\u0026middot;\u003cspan style=\"font-stretch: normal; font-size: 7pt; font-family: 'Times New Roman';\"\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; \u003c/span\u003e\u003c/span\u003e\u003c!--[endif]--\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-ascii-theme-font: minor-latin; mso-hansi-theme-font: minor-latin; mso-bidi-font-family: Calibri; mso-bidi-theme-font: minor-latin;\"\u003eH073934 - 1.14 g/t Au over 1.0 m (channel) in Trench 10-4\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-ascii-theme-font: minor-latin; mso-hansi-theme-font: minor-latin; mso-bidi-font-family: Calibri; mso-bidi-theme-font: minor-latin;\"\u003eThis high-grade gold zone consists of sheared granitoid rock with 5-10% pyrite, strong sericite and a trace of arsenopyrite.\u003c/span\u003e\u003c/p\u003e\n\u003ch3\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-ascii-theme-font: minor-latin; mso-hansi-theme-font: minor-latin; mso-bidi-font-family: Calibri; mso-bidi-theme-font: minor-latin;\"\u003eSummary\u003c/span\u003e\u003c/h3\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-ascii-theme-font: minor-latin; mso-hansi-theme-font: minor-latin; mso-bidi-font-family: Calibri; mso-bidi-theme-font: minor-latin;\"\u003eThere are two high priority targets that exist within the Dotted Lake property.\u0026nbsp; Most notably, is the high grade gold (16.95 g/t Au) found in bedrock during the 2010 trenching program.\u0026nbsp; This relatively new discovery has never been drilled and shows great promise.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-ascii-theme-font: minor-latin; mso-hansi-theme-font: minor-latin; mso-bidi-font-family: Calibri; mso-bidi-theme-font: minor-latin;\"\u003eA second high priority target exists within the property for a significant VMS deposit.\u0026nbsp; The magnetic pattern of the rocks within the property boundary suggest that this may be the northern limb of a large folded structure similar to the one at Manitouwadge.\u0026nbsp; An isolated anomaly, annular in shape, under Lampson Lake suggests it is a possible synvolcanic mafic intrusive and would be a heat source for base metal development.\u0026nbsp; An \u003c/span\u003e\u003cspan lang=\"EN-GB\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-ascii-theme-font: minor-latin; mso-hansi-theme-font: minor-latin; mso-bidi-font-family: Calibri; mso-bidi-theme-font: minor-latin; mso-ansi-language: EN-GB;\"\u003eextremely high copper value (985 ppm) in the lake sediment of Lampson Lake \u003c/span\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-ascii-theme-font: minor-latin; mso-hansi-theme-font: minor-latin; mso-bidi-font-family: Calibri; mso-bidi-theme-font: minor-latin;\"\u003e(OGS Open File Report 5968) exists on the Lampson Lake Option\u003c/span\u003e\u003cspan lang=\"EN-GB\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-ascii-theme-font: minor-latin; mso-hansi-theme-font: minor-latin; mso-bidi-font-family: Calibri; mso-bidi-theme-font: minor-latin; mso-ansi-language: EN-GB;\"\u003e.\u0026nbsp; \u003c/span\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-ascii-theme-font: minor-latin; mso-hansi-theme-font: minor-latin; mso-bidi-font-family: Calibri; mso-bidi-theme-font: minor-latin;\"\u003eThis may indicate a bedrock source of copper mineralization under, or along the lake edge.\u0026nbsp; It represents the second highest copper value within the Government funded survey.\u0026nbsp; The highest copper value in the survey area is at Bamoos Lake; now the site of Marathon PGM Corp\u0026rsquo;s 90 million tonne PGE, Cu, Ag and Au deposit outside the town of Marathon.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-ascii-theme-font: minor-latin; mso-hansi-theme-font: minor-latin; mso-bidi-font-family: Calibri; mso-bidi-theme-font: minor-latin;\"\u003eFinally, a third target exists for potential PGE mineralization within the ultramafic intrusive complex of peridotite and serpentinized peridotite.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-ascii-theme-font: minor-latin; mso-hansi-theme-font: minor-latin; mso-bidi-font-family: Calibri; mso-bidi-theme-font: minor-latin;\"\u003eIn light of the recent high-grade gold discovery and the suggestive potential for both VMS and PGE mineralization, the Dotted Lake property is one of the most exciting grassroots plays in the Hemlo greenstone belt.\u003c/span\u003e\u003c/p\u003e","visible":true,"locationRefId":"287678ac-8d7b-48ea-b0d8-7e8f80957b0a","created":{"$date":"2015-05-18T17:53:00.000Z"},"__v":0}
{"_id":"9d0f6ea4-4959-4a84-b2a3-5aa130b258a3","name":"Bozema Lake","safeName":"bozema-lake","description":"The 154-unit Bozema Lake Property contains a potassium radiometric anomaly with sodium depletion, that extends for over 6 kilometers through the property. The alteration zone bears similarities, geologically and geochemically, to the Hemlo gold deposit some 100 kilometers to the east.","body":"\u003ch3 class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; line-height: 115%;\"\u003eLocation and Access\u003c/span\u003e\u003c/h3\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; line-height: 115%; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003eThe Bozema Lake property, comprising of 154 claim units, is approximately 225 kilometers northeast of Thunder Bay, Ontario.\u0026nbsp; The TransCanada highway, electrical power lines and the Canadian Pacific Railway lie immediately south of the property. The claims are located between the towns of Terrace Bay and Marathon which can provide all supplies and manpower needed for exploration and development. Marathon is situated on a deep water port on Lake Superior.\u003c/span\u003e\u003c/p\u003e\n\u003ch3 class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; line-height: 115%;\"\u003eRegional Geology\u003c/span\u003e\u003c/h3\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; line-height: 115%; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003eThe property lies within the Schreiber-Hemlo greenstone belt and represents a portion of the Abitibi-Wawa Subprovince of the Superior Province. The Abitibi-Wawa Subprovince is a supracrustal east-west trending metavolcanic-metasedimentary sequence which has been intrude by granite-syenitic plutons and metagabbroic dikes and sills. The belt hosts the Hemlo gold deposit approximately 100 kilometers to the east and the Winston Lake base metal mine 55 kilometers to the west.\u0026nbsp; The Schreiber portion of the belt is approximately 70 kilometers long and 25 kilometers wide. The western portion of the belt is composed of two limbs, separated by the Crossman Lake Batholith, which form an east-west trending anticline. The northern limb, the Big Duck Lake volcanic belt is approximately 35 kilometers long and 10 kilometers wide, while the southern limb is approximately 50 kilometers long and 10 kilometers wide. The property is situated in the southern limb of the belt.\u003c/span\u003e\u003c/p\u003e\n\u003ch3 class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; line-height: 115%;\"\u003eProperty Geology\u003c/span\u003e\u003c/h3\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; line-height: 115%; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003eThe geology of the property is characterized by east trending, intermediate to felsic pyroclastics, flows and tuffs, bounded to the south by metabasalts and granite to the north. Much of the property was mapped at reconnaissance scale during the spring and summer of 1996 (Clark, 1996; Needham, 1996). These mapping programs explored a potassium radiometric anomaly brought to attention by Shevchenco, Placer Dome Canada (1996). The anomaly is approximately 6 kilometers long and up to 1 kilometer wide and is characterized by whole rock geochemical data revealing an alteration zone exhibiting two dominant patterns - extensive sodium depletion, accompanied by silica and potassium enrichment, and sodium enrichment coupled with silica enrichment and potassium depletion.\u003c/span\u003e\u003c/p\u003e\n\u003ch3 class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; line-height: 115%;\"\u003ePrevious Work\u003c/span\u003e\u003c/h3\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; line-height: 115%; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003eThe exploration records for the property contained within the Resident Geologist Assessment files housed in Thunder Bay indicate that exploration has been sporadically completed since 1896. Gold exploration in the area dates back to the late 1900's when the Empress Mine (Syine Township) and Fire Mountain (Tuuri Township) were located. Previous exploration work completed on and near the Bozema Lake property is as follows.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; line-height: 115%; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003e1955: Noranda Mines Ltd. completed a ground electromagnetic survey on a claim block covering Spider Lake within the present claims.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; line-height: 115%; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003e1963: Roman Corp. completed a ground horizontal loop electromagnetic survey on a claim block covering Spider Lake within the present claim block.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; line-height: 115%; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003e1981: Gulf Minerals drilled four holes in the Bozema Lake area.\u0026nbsp; One of the drill holes (81-33-2-1) intersected 10 meters of 8.6 % Zn, including 4.7 m @16.9 % Zn.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; line-height: 115%; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003e1988: Noranda Exploration Company Ltd. completed a mapping and lithogeochemistry program over a claim block south of Spider Lake. The survey outlined a sodium depletion zone.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; line-height: 115%; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003e1994: Echo Bay Mines Ltd. completed a geological recon program on the property. A total of 477 samples were taken and analyzed for gold. The work was completed on traverses accessed by helicopter or roads.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; line-height: 115%; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003e1995: Clark-Eveleigh Consulting completed a four day prospecting program on the property.\u0026nbsp; A total of 7 samples were taken for assay.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; line-height: 115%; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003e2002: RJK Minerals drilled two \u003c/span\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; line-height: 115%; mso-fareast-font-family: Calibri; mso-bidi-font-family: Calibri;\"\u003ediamond drill holes \u003c/span\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; line-height: 115%; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003e(\u003c/span\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; line-height: 115%; mso-fareast-font-family: Calibri; mso-bidi-font-family: Calibri;\"\u003eS02-2 and 3\u003c/span\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; line-height: 115%; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003e) highlighting\u003c/span\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; line-height: 115%; mso-fareast-font-family: Calibri; mso-bidi-font-family: Calibri;\"\u003e that the Na and Ca \u003c/span\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; line-height: 115%; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003ein the core was \u003c/span\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; line-height: 115%; mso-fareast-font-family: Calibri; mso-bidi-font-family: Calibri;\"\u003ealmost totally depleted, indicat\u003c/span\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; line-height: 115%; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003eing a strong alteration system.\u0026nbsp; \u003c/span\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; line-height: 115%; mso-fareast-font-family: Calibri; mso-bidi-font-family: Calibri;\"\u003eThe Zn/Pb ratios \u003c/span\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; line-height: 115%; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003eencountered were \u003c/span\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; line-height: 115%; mso-fareast-font-family: Calibri; mso-bidi-font-family: Calibri;\"\u003esimilar to those of the Geco deposit located to the northeast and are typical of many VMS deposits in pyroclastic terrains. Silver and gold \u003c/span\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; line-height: 115%; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003ewas also \u003c/span\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; line-height: 115%; mso-fareast-font-family: Calibri; mso-bidi-font-family: Calibri;\"\u003estrongly correlated more strongly with Cu than with Zn or Pb. This also is typical of higher temperature VMS systems and indicate\u003c/span\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; line-height: 115%; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003ed\u003c/span\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; line-height: 115%; mso-fareast-font-family: Calibri; mso-bidi-font-family: Calibri;\"\u003e that the area drilled is in a classic VMS setting\u003c/span\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; line-height: 115%; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003e.\u0026nbsp; The better of the two holes, S0-2, intersected 0.6 meters of 4.2% Zn, 0.46% Cu, 0.27% Pb and 48.1 g/t Ag; and 0.4 meters of 5.0% Zn, 0.16% Cu, 0.28% Pb and 18.1 g/t Ag.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; line-height: 115%; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003e2005: Phoenix Matachewan Mines completed e\u003c/span\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; line-height: 115%; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-fareast-font-family: Calibri; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003eleven drill holes totalling 1,683 metres \u003c/span\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; line-height: 115%; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003etargeting two of eleven\u003c/span\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; line-height: 115%; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-fareast-font-family: Calibri; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003e highly prospective combined geophysical and geochemical targets identified on the property\u003c/span\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; line-height: 115%; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003e.\u0026nbsp; Analytical results returned very anomalous, widespread zinc mineralization, peaking at 7% Zn over 1.2 metres (at 121 metres down hole) in DDH PS0507 in an extensive zone of strongly zinc mineralized rock that averaged 0.58 per cent Zn over 39 metres.\u0026nbsp; In addition, surface geochemical sampling results returned up to 23.5% zinc and 3.1% copper in outcrops.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; line-height: 115%; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003e2006: Phoenix Matachewan Mines contracted Geotech Limited to fly a helicopter-borne time domain electromagnetic geophysical survey over the Steel River Property. Condor Consulting Inc of Lakewood, Colorado was then contracted to process and analyze the VTEM data in order to assist in identifying and prioritizing possible VMS-style drill targets.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; line-height: 115%; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003e2007-2008: Phoenix Matachewan Mines completed a 28-hole, 3000m drill program on their Steel River property. The program was designed as a follow up to a 2005 drilling program, with collar locations in large part being chosen based on additional information obtained since the completion of the previous program. This work included a helicopter-borne EM survey flown by Geotech Limited, additional mapping by Blackburn Geological Services, and a small amount of stripping on grid 1W \u0026ndash; all completed in 2006.\u0026nbsp; Work focused on the same two primary targets as were drilled in 2005.\u0026nbsp; The first target area, located on PMM\u0026rsquo;s grid 3, is an area of approximately 1.63km by 0.77km which covers Bozema Lake.\u0026nbsp; The second target area, PMM\u0026rsquo;s grid 1W, is an area of approximately 1.97km by 1.90km, west of the Prairie River. \u0026nbsp;Zinc assays from the 2005 drill program peaked at 7.0% over 0.6m (DDH PS0507 at 120m depth). \u0026nbsp;Results from the 2007-2008 program included a best intersection of 11.09% Zn over 3.75m (DDH BZW-08-05).\u003c/span\u003e\u003c/p\u003e\n\u003ch3 class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; line-height: 115%;\"\u003eConclusions\u003c/span\u003e\u003c/h3\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; line-height: 115%; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003eThe property is underlain by a package of intermediate to felsic metavolcanics, intruded by a quartz feldspar porphyry, which has been traced for 3 kilometers along strike.\u0026nbsp; A potassium radiometric anomaly with sodium depletion, extends for over 6 kilometers through the property. The alteration zone bears similarities, geologically and geochemically, to the Hemlo gold deposit some 100 kilometers to the east (Shevchenco, Placer Dome, 1996).\u0026nbsp; The property hosts a package of intermediate to felsic metavolcanics which is up to 3 kilometers thick. The presence of course felsic fragments suggests a proximity to a felsic volcanic center.\u0026nbsp; The presence of a major quartz feldspar porphyry, itself sodium depleted, adds to the interpretation of the proximity of a volcanic center.\u0026nbsp; The zone of alteration is widespread and characterized by sodium depletion, potassium and silica enrichment, as well as zones of potassium depletion and sodium enrichment or depletion.\u0026nbsp; Sericite is a common alteration product locally occupying 15% of rock volume.\u0026nbsp; Many felsic rocks contain blue quartz eyes suggesting metasomatic silica.\u0026nbsp; Whole rock geochemical data indicates the strongest alteration, in terms of sodium depletion and silica enrichment is spatially associated with the boundaries of the quartz feldspar porphyry. This zone also hosts a relative abundance of felsic agglomerate. These factors would suggest that the quartz feldspar porphyry represents a focal point of hydrothermal alteration and mineralization.\u0026nbsp; In addition, there are a number of EM conductors associated with the northern contact of the quartz feldspar. These conductors are coincident with the zone of strong sodium depletion and silica enrichment.\u0026nbsp; These features make the Bozema Lake property an attractive exploration target.\u003c/span\u003e\u003c/p\u003e","visible":true,"locationRefId":"c5348daf-ee53-44ae-bfc6-2b3584d33ce5","created":{"$date":"2015-07-05T13:56:00.000Z"},"__v":0}
{"_id":"00fb6136-1d29-43c4-9679-fc90c2e75433","name":"Rushing River","safeName":"rushing-river","description":"The 39-unit Rushing River property is host to six gold occurrences, including four shafts (Medicine Ledge, Master Jack, Sunrise and Golden Gate North).  The lateral and vertical continuity of the known gold-bearing structures on the property should be tested.","body":"\u003ch3\u003eLocation and Access\u003c/h3\u003e\n\u003cp\u003eThe property is located 20 kilometers southeast of the town of Kenora, Ontario. Road access to the property from Kenora is eastward via Highway 17 (Trans-Canada Highway) to the Storm Bay road approximately 12 kilometers east of Kenora, then south along the partly paved, partly gravelled Storm Bay road for 12 kilometers. A relatively new road (Blindfold Lake Road) which can be described as a graded, gravelled bush road branches from the east side of the Storm Bay road through the south-central part of the property. \u0026nbsp;This road is suitable for automobiles travelling at slow speed.\u003c/p\u003e\n\u003cp\u003eBedrock topography is typical of that of most of the southern part of the Canadian Shield. Bedrock relief is seldom more than one hundred and fifty feet with rounded knobby hills. The bedrock is commonly covered by sand, silt, gravel, or clay but bedrock outcrops in many places and much of the overburden is only a few feet deep. Much of the area in the south-east part of the property has been cleared by recent lumbering operations. \u0026nbsp;Elsewhere, the claims are timbered except for low areas which consist of swamps or small lakes.\u003c/p\u003e\n\u003ch3\u003ePrevious Activity\u003c/h3\u003e\n\u003cp\u003eThe Lake of the Woods Gold Rush occurred between 1886 and 1906. \u0026nbsp;A large number of gold discoveries were made and 13 properties were brought into production accounting for 75% of the gold produced in the Kenora-Fort Frances District. \u0026nbsp;By 1912 almost all activities had ceased. \u0026nbsp;During the period 1934-1943 a second major period of activity in the area. \u0026nbsp;Activity in the claim area is as follows:\u003c/p\u003e\n\u003cp\u003e\u0026bull; 1885-1899 - Several companies were involved in mining in this early period.\u003c/p\u003e\n\u003cp\u003e\u0026bull; 1934 - Johnson-Nilson Group \u0026ndash; prospecting\u003c/p\u003e\n\u003cp\u003e\u0026bull; 1936 - Blindfold Mining Group - trenching, stripping and sampling. \u0026nbsp;Golden Gate Shaft dewatered and sampled.\u003c/p\u003e\n\u003cp\u003e\u0026bull; 1983 - George Zebruck and Ted Hansen - prospecting and sampling\u003c/p\u003e\n\u003cp\u003e\u0026bull; 1983-1984 - Bonzano Exploration - geophysical and geological surveys\u003c/p\u003e\n\u003cp\u003e\u0026bull; 1985-1986 - Kidd Creek Mines - airborne geophysical and geological surveys\u003c/p\u003e\n\u003cp\u003e\u0026bull; 1987 - Core Exploration - property evaluation, geological survey\u003c/p\u003e\n\u003cp\u003e\u0026bull; 1988-1990 - George Zebruck - sampling, assays and drilling\u003c/p\u003e\n\u003ch3\u003eAdjacent Mine Activity\u003c/h3\u003e\n\u003cp\u003eAt the Black Jack Prospect, a bulk sample of 50 tons was shipped in 1893, producing 16.5 ounces of gold, for a grade of 0.33 oz Au/ton. \u0026nbsp;Underground development continued until 1899. \u0026nbsp;The nearby Gold Hill Mine was developed in 1885 and between 1886 and 1893, produced 220 tons yielding 1,089 oz gold for a grade of 4.95 oz Au/ton. \u0026nbsp;Work continued at the Gold Hill Mine until 1899 when the mill burned down. \u0026nbsp;Except for one drill hole, which reportedly cut the \"Pebble\" vein at a depth of 350 feet, and one which cut the \"Black Jack\" vein at a vertical depth of 300 feet, no systematic drilling of what is now the Gold Hill-Black Jack Property has ever taken place.\u003c/p\u003e\n\u003ch3\u003eSignificant Area Production\u003c/h3\u003e\n\u003cp\u003eSix kilometers south-east of the Rushing River Property lies the past producing Wendigo Mine, which between 1900 and 1951 produced 67,423 ounces of gold, 14,762 ounces of silver, and 1,886,246 pounds of copper, making it the largest past producer in the Kenora - Fort Frances area. The old Sultana Mine lies eleven kilometers north-west of the Rushing River Property, which between 1894 and 1906, and in 1949, produced a total of 15,977 ounces of gold.\u003c/p\u003e\n\u003ch3\u003eGeology\u003c/h3\u003e\n\u003cp\u003eThe property is underlain by massive and pillowed basaltic flows with textures ranging from fine to medium grained. \u0026nbsp;The volcanic rocks are generally massive and weakly metamorphosed to the greenschist facies. \u0026nbsp;Mafic lavas and intrusions are intruded by the bi-lobed Dryberry granodiorite batholith. The contact of the basalt and the southwest portion of the northwest lobe of the batholith lies along the east boundary of the property. The Dryberry batholith is unique in the Kenora (Wabigoon) group of batholiths because it is much more magnetic than other batholiths in the geological sub-province. The Dryberry batholith has a magnetic level approximately 400 gammas higher than the usual relatively non-magnetic batholiths characteristic of the block. \u0026nbsp;All bedrock formations are Archean in age. \u0026nbsp;Numerous (44) gold deposits are related spatially to the western portion of the northwest lobe of the batholith. \u0026nbsp;Almost all of the deposits are within a mile of the basalt-batholith contact. \u0026nbsp;Thirty-four deposits are within the volcanic rocks and ten within the granodiorite.\u003c/p\u003e\n\u003ch3\u003eMineralization\u003c/h3\u003e\n\u003cp\u003eThe shear zones hosting the gold veins range from a few inches up to fifteen feet wide and have an anastomosing pattern. \u0026nbsp;Quartz veins are emplaced into the central portions of the shear zones pinching and swelling along strike. Shear directions appear to be sub-vertical suggesting that the veins may have greater vertical than horizontal dimensions. \u0026nbsp;Gold is almost entirely within the quartz veins. \u0026nbsp;The gold occurs as free grains or with chalcopyrite within the quartz veins. \u0026nbsp;Pyrite and pyrrhotite also occur in the quartz veins but do not appear to be correlated with the gold content.\u003c/p\u003e\n\u003ch3\u003eAdjacent Showings\u003c/h3\u003e\n\u003cp\u003eGolden Gate shaft Vein\u003c/p\u003e\n\u003cp\u003eThe vein consists of quartz in a vertical shear which strikes 100\u0026deg; degrees. Four channel samples sawn from the shaft trench, eastward from the shaft at one metre intervals, by Kidd Creek, showed gold assays ranging from O.476 oz. to 1.18 oz. per ton. The average grade and width of the four samples was 0.7l6 oz. per ton across two feet. \u0026nbsp;The shaft is on a steep hillside with access to the shaft by a trench.\u003c/p\u003e\n\u003cp\u003eGolden Gate #1 vein (Main trench)\u003c/p\u003e\n\u003cp\u003eThis vein is exposed in a deep trench which angles up a steep hillside. The vein strikes north-easterly and dips 50\u0026deg; to the northwest. Debris in the trench and the steep angle of the trench make accurate observation impossible. The vein is twenty inches wide. Eleven samples were reported by Kidd Creek. Five of the eleven samples assayed more than 1.5 oz, the highest being 8.31 oz per ton gold. \u0026nbsp;Four other samples were between 0.25 and 0.50 oz per ton gold.\u003c/p\u003e\n\u003ch3\u003eProperty Showings\u003c/h3\u003e\n\u003cp\u003eMedicine Ledge Shaft\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;The occurrence is located in the northern portion of the property north of the mouth of the Rushing River on the east side of Route Bay. An inclined shaft was sunk to a depth of at least 11.5 m around 1897. The area is underlain by massive, medium to coarse-grained granodiorite of the Dryberry Batholith. It occurs near the western edge of the batholith approximately 400 m east of the contact with west facing mafic flows. The vein occurs on the footwall of a narrow-east-dipping shear. The vein is described by Coleman (1898) as follows: \"A vein of white quartz with some pyrites is said to have been traced 1,800 feet (about 550 m) with a strike of about N10\u0026deg;W. Where work was being done it averaged about 6 feet wide, but narrowed to two or three feet at the bottom of the shaft, which was 38 feet deep at an incline of 45\u0026deg;. The hanging wall was well defined, but the footwall was somewhat broken up\". No assays are reported.\u003c/p\u003e\n\u003cp\u003eMaster Jack Shaft\u003c/p\u003e\n\u003cp\u003eThe Master Jack Shaft occurs in the central part of the property. In 1897, the Rat Portage Gold Mining Company sank a 33.5 m shaft with 36 m of lateral development. In 1934 the area was included in a claim group staked around the Golden Gate Prospect located just west of Hollow Lake by the Johnson-Nilson Group. This claim group was acquired by the Blindfold Mining Group in 1936. During this period some trenching, stripping and sampling was done.\u003c/p\u003e\n\u003cp\u003eThe area is underlain by fine-grained, west-facing, massive to pillowed mafic flows which have been intruded by medium-grained, weakly foliated, biotite granodiorite of the Dryberry Batholith. The intrusive contact trends northwesterly. The shaft lies in granodiorite about 400 m east of the contact. In the vicinity of the shaft a tectonic foliation strikes 055\u0026deg; and dips vertically. A quartz vein, about 1.5 m wide, is exposed on the north side of the shaft. The vein appears to lie within a north-northeast trending fracture dipping 75\u0026deg; east. Quartz is white to grey coloured and contains minor pyrite along irregular fine fractures. Coleman (1898) reports that the- vein strikes 020\u0026deg; and it was also exposed about 100 m south of the shaft over a width of 0.6 to 1.0 m (2 to 3 feet). \u0026nbsp;Core Exploration took assays from the Master Jack Shaft area in November 1987 which assayed up to 0.12 oz/t gold and 6.72 oz/ton silver (dump grab).\u003c/p\u003e\n\u003cp\u003eGolden Gate North\u003c/p\u003e\n\u003cp\u003eAbout 300 feet north of the Golden Gate shaft, lenses of quartz appear in an east-west sheared zone that dips 70\u0026deg;S. A pit 20 feet deep shows 3 feet of quartz at one end and chlorite schist at the other end. \u0026nbsp;A shaft is shown in this area on OGS map P2831. \u0026nbsp;No assays are reported.\u003c/p\u003e\n\u003cp\u003eHollow Lake Occurrence\u003c/p\u003e\n\u003cp\u003eAt the shore of Hollow Lake, a reported quartz vein, 18 inches wide, is exposed in a trench. The quartz is fairly well mineralized in places. \u0026nbsp;No assays are reported.\u003c/p\u003e\n\u003cp\u003eSunrise Shaft\u003c/p\u003e\n\u003cp\u003eCore Exploration\u0026rsquo;s work in 1987, shows a showing and shaft dubbed the Sunrise Showing. \u0026nbsp;A 10 foot wide vein was sampled and assayed up to 0.20 oz/t gold and 0.80 oz/t silver (sample #960).\u003c/p\u003e\n\u003cp\u003eMagnetic Showing\u003c/p\u003e\n\u003cp\u003eCore Exploration\u0026rsquo;s work in 1987 also uncovered an iron formation south of the Sunrise showing which they called the Magnetic Showing. \u0026nbsp;Sampling of the iron formation assayed as high as 0.62 oz/t silver (sample #8086).\u003c/p\u003e\n\u003ch3\u003eSummary\u003c/h3\u003e\n\u003cp\u003eGold deposits in the area occur in a cluster in close proximity to the contract of metavolcanics with the Dryberry Batholith, and appear to be related to fracture systems developed as a result of the intrusion of the batholith. \u0026nbsp;In fact, recent government research suggest that most, if not all of the gold showings in the northeast Lake of the Woods area are directly related to the intrusion of the Dryberry Batholith, and their proximity to it. \u0026nbsp;It seems likely the hydrothermal systems generated by regional metamorphism related to the intrusion of the Dryberry Batholith are responsible for the transport and deposition of gold. \u0026nbsp;The property covers in excess of 4 kilometers of this favourable contact.\u003c/p\u003e\n\u003ch3\u003eRecommendations\u003c/h3\u003e\n\u003cp\u003eThe lateral and vertical continuity of the known gold-bearing structures on the Rushing River property should be tested. \u0026nbsp;Systematic mapping of the entire property is a high priority to locate zones of intersection of major gold-bearing structures (i.e., veins and shears), and zones of secondary gold-bearing structures (i.e., vein and stringer systems). \u0026nbsp;An Induced Polarization survey would be useful for targeting sulphide-bearing zones. \u0026nbsp;Furthermore, it would be worthwhile to extract a number of bulk samples from the four shaft areas within the property (Medicine Ledge, Master Jack, Sunrise and Golden Gate North) to determine their overall grades and ore recovery.\u003c/p\u003e","visible":true,"locationRefId":"226e506a-1f40-49a6-98e0-1dc00c9b7447","created":{"$date":"2016-02-28T21:21:00.000Z"},"__v":0}
{"_id":"ae9b6058-d8e5-48de-8432-e1b97f04d926","name":"Scramble","safeName":"scramble","description":"The 8-unit Scramble property is immediately adjacent the Scramble Mine workings and will host the zone at depth and along strike.","body":"\u003ch3 class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e\u003cspan style=\"text-decoration: underline;\"\u003eLocation and Access\u003c/span\u003e\u003c/h3\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003eThe Scramble Property is located in Jaffray Township, within the City of Kenora, and about eight kilometers east of the downtown, business centre. Access to the Scramble Property is provided by the Jones Road off the Trans-Canada Highway or by the Homestake Road from downtown Kenora.\u0026nbsp; The property consists of one Crown mining claim totaling 8 units that encompass an area of 320 acres.\u0026nbsp; The adjacent property, owned by Abitibi- Consolidated, hosts the Scramble Mine Patents.\u003c/p\u003e\n\u003ch3 class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e\u003cspan style=\"text-decoration: underline;\"\u003eGeology\u003c/span\u003e\u003c/h3\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003eThe Scramble Property lies within the Archean Lake of the Woods greenstone belt of the Wabigoon Subprovince, Superior Province. Rocks of the greenstone belt range from volcanic basaltic flows to pyroclastic dacite and rhyolite, with associated clastic sediments, and granitic and other plutonic batholith-scale intrusions. During the Kenoran Orogeny the supracrustal rocks were tightly folded and metamorphosed to greenschist and amphibolite grade.\u0026nbsp; The property straddles a submarine basalt flow sequence within a promontory of the greenstone belt at its northeast edge that tapers towards the northeast. Minor felsic to intermediate tuffaceous rocks occur at the northwest corner of the Scramble Property and also within its southwestern part. Minor felsic dikes are both parallel and cross-cut the dominant north-easterly structural trend.\u003c/p\u003e\n\u003ch3 class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e\u003cspan style=\"text-decoration: underline;\"\u003eProperty Mineralization\u003c/span\u003e\u003c/h3\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"\u003eIn about 1896 the Electro Gold Mining and Milling Co., Ltd. sunk a shaft within the Scramble Property. \u0026nbsp;Medium-grained gabbroic rock has been noted in the shaft area, and a felsic sill striking north-easterly lies 10 m to the northwest of the shaft. On surface, there is no evidence of any particular structure or mineralized zone on which the shaft may have been sunk. It is speculated that because of the association of mineralization on the adjacent Scramble property with felsic sills, it is possible that the shaft was sunk in the mafic rock with the intention of cross-cutting to the nearby felsic sill.\u0026nbsp; Chip and grab samples taken in the shaft have returned assays of 0.7, 1.0 and 1.0 g gold per ton.\u0026nbsp; The shaft lies along strike and in the same 'time-line' volcanic suite of the Scramble Deposit.\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003eIn 1985 and 1986, two diamond drill holes were put down wholly within the present Scramble Property near the Electro Gold Shaft.\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"\u003e\u003cstrong\u003eHole #\u0026nbsp;\u0026nbsp; Year\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; Az\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; Dip\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; Depth (m)\u003c/strong\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"\u003eS-5\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; 1985\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; 135\u0026deg;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; -45\u0026deg;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; 148.43\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"\u003eS-42\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; 1986\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; 135\u0026deg;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; -45\u0026deg;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; 142.39\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"\u003eBoth holes intersected alternating sequences, predominantly of fine grained basalt and gabbroic mafic flow or subvolcanic rock, and felsic sills. Some sections were also logged as mafic and felsic tuff. Notably, the latter was suggested to be \u0026ldquo;exhalite\u0026rdquo; in one of the holes. Quartz-calcite-tourmaline veining, weak biotite alteration, disseminated pyrite and pyrrhotite rarely exceeding a few percent, are characteristic of the basalts.\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"\u003eDDH S-5 one section ran 735 ppb (0.7 g/tonne) gold over 1.3m within a 3m core length termed \u0026ldquo;exhalite\u0026rdquo;, all of which ran above trace amounts. Lower in the same hole, a section ran 560 ppb (0.6 g tonne) gold over 1.2m in a 3.4m core length of basalt with quartz-calcite veining.\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"\u003eDDH hole S-42 intersected a 3m wide breccia zone that was interpreted to be a fault and contained ~5% sulphides and trace amounts of gold.\u003c/p\u003e\n\u003ch3 class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e\u003cspan style=\"text-decoration: underline;\"\u003eScramble Mine Patents\u003c/span\u003e\u003c/h3\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003eWork to date has defined the 1.5 meter wide Scramble zone along a strike length of 700 meters and to a depth of 200 meters.\u0026nbsp; The zone strikes 45\u0026deg; east and dips 88\u0026deg; north.\u0026nbsp; Geophysics suggests the zone has a potential strike length of 2 km.\u0026nbsp; The geological model for the mineralization is a gold-bearing exhalite system (Timmins-Type Gold System).\u0026nbsp; Gold is concentrated in a north-easterly striking sheared zone in biotitized basalts rather than in conformable felsic dikes and cross cutting quartz veins within the zone.\u0026nbsp; Close-patterned diamond drilling, surface sampling and underground development work, all conducted in the 1980s by the joint venture partnership of Scramble Mining Ltd. and Madeleine Mines Ltd., led to commissioning of a study (Behre, Dolbear \u0026amp; Company Inc. 1989) that provided an estimate of proven, probable and possible reserves, for a total of 139,000 tons at a grade of 0.24 ounce (8.2 g) gold ton.\u003c/p\u003e\n\u003ch3 class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e\u003cspan style=\"text-decoration: underline;\"\u003eProperty Potential\u003c/span\u003e\u003c/h3\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003eGold mineralization of potential economic grade on the Scramble Zone has to date been amply demonstrated on the adjacent Scramble Mine patented lands, by underground sampling and diamond drilling.\u0026nbsp; Mineralization on the Scramble Mine patented lands is confined within a northeast trending shear zone within basalts. Coincident with the gold mineralization in the shear zone are linear magnetic anomalies and induced polarization (IP) responses. Any extension of the zone would extend onto the Scramble Property.\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003eIt is very significant that a drill hole contained wholly on the Scramble Property intersected a 3m section logged as \"exhalite\", within which a 1.3m section ran 0.7 g gold/tonne. The \"exhalite\" is very likely a southwest continuation of the Scramble shear zone in the basalt country rock.\u0026nbsp; Combined linear magnetic anomalies and IP responses coincident with the Scramble Zone on the Scramble patented ground extend at least 150m onto the Scramble Property, beyond which power lines have to date prevented interpretation of geophysical responses across a 400m interval. Linear magnetic anomalies and coincident IP responses beyond this interval may represent the continuation of the anomalies coincident with the Scramble Zone.\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003eOne section in one of only two drill holes in this latter area ran 0.5 g gold/tonne over 1 m in a 2.4m core length logged as \"felsic tuff'. This \"felsic tuff' may be the continuation of the Scramble shear zone projected beneath the power lines.\u0026nbsp; A suggested plunge of the axis of gold values to the southwest at a shallow angle expressed by contours of grade-thickness values in longitudinal section on the Scramble Zone may extend into the Scramble Property at depth.\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003eThe demonstrated association of gold concentration at the Scramble Mine with a linear magnetic high and coincident IP response strongly suggests that such geophysical associations are prime targets. Other parallel linear magnetic anomalies have been identified on the Scramble Property, but not yet been tested for IP response or otherwise tested for gold mineralization. \u0026nbsp;A north trending fault identified on the Scramble Property close to its east side may displace any continuation of the Scramble Zone.\u003c/p\u003e\n\u003ch3 class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e\u003cspan style=\"text-decoration: underline;\"\u003eConclusions\u003c/span\u003e\u003c/h3\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003eThe Scramble Mine Trend can be traced from the Grey Eagle Mine in the south-west to the Black Sturgeon Mine in the north-east.\u0026nbsp; This structure has very good potential to host a number of deposits along the full length of its strike.\u0026nbsp; The Scramble property is immediately adjacent the Scramble Mine workings and will host the zone at depth and along strike.\u0026nbsp; The area within the Scramble Claim has seen limited exploration and therefore shows good promise.\u003c/p\u003e","visible":true,"locationRefId":"226e506a-1f40-49a6-98e0-1dc00c9b7447","created":{"$date":"2015-09-13T17:33:00.000Z"},"__v":0}
{"_id":"cc04d1ff-d340-41e2-91ac-88287020ce71","name":"Big Duck Lake","safeName":"big-duck-lake","description":"The 27 claim unit Big Duck Lake property covers over 4 kilometers of highly favourable geology and contains a total of 20 gold and base metal occurrences.","body":"\u003ch3 class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"\u003e\u003cstrong\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003eLocation and Access\u003c/span\u003e\u003c/strong\u003e\u003c/h3\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003eThe Big Duck Lake property consists of 27 claim units and is located just east of the Winston Lake Mine. It lies within the Wawa-Shebandowan trend 100 kilometers from the famous Hemlo gold camp, the latter which has over the past 30 years produced over 25 million ounces of gold.\u0026nbsp; Access to the west end of the property is via the Winston Lake Road a distance 20 kilometers north of Hwy 17. Access to the east part of the property is made by driving north on the Aguasabon Road for a distance 30 km north of the town of Terrace Bay and then by quad trail to the north end of Big Duck Lake. \u0026nbsp;The Winston Lake deposit, seven kilometers to the west of the property, produced 2.68 million tonnes of 1.05% Cu, 12.05% Zn, 31.37g/t Ag and 1.07g/t Au between 1988 and 1998.\u003c/span\u003e\u003c/p\u003e\n\u003ch3 class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"\u003e\u003cstrong\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003eGeology\u003c/span\u003e\u003c/strong\u003e\u003c/h3\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003eThe Big Duck Lake property is situated within the Big Duck Lake greenstone belt which forms part of the Archean Abitibi-Wawa-Shebandowan sub-province.\u0026nbsp; The claims are underlain by a thick sequence mafic massive and pillowed flows, minor clastic sediments, and iron formation. Coarse grained synvolcanic gabbroic sills are found throughout the property. These sills are at times difficult to distinguish from coarser grained mafic flows. Felsic quartz-feldspar porphyritic rocks (QFP) intrude the above units.\u0026nbsp; The main QFP body, which is situated along the north shore of Big Duck Lake has an apparent strike length of 3.5 km and a width of 400m. Associated with the main QFP are numerous QP and QFP sills which are found throughout the property. A distinctive fragmental unit comprised primarily of QFP fragments with subordinate mafic fragments in a mafic biotite rich matrix is situated along the northern contact of the main QFP body and the mafic volcanics. The origin of this fragmental is controversial, and has been described as either a re-worked lapilli tuff, tectonic breccia or a hydrothermal breccia associated with the porphyry complex.\u0026nbsp; The stratigraphy strikes 250\u0026deg; to 270\u0026deg; and dips 65\u0026deg; to 85\u0026deg; to the north.\u0026nbsp; Stratigraphic tops have been interpreted to be to the north.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003eThe Big Duck Lake porphyry has been affected by four styles of alteration including sericitization, biotization, silicification and feldspathization. Disseminated pyrite is ubiquitous in all alteration styles. The heaviest concentration of pyrite (3-5 % on average) occurs within sericitically altered QFP adjacent to the fragmental unit.\u0026nbsp; The presence of these fragmental rocks and associated porphyry, occurrence of mineralization in the fragmental unit north of the porphyry biotite alteration, and associated Mo-Ba-Cu geochemistry of the gold mineralization are all characteristics shared by Big Duck Lake mineralization and the mineralized zones at Hemlo.\u003cbr /\u003e \u003c!--[endif]--\u003e\u003c/span\u003e\u003c/p\u003e\n\u003ch3 class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"\u003e\u003cstrong\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003eRecent Work\u003c/span\u003e\u003c/strong\u003e\u003c/h3\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003eQuadro Resources completed a diamond drill program on the property in 2006, which consisted of 17 diamond drill holes totaling approx 3,500 meters. The drilling program intercepted Au mineralization in most drill holes, typically associated with low grade Cu mineralization (0.1-0.2% Cu), and anomalous Mo and Zn concentrations in pyrite-pyrrhotite bearing shear zone intervals within mafic volcanic rocks and deformed porphyry lenses (Feb 22, 2007 news release).\u0026nbsp; The drill holes were widely distributed over an approximate 3.5 km strike length along the Big Duck Lake shear zone system, and areas between and below the broader intercepts remain prospective, as well as extensions of geophysical targets which occur over known extensions and branches of the mineralized shear zones. The low grade, but broad intercepts may reflect up dip or lateral projections of larger mineralized areas which could be host to mineralization of economic grades, as is demonstrated by the Coco-Estelle prospect.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003eQuadro allowed the claims to lapse in 2010 and the property was promptly staked by the Author.\u0026nbsp; The property was subsequently optioned to Clear Gold Resources, which performed Mag/VLF and prospecting over a 4.6 km long grid along the north end of Big Duck Lake in 2012 and 2013.\u0026nbsp; Numerous gold and base metal occurrences were located and assayed.\u0026nbsp; Clear Gold\u0026rsquo;s shares were suspended from trading in September 2014 and the Company relinquished the property in December 2015.\u0026nbsp; The Author quickly re-captured a portion of the lapsed property that holds the bulk of the most promising showings.\u003c/span\u003e\u003c/p\u003e\n\u003ch3 class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"\u003e\u003cstrong\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003eMineralization\u003c/span\u003e\u003c/strong\u003e\u003c/h3\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003eExploration for both gold and base metals in the Big Duck Lake area has been carried out intermittently since the discovery of a high grade zinc deposit (Zenith Mine) at Kenabec Lake in the late 1800's.\u0026nbsp; W.H. Collins passed through Big Duck Lake in 1905 during his exploration of the area for the Geological Survey of Canada.\u0026nbsp; His guide, Joe Fisher, returned to the area the following year to his hunting grounds and staked two claims with gold showings.\u0026nbsp; He sold the claims to T.K. Barnard, who later passed away.\u0026nbsp; Fisher then re-staked the claims and sold them to D. McCuaig of Schreiber in 1913 and the other to C. Sjolander and W. McKirdy of Nipigon in 1914.\u0026nbsp; The rich gold showings which came from these two claims resulted in 250 claims being staked there by the end of 1914.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003eThe majority of recent gold exploration in the Big Duck Lake area has focused on the Coco-Estelle Zone located west of Big Duck Lake, however, there are 20 gold and/or base metal occurrences within the property, many of which have seen little or no exploration.\u0026nbsp; A few of the more interesting showings on the property are discussed below:\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"\u003e\u003cspan style=\"text-decoration: underline;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003eFisher Showing\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003eThe showing has three 15 meter deep shafts.\u0026nbsp; The host rock is a massive mafic rock but 25 meters to the north is an intrusive quartz-porphyry. Most of the rubble from the shafts are massive mafic material although a few blocks of rusty vein material consisting of carbonate, quartz, actinolite, 1-2% pyrite and traces of hematite were found. A historical grab sample of carbonate vein material with 1-2% pyrite assayed 5.7 g/t Au.\u0026nbsp; Sampling of an area near the #1 shaft in 2013 uncovered assays up to 7.3 g/t gold, 63.0 g/t silver and 0.22% zinc.\u0026nbsp; This part of the property, from the Fisher showing to Zone E (mentioned below) is a very strong exploration target for future work.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"\u003e\u003cspan style=\"text-decoration: underline;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003eFisher South\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003eProspecting south of the Fisher showing located an old pit.\u0026nbsp; Sampling here uncovered values up to 2.4 g/t gold and 7.5 g/t silver.\u0026nbsp; This area is quite likely the southern part of a wider zone that encompasses the Fisher showing the the north.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"\u003e\u003cspan style=\"text-decoration: underline;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003eZone E\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003eA strongly mineralized zone, dubbed Zone E, was located between the Fisher and Sjolander-McKirdy deposits.\u0026nbsp; The 30 meter wide zone consists of intense shearing at the contact of a QFP and mafic volcanic.\u0026nbsp; The shearing is noted over 12 meters of volcanic rock and 18 meters of QFP with up to 15% disseminated pyrite in both rock types.\u0026nbsp; Assays returned values as high as 0.60 g/t gold and 3.6 g/t silver.\u0026nbsp; The zone lies 20 meters south of an intensely sheared QFP fragmental.\u0026nbsp; It appears this fragmental QFP strikes across the entire southern portion of the property, from the Fisher Showing in the west to the North Gold Zone in the east.\u0026nbsp; A similar fragmental unit in the area of the Nelson Pit on the adjacent patents has returned some very promising gold intercepts from previous drilling.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoListParagraphCxSpFirst\" style=\"margin-bottom: 0.0001pt; text-indent: -18pt;\"\u003e\u003c!-- [if !supportLists]--\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: Symbol; mso-fareast-font-family: Symbol; mso-bidi-font-family: Symbol;\"\u003e\u0026middot;\u003cspan style=\"font-stretch: normal; font-size: 7pt; font-family: 'Times New Roman';\"\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; \u003c/span\u003e\u003c/span\u003e\u003c!--[endif]--\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003e3.3 g/t Au over 3.2 meters within a larger zone grading 0.8 g/t Au over 24.7 meters\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoListParagraphCxSpMiddle\" style=\"margin-bottom: 0.0001pt; text-indent: -18pt;\"\u003e\u003c!-- [if !supportLists]--\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: Symbol; mso-fareast-font-family: Symbol; mso-bidi-font-family: Symbol; mso-bidi-font-style: italic;\"\u003e\u0026middot;\u003cspan style=\"font-stretch: normal; font-size: 7pt; font-family: 'Times New Roman';\"\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; \u003c/span\u003e\u003c/span\u003e\u003c!--[endif]--\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin; mso-bidi-font-style: italic;\"\u003e4.4 g/t Au over 5.5 meters\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoListParagraphCxSpLast\" style=\"margin-bottom: 0.0001pt; text-indent: -18pt;\"\u003e\u003c!-- [if !supportLists]--\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: Symbol; mso-fareast-font-family: Symbol; mso-bidi-font-family: Symbol; mso-bidi-font-style: italic;\"\u003e\u0026middot;\u003cspan style=\"font-stretch: normal; font-size: 7pt; font-family: 'Times New Roman';\"\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; \u003c/span\u003e\u003c/span\u003e\u003c!--[endif]--\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin; mso-bidi-font-style: italic;\"\u003e7.1 g/t Au over 3.2 meters\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin; mso-bidi-font-style: italic;\"\u003eThis \u003c/span\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003efragmental shows remarkable similarities to the rocks at the Hemlo Deposit, and as such, is considered a high priority target.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"\u003e\u003cspan style=\"text-decoration: underline;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin; mso-bidi-font-style: italic;\"\u003eNorth of Sjolander-McKirdy\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin; mso-bidi-font-style: italic;\"\u003eA shaft on old patent TB 2116 is shown on geological map 2023 north of the Sjolander-McKirdy deposit.\u0026nbsp; There is no information available to the person(s) who dug this shaft or of the mineralized zone the shaft was put down on.\u0026nbsp; Reconnaissance prospecting discovered an unknown pit while looking for the shaft.\u0026nbsp; Sampling of the pit assayed 0.42% zinc.\u0026nbsp; Further prospecting in this area is warranted to try and locate the old shaft.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"\u003e\u003cspan style=\"text-decoration: underline;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin; mso-bidi-font-style: italic;\"\u003eDalsland Occurrence\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11pt;\"\u003eThe Dalsland showing contains appreciable amounts of sphalerite over a width of 6 meters.\u0026nbsp; \u003c/span\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003eThe mineralization consists of traces of disseminated sphalerite in a bedded magnetite-rich chert. Thin (5 cm) garnetiferous beds and quartz-porphyritic tuffs are interbedded with this\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003eexhalite. This exhalite-sediment package is bounded to the north by a coarse-grained gabbro and to the south by a mafic flow.\u0026nbsp; At the Dalsland showing there is an enrichment of sphalerite in the cross-cutting actinolite-quartz veins.\u0026nbsp; \u003c/span\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11pt;\"\u003eA historical drill hole (Canabel Syndicate, 1958) drilled 10 cm of 40% sphalerite at a depth of 117 meters.\u0026nbsp; \u003c/span\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003eGrab samples taken from the showing by Falconbridge in 1984 contained 5.1% zinc and 4.4 g/t silver in a actinolite-quartz vein with disseminated sphalerite (TBS 1576) and 0.5% zinc in a bedded chert with trace disseminated sphalerite (TBS 521).\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003eRecent sampling of the occurrence has returned the following results:\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003e2012 sampling\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoListParagraphCxSpFirst\" style=\"margin-bottom: 0.0001pt; text-indent: -18pt;\"\u003e\u003c!-- [if !supportLists]--\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: Symbol; mso-fareast-font-family: Symbol; mso-bidi-font-family: Symbol;\"\u003e\u0026middot;\u003cspan style=\"font-stretch: normal; font-size: 7pt; font-family: 'Times New Roman';\"\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; \u003c/span\u003e\u003c/span\u003e\u003c!--[endif]--\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003eN54011 - 5.58% Zn, 18.1 g/t Ag, 0.48% Cu\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoListParagraphCxSpMiddle\" style=\"margin-bottom: 0.0001pt; text-indent: -18pt;\"\u003e\u003c!-- [if !supportLists]--\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: Symbol; mso-fareast-font-family: Symbol; mso-bidi-font-family: Symbol;\"\u003e\u0026middot;\u003cspan style=\"font-stretch: normal; font-size: 7pt; font-family: 'Times New Roman';\"\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; \u003c/span\u003e\u003c/span\u003e\u003c!--[endif]--\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003eN54013 - 4.27% Zn, 6.4 g/t Ag\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoListParagraphCxSpMiddle\" style=\"margin-bottom: 0.0001pt; text-indent: -18pt;\"\u003e\u003c!-- [if !supportLists]--\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: Symbol; mso-fareast-font-family: Symbol; mso-bidi-font-family: Symbol;\"\u003e\u0026middot;\u003cspan style=\"font-stretch: normal; font-size: 7pt; font-family: 'Times New Roman';\"\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; \u003c/span\u003e\u003c/span\u003e\u003c!--[endif]--\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003eN54014 - 2.85% Zn, 7.9 g/t Ag\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoListParagraphCxSpMiddle\" style=\"margin-bottom: 0.0001pt; text-indent: -18pt;\"\u003e\u003c!-- [if !supportLists]--\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: Symbol; mso-fareast-font-family: Symbol; mso-bidi-font-family: Symbol;\"\u003e\u0026middot;\u003cspan style=\"font-stretch: normal; font-size: 7pt; font-family: 'Times New Roman';\"\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; \u003c/span\u003e\u003c/span\u003e\u003c!--[endif]--\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003eN54015 - 21.6 g/t Ag, 0.37% Zn, 0.37% Cu\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoListParagraphCxSpLast\" style=\"margin-bottom: 0.0001pt; text-indent: -18pt;\"\u003e\u003c!-- [if !supportLists]--\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: Symbol; mso-fareast-font-family: Symbol; mso-bidi-font-family: Symbol;\"\u003e\u0026middot;\u003cspan style=\"font-stretch: normal; font-size: 7pt; font-family: 'Times New Roman';\"\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; \u003c/span\u003e\u003c/span\u003e\u003c!--[endif]--\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003eN54016 - 3.46% Zn, 3.4 g/t Ag\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003e2013 sampling\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoListParagraphCxSpFirst\" style=\"margin-bottom: 0.0001pt; text-indent: -18pt;\"\u003e\u003c!-- [if !supportLists]--\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: Symbol; mso-fareast-font-family: Symbol; mso-bidi-font-family: Symbol;\"\u003e\u0026middot;\u003cspan style=\"font-stretch: normal; font-size: 7pt; font-family: 'Times New Roman';\"\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; \u003c/span\u003e\u003c/span\u003e\u003c!--[endif]--\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003e237051 - 1.56 g/t Au, 12.0 g/t Ag\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoListParagraphCxSpMiddle\" style=\"margin-bottom: 0.0001pt; text-indent: -18pt;\"\u003e\u003c!-- [if !supportLists]--\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: Symbol; mso-fareast-font-family: Symbol; mso-bidi-font-family: Symbol;\"\u003e\u0026middot;\u003cspan style=\"font-stretch: normal; font-size: 7pt; font-family: 'Times New Roman';\"\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; \u003c/span\u003e\u003c/span\u003e\u003c!--[endif]--\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003e237052 - 10.0 g/t Ag, 0.48% Zn, 0.26% Cu\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoListParagraphCxSpLast\" style=\"margin-bottom: 0.0001pt; text-indent: -18pt;\"\u003e\u003c!-- [if !supportLists]--\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: Symbol; mso-fareast-font-family: Symbol; mso-bidi-font-family: Symbol;\"\u003e\u0026middot;\u003cspan style=\"font-stretch: normal; font-size: 7pt; font-family: 'Times New Roman';\"\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; \u003c/span\u003e\u003c/span\u003e\u003c!--[endif]--\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003e237053 - 0.98% Zn\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003eThe Dalsland showing and the immediate area is very under-explored and represents a strong target for future exploration for its zinc potential.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"\u003e\u003cspan style=\"text-decoration: underline;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003eMadson Showing\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11pt;\"\u003eThe Madson showing is a quartz-carbonate vei\u003c/span\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11pt;\"\u003en which has reported a 1.5 meter channel sample grading 3.7 g/t gold.\u0026nbsp; This vein, consisting of banded calcite, pyrite, sugary and glassy quartz, is reported to be similar to both the Sjolander-McKirdy and Fisher deposits.\u0026nbsp; The showing has not yet been relocated, but is suspected to be near L6+00W and 1+00N on the Clear Gold grid.\u0026nbsp; Three prominent VLF conductors lie in this area which require follow-up.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"\u003e\u003cspan style=\"text-decoration: underline;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11pt;\"\u003eMadson East\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11pt;\"\u003eWhile looking for the Madson showing, an unknown pit was located and sampled.\u0026nbsp; The sample ran 4.4 g/t silver and 0.41% zinc.\u0026nbsp; It is not clear if this zone represents an extension of the undiscovered Madson Occurrence or if it indicates a distinctly new mineralized horizon parallel to the Madson.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"\u003e\u003cspan style=\"text-decoration: underline;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003eNorth Gold Zone\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003eThe North Gold Zone is within a mafic tuff which is finely bedded. A rusty zone with 2 to 4% disseminated pyrite occurs at the contact with a quartz-eyed (3-5%) QFP sill. Although there is a cross-cutting quartz vein, the gold is concentrated in this tuff.\u0026nbsp; Historical grab samples of the mineralization have assayed 6.32 g/t gold.\u0026nbsp; The geological setting is similar to the Nelson Pit Area (which is 400 m to the west) except the mineralization here appears to be hosted by mafic volcanics that are north of the main QFP but are south of a smaller QFP dyke. On the compilation map of Lewis, values of 3.8 g/t gold over 1.3 meters and 7.7 g/t gold over 1.5 meters are shown beside drill holes from this zone.\u0026nbsp; Recent sampling in 2012 have returned 11.6 g/t gold and 9.5 g/t silver from this zone.\u0026nbsp; The North Gold Zone is considered to be one of the best gold targets on the property, and requires further follow up work.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"\u003e\u003cspan style=\"text-decoration: underline;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003eStewart Pit\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003eAt the Stewart Pit showing there is a 3 meter deep pit into the side of the hill. This pit exposes a 1.5 meter wide rusty siliceous tuff with 3% to 10% disseminated pyrite and traces of sphalerite.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003eThis mineralized zone, which trends 261\u0026deg; and dips 52\u0026deg; to the north, seems to be at the top of a stretched mafic pillow-pillow breccia sequence. The zone is overlain to the north by mafic pillows. Historic grab sampling of the mineralized tuff assayed 2350 ppm zinc and 281 ppb gold.\u0026nbsp; The showing was sampled during a property visit by Teck Corp in 2011 and assayed 1.23 g/t gold, 6.8 g/t silver and 0.33% zinc.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"\u003e\u003cspan style=\"text-decoration: underline;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003eGray Showing\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11pt;\"\u003eThe Gray showing occurs in a gossaned pillowed mafic flow containing quartz veining.\u0026nbsp; Previous sampling by MNDM geologists assayed up to 6.2 g/t gold.\u0026nbsp; Teck sampled this showing in 2011 which returned an assay of 0.44 g/t gold and 2.7 g/t silver.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"\u003e\u003cspan style=\"text-decoration: underline;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11pt;\"\u003eGray East\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11pt;\"\u003eDuring their 2011 property visit, Teck located a rusty zone along strike and east of the Gray showing.\u0026nbsp; The sample ran 0.29 g/t gold and 5.8 g/t silver.\u0026nbsp; It would appear that the Gray, Gray East and Sock showing on the eastern property boundary all line up as a continuous zone of mineralization.\u0026nbsp; Sampling along the eastern property boundary in 2012, just north of the Sock Showing, returned a value of 2.45 g/t gold and 2.1 g/t silver.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"\u003e\u003cspan style=\"text-decoration: underline;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003eTri-Gold Trench #12\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11pt;\"\u003eIn 2011, Teck located two separate mineralized zones in Tri-Gold trench #12.\u0026nbsp; The northern zone ran 0.52 g/t gold, 15.3 g/t silver and 0.42% copper, while the southern zone assayed 0.58 g/t gold and 4.0 g/t silver.\u0026nbsp; These zones may be associated with the Tour Pit occurrence to the east and the Harvey Point occurrence to the west.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"\u003e\u003cspan style=\"text-decoration: underline;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003eTour Pit\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003eLittle is known about the Tour Pit showing.\u0026nbsp; It is suspected to be near the extreme southeastern part of the property south of the Sock Occurrence adjacent patent 2314.\u0026nbsp; A pit may have been sunk in a QFP sill that strikes across this section of the property.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"\u003e\u003cspan style=\"text-decoration: underline;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003eHarvey Point Showing\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003eThe Harvey Point showing is located at the eastern end of Big Duck Lake. The showing consists of 4 trenches on the southern shore of the point. The host rock is a fine-grained massive mafic rock with QFP sills to the north and south of the showing. Pyrite occurs as disseminated and massive sulphides in a silicified and epidotized zone. Locally there is also hematite staining.\u0026nbsp; Historical sampling has returned 0.35 % copper and low values in gold.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"\u003e\u003cspan style=\"text-decoration: underline;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003eEast of Helin Shaft\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003eThe East of Helin Shaft lies on the north shore of Big Duck Lake where there is an old trench and shaft. The host rock is a QP but the material in the trench is so highly silicified that it is difficult to see any quartz phenocrysts. Disseminated pyrite (3-5% and locally 20%) and traces of chalcopyrite are associated with the alteration. The exposure in the area is quite poor and thus it was not possible to trace this zone along strike. Historical sampling has returned up to 0.62 g/t gold, 9.3 g/t silver and 0.07% copper.\u0026nbsp; The width of the silicified and pyritized zone is estimated to be at least 5 to 6 meters in the trench area.\u0026nbsp; Sampling in 2011 by Teck assayed 0.35 g/t gold, 3.5 g/t silver and 0.15% copper.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"\u003e\u003cspan style=\"text-decoration: underline;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003eTri-Gold Trench #9\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003eSampling in 2011 by Teck on Tri-Gold Trench #9 assayed 2.59 g/t gold and 6.8 g/t silver.\u0026nbsp; This mineralized zone appears to line up with the North Gold Zone.\u003c/span\u003e\u003c/p\u003e\n\u003ch3 class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"\u003e\u003cstrong\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003eConclusion\u003c/span\u003e\u003c/strong\u003e\u003c/h3\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003eThe Big Duck Lake property is host to gold mineralization that occurs along the contact between mafic volcanics and a quartz-feldspar porphyry intrusion.\u0026nbsp; To date, over 40 separate gold occurrences have been identified in the area, including 20 showings within our new property.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003eThe most notable occurrence in the area to date is the Coco-Estelle Zone, with a drill indicated resource of 53,700 tonnes grading 10.7 g/t Au.\u0026nbsp; This deposit is immediately south of our claims and is still held by Clear Gold Resources.\u0026nbsp; Gold mineralization is associated with disseminated Py (+/- Cpy, Sph) in zones of silicification, biotization and sericitization in the mafic volcanics, QFP and a distinctive fragmental unit located at or near the QFP-mafic volcanic contact.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003eThe mineralized setting has many similarities to the Hemlo deposit, including the association of gold mineralization with sericitic and potassically altered QFP, the presence of a distinctive mineralized fragmental unit at the QFP-mafic volcanic contact, and the presence of green mica, molybdenite and unconfirmed reports of barite associated with the altered QFP.\u0026nbsp; Given these similarities, a re-evaluation of the property with an emphasis on the potential of the Big Duck Lake porphyry as a gold bearing porphyry system is warranted.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt;\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin;\"\u003eIn addition, potentially significant base metal occurrences are also found on the property, the most notable being the Dalsland Zinc Occurrence.\u0026nbsp; Some of these may be analogous with one or other of the Zenith or Pick Lake deposits on Inmet's Winston Lake property adjacent to the west.\u003c/span\u003e\u003c/p\u003e","visible":true,"locationRefId":"c5348daf-ee53-44ae-bfc6-2b3584d33ce5","created":{"$date":"2016-01-03T18:07:00.000Z"},"__v":0}
{"_id":"5aa751f2-d8a6-4838-a596-b66559a70cee","name":"Schreiber-Pyramid","safeName":"schreiber-pyramid","description":"An 8-unit claim block containing three parallel iron formations which carry high-grade gold, silver, zinc and copper.","body":"\u003ch3 class=\"MsoNormal\"\u003e\u003cstrong\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif;\"\u003eLocation and Access\u003c/span\u003e\u003c/strong\u003e\u003c/h3\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif;\"\u003eThe Schreiber-Pyramid property consists of 8 claim units and is located in Priske Township, 4 km northeast of the town of Schreiber, Ontario.\u0026nbsp; Access is via 4-wheel-drive road north from the town to Big Duck Creek, and from there, via all-terrain vehicle to the property.\u003c/span\u003e\u003c/p\u003e\n\u003ch3 class=\"MsoNormal\"\u003e\u003cstrong\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif;\"\u003eGeology\u003c/span\u003e\u003c/strong\u003e\u003c/h3\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif;\"\u003eThe property lies in the east-west trending Schreiber-White River greenstone belt of the Archean Abitibi-Wawa-Shebandowan Subprovince of the Superior Province of the Canadian Shield.\u0026nbsp; In the Schreiber area the belt is composed of generally east-west trending, north-facing, mafic metavolcanics with minor metasediments and mafic intrusive rocks.\u0026nbsp; The area within the 8 claim units is underlain by mafic metavolcanics interrupted by two northwesterly trending bands of chert-magnetite iron formation and clastic mafic metasediments. Metavolcanics and metasediments are cut by coarse-grained gabbroic dikes and quartz and/or feldspar-phyric felsic dikes/sills.\u003c/span\u003e\u003c/p\u003e\n\u003ch3 class=\"MsoNormal\"\u003e\u003cstrong\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif;\"\u003ePrevious Work\u003c/span\u003e\u003c/strong\u003e\u003c/h3\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11pt; font-family: Calibri, sans-serif; background-image: initial; background-attachment: initial; background-size: initial; background-origin: initial; background-clip: initial; background-position: initial; background-repeat: initial;\"\u003e1934: Schreiber Pyramid Gold Mines Ltd. was incorporated, acquiring a 21 claim group.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11pt; font-family: Calibri, sans-serif; background-image: initial; background-attachment: initial; background-size: initial; background-origin: initial; background-clip: initial; background-position: initial; background-repeat: initial;\"\u003e1935: A small pilot mill was planned to treat reportedly high grade ore; camp buildings erected and a road built; No. 1 vein traced for 366 m with a number of visible gold showings. Other veins were located, stripped and trenched. The veins were bulk pit sampled and 1,700 kg of ore were tested.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11pt; font-family: Calibri, sans-serif; background-image: initial; background-attachment: initial; background-size: initial; background-origin: initial; background-clip: initial; background-position: initial; background-repeat: initial;\"\u003e1936: Stripping, trenching, diamond drilling performed; numerous buildings constructed; 5 ton bulk sampling mill erected and a 32 V electrical plant installed. At the end of the year, an adit was begun.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11pt; font-family: Calibri, sans-serif; background-image: initial; background-attachment: initial; background-size: initial; background-origin: initial; background-clip: initial; background-position: initial; background-repeat: initial;\"\u003e1937: An adit was driven into the No. 1 Vein. Kenecho Gold Mines took over in the summer. Three mineralized zones discovered in the southeast part of the property.\u0026nbsp; \u003c/span\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-bidi-font-family: Arial; mso-fareast-language: EN-CA;\"\u003eA total of 150 tons of ore was milled on site from the #1 Vein at an average grade of 17.6 g/t gold.\u0026nbsp; \u003c/span\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11pt; font-family: Calibri, sans-serif; background-image: initial; background-attachment: initial; background-size: initial; background-origin: initial; background-clip: initial; background-position: initial; background-repeat: initial;\"\u003eOperations were suspended in Nov. 1938.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11pt; font-family: Calibri, sans-serif; background-image: initial; background-attachment: initial; background-size: initial; background-origin: initial; background-clip: initial; background-position: initial; background-repeat: initial;\"\u003e1969: Zenmac Metal Mines Ltd. drilled 5 holes totalling 243 meters.\u0026nbsp; \u003c/span\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-bidi-font-family: Arial; mso-fareast-language: EN-CA;\"\u003eBest results are reported from a base metal showing located to the north of the Schreiber-Pyramid #1 Vein adit returning 4.6% Copper and 19.2% Zinc over 0.55 metres from the #2 Vein hosted within a chloritic shear zone.\u0026nbsp; \u003c/span\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif;\"\u003eThe massive sulphides (po-py-cp-sph) intersected in the hole are hosted in a sheared mafic volcanic and are stratigraphically above a chert horizon exposed 25m to the east. It seems probable the base metals have been remobilized from the cherty metasediments during the emplacement of a coarse-grained gabbro which is in direct contact with the metasediments.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11pt; font-family: Calibri, sans-serif; background-image: initial; background-attachment: initial; background-size: initial; background-origin: initial; background-clip: initial; background-position: initial; background-repeat: initial;\"\u003e1985: Falconbridge Copper conducted HEM, VLF-EM, and mag surveys. Geological mapping, stripping, lithogeochemical surveys and sampling followed.\u0026nbsp; \u003c/span\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif;\"\u003eA one-foot chip sample of the rusty zone assayed 13.77% Zn and grab samples of massive sulphides yielded up to 31.0% Zn, 0.23% Cu and 0.74% Pb. Additionally, a\u003c/span\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-bidi-font-family: Arial; mso-fareast-language: EN-CA;\"\u003e grab sample from the #1 Vein located above the adit entrance assayed 45.2 g/t gold.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11pt; font-family: Calibri, sans-serif; background-image: initial; background-attachment: initial; background-size: initial; background-origin: initial; background-clip: initial; background-position: initial; background-repeat: initial;\"\u003eResident Geologist personnel visited the site on three occasions (August of 1985, July 1, 1987, and August 5, 1992). Assay results ranged up to 0.92 oz/ton Au (10 inch chip sample) from the No. 1 vein. Assay results ranged up to 22.9% zinc, 17.5% copper and 4.47 oz/ton silver from a sulphide rich zone in the No. 2 Vein.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11pt; font-family: Calibri, sans-serif; background-image: initial; background-attachment: initial; background-size: initial; background-origin: initial; background-clip: initial; background-position: initial; background-repeat: initial;\"\u003e1989: \u003c/span\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif;\"\u003ePlacer Dome conducted stripping and rock sampling on part of the Schreiber-Pyramid fault\u003cspan style=\"background-image: initial; background-attachment: initial; background-size: initial; background-origin: initial; background-clip: initial; background-position: initial; background-repeat: initial;\"\u003e in the area of the No. 6 Vein.\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11pt; font-family: Calibri, sans-serif; background-image: initial; background-attachment: initial; background-size: initial; background-origin: initial; background-clip: initial; background-position: initial; background-repeat: initial;\"\u003e1992: Tim Twomey conducted prospecting, stripping and sampling in the area as part of an OPAP grant. The property was also investigated for small scale mining potential.\u0026nbsp; \u003c/span\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-bidi-font-family: Arial; mso-fareast-language: EN-CA;\"\u003eTwomey discovered a 4 metre wide iron formation that returned a high of 0.156 oz/ton gold and a quartz vein located immediately to the east along a hydro right of way that assayed 0.337 oz/ton gold.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11pt; font-family: Calibri, sans-serif; background-image: initial; background-attachment: initial; background-size: initial; background-origin: initial; background-clip: initial; background-position: initial; background-repeat: initial;\"\u003e1995: The property was optioned by Twomey to RJK Explorations Ltd.\u0026nbsp; It is not known what work RJK did, if any.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11pt; font-family: Calibri, sans-serif; background-image: initial; background-attachment: initial; background-size: initial; background-origin: initial; background-clip: initial; background-position: initial; background-repeat: initial;\"\u003e1999: The property was staked and sampled by Brian Fowler under an OPAP Grant. Fowler received assays as high as 14.6% zinc, 19.6 g/t silver and 0.456 g/t gold from \u003c/span\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif;\"\u003estrong sphalerite mineralization within a narrow zone of intensely sheared mafic volcanics (Vein #2).\u0026nbsp; Fowler noted a strong linament heading east from the showing suggesting the shear zone continued in an easterly direction.\u0026nbsp; He recommended further prospecting along the easterly strike for a potential widening of the shear and additional mineralization.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif;\"\u003e2015: Fowler re-stakes the property due to a recent high grade gold discovery on his adjoining property to the north.\u003c/span\u003e\u003c/p\u003e\n\u003ch3 class=\"MsoNormal\"\u003e\u003cstrong\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11pt; font-family: Calibri, sans-serif; background-image: initial; background-attachment: initial; background-size: initial; background-origin: initial; background-clip: initial; background-position: initial; background-repeat: initial;\"\u003eProperty Mineralization\u003c/span\u003e\u003c/strong\u003e\u003c/h3\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cstrong\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11pt; font-family: Calibri, sans-serif; background-image: initial; background-attachment: initial; background-size: initial; background-origin: initial; background-clip: initial; background-position: initial; background-repeat: initial;\"\u003eVein #1\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11pt; font-family: Calibri, sans-serif; background-image: initial; background-attachment: initial; background-size: initial; background-origin: initial; background-clip: initial; background-position: initial; background-repeat: initial;\"\u003eThe #1 vein is exposed in two pits about 1,000 feet (300 m) apart. In both these pits the quartz vein contains pyrite, chalcopyrite and numerous showings of native gold. The vein is just under a foot in width, strikes N5\u0026deg;W and dips 50\u0026deg; to 55\u0026deg; W. It cuts across basic Keewatin flows to the south west of a mass of amphibolite, which outcrops in a band striking northwest. Although the two vein exposures are a considerable distance apart, they are believed to be the same structure because of their alignment, their attitude, and the fact that the vein in each exposure occurs on the east contact of a lamprophyre dike 2 feet (0.61 m) wide. \u0026nbsp;\u0026nbsp;Twomey sampled Vein #1 for small scale mining purposes and outlined the following ore in situ:\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoListParagraphCxSpFirst\" style=\"margin-bottom: .0001pt; mso-add-space: auto; text-indent: -18.0pt; mso-list: l0 level1 lfo1;\"\u003e\u003c!-- [if !supportLists]--\u003e\u003cspan style=\"font-family: Symbol;\"\u003e\u0026middot;\u003cspan style=\"font-stretch: normal; font-size: 7pt; font-family: 'Times New Roman';\"\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; \u003c/span\u003e\u003c/span\u003e\u003c!--[endif]--\u003e\u003cspan style=\"background-image: initial; background-attachment: initial; background-size: initial; background-origin: initial; background-clip: initial; background-position: initial; background-repeat: initial;\"\u003eVein #1: 40 tonnes grading 1.01 ounce/ton\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoListParagraphCxSpMiddle\" style=\"margin-bottom: .0001pt; mso-add-space: auto; text-indent: -18.0pt; mso-list: l0 level1 lfo1;\"\u003e\u003c!-- [if !supportLists]--\u003e\u003cspan style=\"font-family: Symbol;\"\u003e\u0026middot;\u003cspan style=\"font-stretch: normal; font-size: 7pt; font-family: 'Times New Roman';\"\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; \u003c/span\u003e\u003c/span\u003e\u003c!--[endif]--\u003e\u003cspan style=\"background-image: initial; background-attachment: initial; background-size: initial; background-origin: initial; background-clip: initial; background-position: initial; background-repeat: initial;\"\u003eVein #1 South: 52 tonnes grading 0.58 ounce/ton\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoListParagraphCxSpLast\" style=\"margin-bottom: .0001pt; mso-add-space: auto; text-indent: -18.0pt; mso-list: l0 level1 lfo1;\"\u003e\u003c!-- [if !supportLists]--\u003e\u003cspan style=\"font-family: Symbol; mso-fareast-font-family: Symbol; mso-bidi-font-family: Symbol; mso-fareast-language: EN-CA;\"\u003e\u0026middot;\u003cspan style=\"font-stretch: normal; font-size: 7pt; font-family: 'Times New Roman';\"\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp; \u003c/span\u003e\u003c/span\u003e\u003c!--[endif]--\u003e\u003cspan style=\"background-image: initial; background-attachment: initial; background-size: initial; background-origin: initial; background-clip: initial; background-position: initial; background-repeat: initial;\"\u003eOre Bin: 15 tonnes grading 0.35 ounce/ton\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cstrong\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11pt; font-family: Calibri, sans-serif; background-image: initial; background-attachment: initial; background-size: initial; background-origin: initial; background-clip: initial; background-position: initial; background-repeat: initial;\"\u003eVein #2\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11pt; font-family: Calibri, sans-serif; background-image: initial; background-attachment: initial; background-size: initial; background-origin: initial; background-clip: initial; background-position: initial; background-repeat: initial;\"\u003eThe #2 vein is exposed about 500 feet (152 m) north east of the northerly exposure of No. 1 vein. It is 25 cm wide, strikes roughly N45\u0026deg;W and dips 45\u0026deg;NE. It is crossed by veinlets of calcite containing galena and sphalerite. Stripping has indicated a length of 250 feet (76 m). The vein occurs in andesite pillow lava on the north side of the amphibolite mentioned above. Between the amphibolite and the andesite there is a shear zone dipping 80\u0026deg;N which appear to have been developed along a narrow band of sediments. Trenching along this shear zone immediately south of the vein has disclosed mineralization 5 to 6 feet (1.5 to 1.8 m) wide consisting of massive bands of pyrite, pyrrhotite, chalcopyrite and sphalerite. It is reported that a considerable amount of native gold has been removed from the rusty outcrop in this shear zone. This vein (No. 2) was open cut to a depth of about 40 feet (12.2 m) for a distance of 50 feet (15.2 m). On surface the vein appeared strong, and good values were reported. At depth, however, the vein pinched out and work was suspended. Following this development, underground investigation of the No. 1 Vein was undertaken.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cstrong\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11pt; font-family: Calibri, sans-serif; background-image: initial; background-attachment: initial; background-size: initial; background-origin: initial; background-clip: initial; background-position: initial; background-repeat: initial;\"\u003eVein #4\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11pt; font-family: Calibri, sans-serif; background-image: initial; background-attachment: initial; background-size: initial; background-origin: initial; background-clip: initial; background-position: initial; background-repeat: initial;\"\u003eThe #4 vein has not been well documented.\u0026nbsp; It was trenched in the 1930's and re-sampled by Twomey in 1992.\u0026nbsp; An assay of 0.03 ounce/ton gold was returned.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cstrong\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-bidi-font-family: Arial; mso-fareast-language: EN-CA;\"\u003ePowerline Occurrence (Tim Twomey)\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11pt; font-family: Calibri, sans-serif; background-image: initial; background-attachment: initial; background-size: initial; background-origin: initial; background-clip: initial; background-position: initial; background-repeat: initial;\"\u003eTwomey discovered gold in 1992 while prospecting under OPAP grant assistance.\u0026nbsp; Schneiders (OGS Resident Geologist, 1993) described the Powerline occurrence as quartz veins associated with felsic intrusive dikes within mafic metavolcanic rocks. A quartz vein strikes 106\u0026deg; and dips 70\u0026deg;SW and has been traced for over 200 m along the power line. The vein averages 20 to 25 cm in width and displays a crack seal texture. The quartz vein occurs in contact with a pink hornblende syenite dike, which is commonly on the footwall contact of the vein. Several syenite dikes were observed in the area, up to 1 m in width. The quartz vein and syenite dikes are hosted by sheared and deformed pillowed mafic metavolcanic rocks. Extensional, sigmoidal, quartz filled gash veins are present within the metavolcanic host rocks. In one section, the main mineralized quartz vein displays a 20X flexure in strike. On the eastern end of the showing, approximately 300 m east of the main mineralized quartz vein, several narrow, mineralized quartz filled gash veins are exposed within syenite dikes.\u0026nbsp; A grab sample collected by the Resident Geologist's Program returned 0.337 oz/ton Au from the central section of the crack-seal quartz vein that contained minor pyrite and tourmaline.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cstrong\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11pt; font-family: Calibri, sans-serif; background-image: initial; background-attachment: initial; background-size: initial; background-origin: initial; background-clip: initial; background-position: initial; background-repeat: initial;\"\u003eIron Formation Occurrence (Tim Twomey)\u003c/span\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-bidi-font-family: Arial; mso-fareast-language: EN-CA;\"\u003eTwomey discovered a gold occurrence in iron formation that returned a high of 0.156 oz/ton gold.\u0026nbsp; The iron formation is hosted by fine-grained, pelitic, metasedimentary rocks or mudstone, as well as greywacke and minor conglomerate.\u0026nbsp; The iron formation is 3-4 meters in width and strikes 290\u0026deg; to 320\u0026deg; and dips 55\u0026deg; northeast.\u0026nbsp; Mafic intrusive rocks, mainly gabbro, intrude the metasedimentary rocks.\u0026nbsp; Gold mineralization is associated with secondary sulphides in crosscutting fractures within the iron formation, as well as sulphide replacements of the chert and magnetite layers.\u0026nbsp; Semi-massive pyrite is present over widths of up to 5 cm in association with cross fractures and replaced layers.\u0026nbsp; Pyrite preferentially replaces the chert layers in a \u0026ldquo;brick-work\u0026rdquo; type fashion.\u0026nbsp; The cross fractures strike 100\u0026deg; and are commonly associated with areas of jaspilitic iron formation.\u003c/span\u003e\u003c/p\u003e\n\u003ch3\u003e\u003cstrong\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-bidi-font-family: Arial; mso-fareast-language: EN-CA;\"\u003eSummary\u003c/span\u003e\u003c/strong\u003e\u003c/h3\u003e\n\u003cp class=\"MsoNormal\"\u003e\u003cspan lang=\"EN-US\" style=\"font-size: 11.0pt; font-family: 'Calibri',sans-serif; mso-bidi-font-family: Arial; mso-fareast-language: EN-CA;\"\u003eThe Schreiber Pyramid property contains a number of high grade precious and base metal occurrences.\u0026nbsp; The area has seen renewed interest in light of a significant discovery of high grade gold (53.7 g/t) on the adjacent claims.\u0026nbsp; There are multiple stacked iron formations throughout this area and within the property boundary that host potential discoveries of high-grade ore resources.\u0026nbsp; The iron formation labelled \u0026lsquo;Vein 2\u0026rsquo; should be a high priority for exploration for a VMS deposit seated at depth.\u003c/span\u003e\u003c/p\u003e","visible":true,"locationRefId":"c5348daf-ee53-44ae-bfc6-2b3584d33ce5","created":{"$date":"2015-05-09T18:01:00.000Z"},"__v":0}
