{"_id":"287678ac-8d7b-48ea-b0d8-7e8f80957b0a","name":"Hemlo","safeName":"hemlo","body":"\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003eHemlo...\u0026nbsp;The largest single orebody of gold in Canada, and one of the largest on the North American continent.\u0026nbsp; To date, there has been just one orebody located in the Schreiber-Hemlo greenstone belt.\u0026nbsp; Considering the discovery of the orebody was in 1981, and the lack of exploration since, this belt is literally a virgin greenstone belt.\u0026nbsp; It would be extremely unlikely that the Hemlo deposit is the only deposit in the belt, when similar belts, such as Kirkland Lake, Red Lake, and Timmins are host to dozens of orebodies.\u0026nbsp; \u003cspan style=\"color: #010101; background-image: initial; background-attachment: initial; background-size: initial; background-origin: initial; background-clip: initial; background-position: initial; background-repeat: initial;\"\u003eThe Hemlo Deposit has produced over 25 million ounces of gold to date.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e\u003cspan style=\"color: #010101; background-image: initial; background-attachment: initial; background-size: initial; background-origin: initial; background-clip: initial; background-position: initial; background-repeat: initial;\"\u003eGold was first discovered in the Hemlo area in 1981, leading to a claim staking and exploration rush in the early 1980\u0026prime;s. Drilling along a mineralized zone developed into three mining operations (Barrick\u0026rsquo;s David Bell, Golden Giant, and Williams mines) defining a large continuous deposit now known as the Hemlo Deposit.\u003cspan class=\"apple-converted-space\"\u003e\u0026nbsp; \u003c/span\u003eThe deposit is located in a major high-strain zone; the Lake Superior Shear Zone. The deposit extends over a strike length of 2.5 km and plunges to the west. It is hosted by sedimentary rocks and massive and fragmental, felsic volcanic (porphyritic) rocks of the Moose Lake Volcanic Complex.\u0026nbsp; Failure to adequately recognize the regional plunge control of mineralization in the Hemlo District has frustrated previous explorers. This mineralization plunge eventually led to the discovery of the Hemlo Deposit. Much more is known about the belt and the mineralization than was available to the rash of exploration undertaken in the decade after Hemlo was discovered in 1981. It is now understood that 90% of the deposit lies below 500m.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e\u003cspan style=\"color: #010101; background-image: initial; background-attachment: initial; background-size: initial; background-origin: initial; background-clip: initial; background-position: initial; background-repeat: initial;\"\u003eIn Archean greenstone belts throughout the world, there is a well-documented spatial and genetic link between gold deposits and porphyry intrusions.\u0026nbsp; Of significance are porphyritic intrusions associated with these gold-bearing rocks along what is now known as the \u0026ldquo;North Limb\u0026rdquo;. These intrusions exhibit similarities to the footwall rocks of gold mineralization at Hemlo Mines, termed the Moose Lake Porphyry.\u0026nbsp; Several historical diamond drill holes from these porphyries have contained significant gold values.\u0026nbsp; One drill hole ranged from 1.0 g/t to 28.0 g/t (3.9 g/t over 3 meters) and another drill hole intercept assayed 37.35 g/t Au over 1.0 m in a Hemlo \u0026ldquo;look-alike\u0026rdquo; porphyry with favorable alteration (Ontario Geological Survey, Map 2614).\u0026nbsp; \u0026nbsp;Limited drilling and trenching has taken place targeting these occurrences.\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e\u003cspan style=\"color: #010101; background-image: initial; background-attachment: initial; background-size: initial; background-origin: initial; background-clip: initial; background-position: initial; background-repeat: initial;\"\u003eI believe that after thirty three years (1982-2015) of exploring the Hemlo belt, I have uncovered the best geology and mineralization for another Hemlo discovery.\u0026nbsp; Compared to other well-known greenstone belts in the region, this area has remained relatively under-explored.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e\u003cspan style=\"color: #010101; background-image: initial; background-attachment: initial; background-size: initial; background-origin: initial; background-clip: initial; background-position: initial; background-repeat: initial;\"\u003eLet\u0026rsquo;s find another Hemlo\u0026nbsp;together.\u003c/span\u003e\u003c/p\u003e","__v":0}
{"_id":"226e506a-1f40-49a6-98e0-1dc00c9b7447","name":"Kenora","safeName":"kenora","body":"\u003cp\u003eThe Kenora Greenstone Belt represents an area of historic mining during the 19th and early 20th century, and has seen little exploration since that time. During its time of production, the area accounted for 55% of gold production in Ontario. Gold occurrences in the District are typically high-grade and associated with regionally extensive shear zones, as well as dilational breccias. Recent prospecting in the area by Canstar Resources has returned grab samples of up to 68.0 g/t gold. \u0026nbsp;Further they have delineated a 1.2 kilometer gold bearing structural trend containing grab samples up to 35.3 g/t gold. \u0026nbsp;Historic production in the area reports gold values ranging from 56 g/t to 186 g/t. \u0026nbsp;Very little modern exploration has been conducted in the area and there is strong potential for the area to host numerous, significant deposits.\u003c/p\u003e","__v":0}
{"_id":"c5348daf-ee53-44ae-bfc6-2b3584d33ce5","name":"Schreiber","safeName":"schreiber","body":"\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003eSchreiber has been mentioned in the mining news for years. Somehow, however, it has never come into prominence. It has not enjoyed the booms which locate themselves here and there over Canada at different times. It is known, however, that within a few miles of town there are several properties on which gold can be found. Some showings are actually sensational. High grade samples come frequently from various locations.\u0026nbsp; What has yet to be done is to locate a piece of ground where the gold depositions have been general, in such quantity and so distributed as to warrant a big scale mining operation. It may be that a number of small mills will be kept going on properties already under exploration and development but the big ambition will remain to find a property of size, one which would warrant a mill giving employment to at least a hundred men. That would constitute an important industry and become a valuable contribution to the community.\u0026nbsp; Hope in this connection is deferred but is not dead. Geologists have reported favorably and practical mining men who are not geologists also express the belief that someday the big find will be made. It is declared to be an impossibility that gold can be so scattered about the territory without the existence at some point of what in some parts of the world is called the 'Mother Lode' (News-Chronicle, Thunder Bay, ON, July 23rd 1936).\u003c/p\u003e\n\u003cp class=\"MsoNormal\" style=\"margin-bottom: .0001pt;\"\u003e\u0026nbsp;It has been 56 years since that article was published, and Schreiber's \"big mine\" has yet to be found. However, the opinions and beliefs put forward in 1936 are still shared by the prospecting community today. Prior recommendations made by the Resident Geologist's Program, (Schnieders et al. 1992), echo the sentiment that the Schreiber area remains a viable exploration target for gold and to some extent for base metals. With the recent development and evolution of a porphyry-related model for the Hemlo gold deposit, the Schreiber-Hemlo District offers some excellent targets for consideration. Recent work by GTA Resources and Mining, suggests potential for large tonnage-low grade deposits hosted in felsic intrusive rocks.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;It is remarkable of the Schreiber area that a considerable number of finds have been made over a long span of years. There seems to be gold in almost every direction from the town. The difficulty has been to get sizeable deposits, veins with reasonable values that could be measured in something more than inches width. Some people hold the belief that the numerous finds point to the certainty that someday, whenever it is, the discovery of a big main zone in that section will be made (News-Chronicle Thunder Bay, ON, March 27th 1937).\u003c/p\u003e","__v":0}
