{"_id":{"$oid":"57059cf21701cab237291352"},"id":"0bf9e92b-d212-4f4a-8164-c5f18debda08","body":"New staking in HEMLO called the Lunny Lake property that contains 4 kilometers of the Lunny Lake QFP and strike extension of high-grade gold intercepts from previous drilling by Hemlo Gold Mines.","created":{"$date":"2015-01-03T11:57:00.000Z"},"__v":0}
{"_id":{"$oid":"57059cf21701cab237291353"},"id":"a83840d3-75f1-44ef-9622-ac3562ff57c3","body":"Additional Staking at Little Bear Lake to cover the western extension of a high-grade gold zone (53.7 g/t gold).  The zone is 1.8 kilometers long and open in all directions.","created":{"$date":"2015-01-03T12:05:00.000Z"},"__v":0}
{"_id":{"$oid":"57059cf21701cab237291354"},"id":"83c62653-d9f2-42f3-919d-f4e7d5e3b23a","body":"Recent staking now brings the 'Schreiber Gold Project' to 210 claims (8,400 acres) covering 15 kilometers of favourable geology along the Terrace Bay Batholith contact. The Project consists of the Little Bear, Hays, Perch and Minnow properties.","created":{"$date":"2015-01-03T12:13:00.000Z"},"__v":0}
{"_id":{"$oid":"57059cf21701cab237291355"},"id":"dd440cd4-6299-449b-ad3f-7f690cb8edf0","body":"A high-grade Z-Pb-Ag occurrence in HEMLO has just been staked.  A grab sample collected by a prospector from the occurrence in 1991 returned assay values of 10.7% Zn, 8.9% Pb and 77.8 g/t Ag.","created":{"$date":"2015-01-11T18:22:00.000Z"},"__v":0}
{"_id":{"$oid":"57059cf21701cab237291356"},"id":"225ec43f-41a0-47da-a37f-2af4f2e03402","body":"New staking in Schreiber.  The Hays Lake property is host to eight gold showings ranging from 2.0 g/t to 5.5 g/t and lies just 500 meters from the Derraugh-Jeddar main vein where small-scale mining has taken place.","created":{"$date":"2014-05-03T00:00:00.000Z"},"__v":0}
{"_id":{"$oid":"57059cf21701cab237291357"},"id":"c872cf01-1819-4874-a920-ddb900195cc5","body":"Government mag data supports an Ultramafic/Mafic Intrusion at Victoria Lake (refer to VL Mag.png).","created":{"$date":"2015-01-24T17:19:00.000Z"},"__v":0}
{"_id":{"$oid":"57059cf21701cab237291358"},"id":"c48472f7-1825-4912-beb4-59c60fcff83f","body":"Claims staked at Santoy Mountain covering a high-priority VMS target, adjacent to high-grade gold, silver and copper mineralization.  Values in excess of 9,000 ppm lead have been reported from soils within the Santoy Mountain property.","created":{"$date":"2015-03-22T17:29:00.000Z"},"__v":0}
{"_id":{"$oid":"57059cf21701cab237291359"},"id":"0891420d-f28e-45c6-9e6f-cc0512e3d090","body":"NEW STAKING in HEMLO covers a 2 kilometer strike length of a mafic volcanic unit, which is presumed to be the host of high grade gold float assaying 16.2 grams/tonne gold found just 450 meters southwest of the property.","created":{"$date":"2015-03-27T21:35:00.000Z"},"__v":0}
{"_id":{"$oid":"57059cf21701cab23729135a"},"id":"59c4682b-4028-4764-9a5a-2c8b7abbe6c6","body":"Additional staking to the east of the gold-bearing IF on the Little Bear property has turned up 9 additional gold showings.  The showings, on the Hays Lake property, have re-enforced the gold potential in this under-explored area.","created":{"$date":"2015-03-29T20:28:00.000Z"},"__v":0}
{"_id":{"$oid":"57059cf21701cab23729135b"},"id":"45b4639f-ab52-457e-a89e-38837d2be05e","body":"The website is currently under construction to include new staking in the Schreiber camp as a result of the significant discovery made by GTA Resources and Mining Inc.","created":{"$date":"2012-03-13T00:00:00.000Z"},"__v":0}
{"_id":{"$oid":"57059cf21701cab23729135c"},"id":"c28ef32f-a01e-418c-9dfc-8db992db8952","body":"Recent staking north of Schreiber results in a 320 acre property (Schreiber-Pyramid) containing a 2 km strike length of iron formation yielding assays up to 31.0% Zn, 17.5% copper and 139 g/t silver.","created":{"$date":"2015-05-09T18:00:00.000Z"},"__v":0}
{"_id":{"$oid":"57059cf21701cab23729135d"},"id":"92e1b3ca-a014-44f5-b7c8-c5b102c300a4","body":"The recently staked 23-unit Galoche Lake property lies 2 km east of a recent high-grade gold discovery by Rouge Resources and 11 km west of Nickel One's Tyko Property which hosts two discrete Ni-Cu-PGE showings.","created":{"$date":"2015-06-14T15:12:00.000Z"},"__v":0}
{"_id":{"$oid":"57059cf21701cab23729135e"},"id":"33db8c6c-eec0-483d-84c5-78649a254951","body":"New staking in HEMLO doubles the size of the highly-prospective Black River Property.","created":{"$date":"2015-06-20T15:34:00.000Z"},"__v":0}
{"_id":{"$oid":"57059cf21701cab23729135f"},"id":"66ebb6d0-b7ff-437c-aeba-c02c17a3cf3c","body":"New Property Available For Option. The 154-unit Bozema Lake Property contains a potassium radiometric anomaly with sodium depletion, that extends for over 6 kilometers through the property.","created":{"$date":"2015-07-05T14:12:00.000Z"},"__v":0}
{"_id":{"$oid":"57059cf21701cab237291360"},"id":"91b8e26b-fcb6-47a5-90e2-45765b923d72","body":"New staking (Minnow Lake) adjacent the Terrace Bay Batholith contact covering iron formation and carbonate alteration just west of the Empress Mine.","created":{"$date":"2014-05-04T00:00:00.000Z"},"__v":0}
{"_id":{"$oid":"57059cf21701cab237291361"},"id":"b4d06e9d-f39c-4da8-83a3-3c9fe851c92e","body":"New staking adjacent the Scramble Mine in Kenora covering the SW strike and depth of the Scramble deposit.  The deposit contains 139,000 tons at a grade of 8.2 g/t in the proven, probable and possible categories and remains open along strike and depth.","created":{"$date":"2015-09-13T17:30:00.000Z"},"__v":0}
{"_id":{"$oid":"57059cf21701cab237291362"},"id":"db871952-6c35-409f-88fc-4e3223d80922","body":"Owl Lake property now available.  Mag and Cu-Ni-Pt results of lake sediments coupled a strong Mag anomaly in the Owl Lake area indicates there good potential for PGE mineralization within the property.","created":{"$date":"2011-11-05T00:00:00.000Z"},"__v":0}
{"_id":{"$oid":"57059cf21701cab237291363"},"id":"66a24e19-7168-4871-ab6e-7592c5d03672","body":"New staking adjacent the Coco-Estelle Deposit (53,700 tonnes grading 10.7 g/t gold).  The claim group contains 20 gold and base metal occurrences.","created":{"$date":"2016-01-03T18:06:00.000Z"},"__v":0}
{"_id":{"$oid":"57059cf21701cab237291364"},"id":"d1c699fe-23e3-4526-99e5-45d66cb4a2e3","body":"New staking in Kenora adjacent Intact Gold Corp's Black Jack-Gold Hill Mine property.  The 39-unit Rushing River property is host to six gold occurrences, including four shafts.  There has been no work on the property in nearly thirty years.","created":{"$date":"2016-02-28T21:18:00.000Z"},"__v":0}
{"_id":{"$oid":"57059cf21701cab237291365"},"id":"68a2fd96-af88-4190-9193-63077f0ff209","body":"A recent shift in focus for rare metals to complement gold holdings is underway, with tantalum as the current target.  Three new tantalum projects have been recently acquired with details on each to follow soon, with more projects lined up for staking.","created":{"$date":"2013-04-05T00:00:00.000Z"},"__v":0}
{"_id":{"$oid":"57059cf21701cab237291366"},"id":"a409a079-a6e9-4599-8fc9-64d9c50f9823","body":"GTA announces 42M tonnes of gold resources containing 1.2M ounces of gold in Schreiber.","created":{"$date":"2014-06-12T00:00:00.000Z"},"__v":0}
{"_id":{"$oid":"57059cf21701cab237291367"},"id":"777671f6-9a5f-49ca-9709-6f44a3df20c8","body":"New staking in Schreiber at Ansell Lake.  The property covers a significant copper/silver occurrence with strong mineralization over impressive widths.  Local footwall alteration within adjacent rocks are indicative of volcanogenic massive sulphide deposits.","created":{"$date":"2013-02-03T00:00:00.000Z"},"__v":0}
{"_id":{"$oid":"57059cf21701cab237291368"},"id":"efacaa27-2a99-4d7e-8ab1-9cf04ae17b80","body":"Little Bear Property available.  BRAND NEW DISCOVERY returns bonanza style grades of gold up to 53.7 g/t gold and 19.25 g/t silver. The property surrounds a shaft where a one ton bulk sample averaged a grade of 1,419 g/ton gold.","created":{"$date":"2014-01-25T00:00:00.000Z"},"__v":0}
{"_id":{"$oid":"57059cf21701cab237291369"},"id":"69233c27-5f9c-49c9-9dbb-b43e21c4f196","body":"New staking west of the Empress Mine trend.  The Perch Lake property covers 6.5 km of the favourable Terrace Bay batholith contact - the host for several new high-grade gold discoveries.","created":{"$date":"2014-03-23T00:00:00.000Z"},"__v":0}
{"_id":{"$oid":"57059cf21701cab23729136a"},"id":"287bfabb-0961-4d5a-9492-b750af543f4e","body":"Details on three new tantalum projects are now available.  Each of the properties represent a unique opportunity for a potential high-grade tantalum deposit.  Refer to the new 'Tantalum' page for detailed information on each property.  Additional tantalum properties are being considered for staking.","created":{"$date":"2013-04-07T00:00:00.000Z"},"__v":0}
{"_id":{"$oid":"57059cf21701cab23729136b"},"id":"9e1aac66-65f5-4319-8d6e-d466ced282a7","body":"New gold property staked in the Kakagi Lake Area where chip sampling has returned 12.75 g/t gold over 3.0 metres and drilling has intersected values up to 3.5 g/t gold over 4.7 metres.","created":{"$date":"2013-04-06T00:00:00.000Z"},"__v":0}
{"_id":{"$oid":"57059cf21701cab23729136c"},"id":"53bce57a-aa19-455e-b2cd-6f0e7c735820","body":"Significant new property staked (Victoria Lake).  The property holds great promise for a significant find of both zinc-copper mineralization as well as nickel-copper-PGE mineralization.","created":{"$date":"2014-12-31T21:22:00.000Z"},"__v":0}
{"_id":{"$oid":"57059cf21701cab23729136d"},"id":"882cbc56-1917-4b5d-a77a-a6bc2133a098","body":"We have located a gold-bearing iron formation.  The IF contains up to 54 g/t gold in outcrop and 18 g/t gold in soil.  It appears to have a minimum strike length of 1.5 km and is wide open.","created":{"$date":"2015-03-29T20:24:00.000Z"},"__v":0}
